// ============================================================
// Image: Assembly-CSharp.dll
// ============================================================

// Namespace: <global>
class b : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Unit* OwnerUnit; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Animator* Animatior; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    EUNITSTATE bavr; // 0x0030

    // Methods
    void Awake();  // RVA: 0x800AB0
    void dtm(float a);  // RVA: 0x800C30
    void oba();  // RVA: 0x800D30
    void dtn(Il2CppString* a);  // RVA: 0x800C50
    void bbn();  // RVA: 0x800B70
    void oqk(float a);  // RVA: 0x800C30
    void lkp(float a);  // RVA: 0x800C30
    void euv(float a);  // RVA: 0x800C30
    void Update();  // RVA: 0x63E350
    void dtl(EUNITSTATE a);  // RVA: 0x41AB50
    void mgp();  // RVA: 0x800C70
    void .ctor();  // RVA: 0x629810
};

// Namespace: <global>
class c : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Action* OnACTIVE; // 0x0020

    // Methods
    void bhs();  // RVA: 0x8078D0
    void dtp();  // RVA: 0x8078D0
    void hln();  // RVA: 0x8078D0
    void .ctor();  // RVA: 0x629810
    void cfe(Action* a);  // RVA: 0x8078F0
    void ncd(Action* a);  // RVA: 0x807B70
    void eje(Action* a);  // RVA: 0x807A30
    void dto(Action* a);  // RVA: 0x807990
    void ewl(Action* a);  // RVA: 0x807AD0
    void lqw();  // RVA: 0x8078D0
};

// Namespace: <global>
class g
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bavs; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* bavt; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    FlickerController* bavu; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float bavv; // 0x0028

    // Methods
    void .ctor(int32_t a);  // RVA: 0x67D2D0
    void dtq();  // RVA: 0x63E350
    bool MoveNext();  // RVA: 0x807C10
    Il2CppObject* dtr();  // RVA: 0x691970
    void dts();  // RVA: 0x807D50
    Il2CppObject* dtt();  // RVA: 0x691970
};

// Namespace: <global>
class FlickerController : public MonoBehaviour
{
public:
    // Static fields
    // static MaterialPropertyBlock* bavw;
    // static int32_t bavx;

    uint8_t pad_0000[0x20]; // 0x0000
    SpriteRenderer* m_spriteRenderer; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float m_targetValue; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    float m_flickTime; // 0x002C
    uint8_t pad_002D[0x3]; // 0x002D
    Coroutine* bavy; // 0x0030

    // Methods
    void Awake();  // RVA: 0x7F6020
    void dtu();  // RVA: 0x7F6160
    void dtv();  // RVA: 0x7F6200
    IEnumerator* dtw();  // RVA: 0x7F6250
    void dtx(float a);  // RVA: 0x7F62C0
    void .ctor();  // RVA: 0x629810
    static void .cctor();  // RVA: 0x7F60F0
};

// Namespace: <global>
class h : public MonoBehaviour
{
public:

    // Methods
    void .ctor();  // RVA: 0x629810
    void Update();  // RVA: 0x63E350
    void Start();  // RVA: 0x63E350
    void hyj();  // RVA: 0x63E350
    void ipa();  // RVA: 0x63E350
    void cex();  // RVA: 0x63E350
    void fdk();  // RVA: 0x63E350
    void cfl();  // RVA: 0x63E350
};

// Namespace: <global>
class k : public b
{
public:

    // Methods
    void Update();  // RVA: 0x807D90
    void dtl(EUNITSTATE a);  // RVA: 0x807E60
    void .ctor();  // RVA: 0x629810
};

// Namespace: <global>
class m : public MonoBehaviour
{
public:

    // Methods
    void .ctor();  // RVA: 0x629810
    void onr();  // RVA: 0x63E350
    void mz();  // RVA: 0x63E350
    void Start();  // RVA: 0x63E350
    void hvw();  // RVA: 0x63E350
    void idn();  // RVA: 0x63E350
    void Update();  // RVA: 0x63E350
    void bdx();  // RVA: 0x63E350
    void elm();  // RVA: 0x63E350
    void osl();  // RVA: 0x63E350
};

// Namespace: <global>
class HpBar : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    RectTransform* rect_m; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Slider* slider; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Image* image_Fillarea; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Unit* unit_Attach; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Vector3 monsterOffset; // 0x0040
    uint8_t pad_0041[0xB]; // 0x0041
    Vector3 heroOffset; // 0x004C
    uint8_t pad_004D[0xB]; // 0x004D
    Color color_Monster; // 0x0058
    uint8_t pad_0059[0xF]; // 0x0059
    Color color_Hero; // 0x0068

    // Methods
    void dty(Unit* a);  // RVA: 0x7F7860
    void Update();  // RVA: 0x7F7760
    void dtz();  // RVA: 0x7F7990
    void dua(float a);  // RVA: 0x7F7AC0
    void dub();  // RVA: 0x7F7B10
    void .ctor();  // RVA: 0x7F77B0
};

// Namespace: <global>
class n : public b
{
public:

    // Methods
    void dtl(EUNITSTATE a);  // RVA: 0x808020
    void .ctor();  // RVA: 0x629810
};

// Namespace: <global>
struct EUNITSTATE
{
public:
    // Static fields
    // static EUNITSTATE NONE;
    // static EUNITSTATE IDLE;
    // static EUNITSTATE MOVE;
    // static EUNITSTATE RETURN_TO_POSITION;
    // static EUNITSTATE ATTACK;
    // static EUNITSTATE REVIVE;
    // static EUNITSTATE DIE;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
struct EATTACKSTATE
{
public:
    // Static fields
    // static EATTACKSTATE PREDELAY;
    // static EATTACKSTATE ACTIONTIME;
    // static EATTACKSTATE POSTDELAY;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
struct TextDisplayPosition
{
public:
    // Static fields
    // static TextDisplayPosition Center;
    // static TextDisplayPosition Top;
    // static TextDisplayPosition Bottom;
    // static TextDisplayPosition TopOffset;
    // static TextDisplayPosition CenterUp;
    // static TextDisplayPosition CenterDown;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
class o
{
public:
    // Static fields
    // static intptr_t bavz;
    // static int32_t bawa;
    // static int32_t bawb;


    // Methods
    void .ctor();  // RVA: 0x629380
    static void duc(Il2CppString* a, bool b);  // RVA: 0x808570
    static void .cctor();  // RVA: 0x808510
    static int32_t RegDeleteValue(intptr_t hKey, Il2CppString* lpValueName);  // RVA: 0x8082B0
    static int32_t RegSetValueEx(intptr_t hKey, Il2CppString* lpValueName, int32_t Reserved, int32_t dwType, Il2CppString* lpData, int32_t cbData);  // RVA: 0x808420
    static uint32_t GetModuleFileName(intptr_t hModule, StringBuilder* lpFilename, int32_t nSize);  // RVA: 0x808160
    static int32_t RegOpenKeyEx(intptr_t hKey, Il2CppString* lpSubKey, int32_t ulOptions, int32_t samDesired, intptr_t phkResult);  // RVA: 0x808350
    static int32_t RegCloseKey(intptr_t hKey);  // RVA: 0x808230
};

// Namespace: <global>
class MonitorEnumDelegate : public MulticastDelegate
{
public:

    // Methods
    void .ctor(Il2CppObject* object, intptr_t method);  // RVA: 0x7F8540
    bool Invoke(intptr_t hMonitor, intptr_t hdcMonitor, intptr_t lprcMonitor, intptr_t dwData);  // RVA: 0x7F8520
    IAsyncResult* BeginInvoke(intptr_t hMonitor, intptr_t hdcMonitor, intptr_t lprcMonitor, intptr_t dwData, AsyncCallback* callback, Il2CppObject* object);  // RVA: 0x7F8440
    bool EndInvoke(IAsyncResult* result);  // RVA: 0x7F84F0
};

// Namespace: <global>
class p : public MonoBehaviour
{
public:
    // Static fields
    // static uint32_t bawc;
    // static int32_t bawd;
    // static int32_t bawe;
    // static RECT bawf;


    // Methods
    static bool EnumDisplayMonitors(intptr_t hdc, intptr_t lprcClip, MonitorEnumDelegate* lpfnEnum, intptr_t dwData);  // RVA: 0x808A30
    void us();  // RVA: 0x8094F0
    void eyq(bool hasFocus);  // RVA: 0x808CA0
    static bool GetMonitorInfo(intptr_t hMonitor, MONITORINFO lpmi);  // RVA: 0x808AF0
    void duf();  // RVA: 0x8090A0
    static bool GetWindowRect(intptr_t hwnd, RECT rect);  // RVA: 0x808B80
    void OnApplicationFocus(bool hasFocus);  // RVA: 0x808CA0
    void nun(bool hasFocus);  // RVA: 0x808CA0
    static bool due(intptr_t a, intptr_t b, intptr_t c, intptr_t d);  // RVA: 0x808E90
    void .ctor();  // RVA: 0x629810
    void ouc();  // RVA: 0x809420
    void imx(bool hasFocus);  // RVA: 0x808CA0
    void bny(bool hasFocus);  // RVA: 0x808CA0
    void dud();  // RVA: 0x808CB0
    void hle();  // RVA: 0x809170
    void iia();  // RVA: 0x809350
    static intptr_t MonitorFromWindow(intptr_t hwnd, uint32_t dwFlags);  // RVA: 0x808C10
};

// Namespace: <global>
class BoxEffectController : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    System.Collections.Generic.List<SpriteAnimation_Image> animationLists; // 0x0020

    // Methods
    void dug(int32_t a);  // RVA: 0x7F5A20
    bool duh();  // RVA: 0x7F5C20
    void OnDisable();  // RVA: 0x7F5930
    void .ctor();  // RVA: 0x629810
};

// Namespace: <global>
class q : public MonoBehaviour
{
public:

    // Methods
    void OnPointerDown(PointerEventData* eventData);  // RVA: 0x63E350
    void OnPointerUp(PointerEventData* eventData);  // RVA: 0x63E350
    void .ctor();  // RVA: 0x629810
};

// Namespace: <global>
class ItemSlotDirectMovePreview : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    RectTransform* RectTransform; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Image* m_hoverTargetImage; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Sprite* m_moveToTradingStashIcon; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Sprite* m_moveToCubeIcon; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Sprite* m_moveToInventoryIcon; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    Sprite* m_moveToStashIcon; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Sprite* m_moveToGearIcon; // 0x0050

    // Methods
    void dui(ESlotType a, ESlotType b);  // RVA: 0x7F7B30
    void .ctor();  // RVA: 0x629810
};

// Namespace: <global>
struct <DelayedAnimation>d__7
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    SelectHeroEffectController* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x7FD230
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7FD220
};

// Namespace: <global>
class SelectHeroEffectController : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    SpriteAnimation_Image* spriteAnimationImage; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    SpriteAnimation_Image[][] effectObjects; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    int32_t targetFrame; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float delay; // 0x0034

    // Methods
    void Awake();  // RVA: 0x7F86D0
    void OnDestroy();  // RVA: 0x7F87D0
    void duj(int32_t a);  // RVA: 0x7F8910
    UniTaskVoid duk();  // RVA: 0x7F89D0
    void dul();  // RVA: 0x7F8A60
    void .ctor();  // RVA: 0x629810
};

// Namespace: <global>
struct <DelayedAnimation>d__9
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    SelectHeroShakeFlashController* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x7FD490
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7FD220
};

// Namespace: <global>
class SelectHeroShakeFlashController : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    SpriteAnimation_Image* spriteAnimationImage; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    int32_t targetFrame; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    SelectHeroOption* selectHeroOption; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    bool hasFlash; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Il2CppString* otherAnimKey; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    bool hasShake; // 0x0048
    uint8_t pad_0049[0x3]; // 0x0049
    float delay; // 0x004C

    // Methods
    void Awake();  // RVA: 0x7F8CA0
    void OnDestroy();  // RVA: 0x7F8DA0
    UniTaskVoid dum();  // RVA: 0x7F9040
    void Play(int32_t frame);  // RVA: 0x7F8EE0
    void Play();  // RVA: 0x7F8FA0
    void .ctor();  // RVA: 0x629810
};

// Namespace: <global>
class r
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    SkillPointAnimationController* bawg; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    RectTransform* bawh; // 0x0018

    // Methods
    void .ctor();  // RVA: 0x629380
    void dun();  // RVA: 0x8095C0
};

// Namespace: <global>
class SkillPointAnimationController : public MonoBehaviour
{
public:
    // Static fields
    // static Color bawi;
    // static Color bawj;

    uint8_t pad_0000[0x20]; // 0x0000
    Image* m_sliderBarCover; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    GameObject* prefab; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Transform* poolHolder; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Transform[][] m_iconTargetPos; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    float m_animDurationTime; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    System.Collections.Generic.Queue<UnityEngine.RectTransform> bawk; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    System.Collections.Generic.List<UnityEngine.RectTransform> bawl; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    Tweener* bawm; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    ActiveSkillSlotDetail* bawn; // 0x0060

    // Methods
    void Awake();  // RVA: 0x7F90D0
    void duo();  // RVA: 0x7F9480
    void dup();  // RVA: 0x7F9570
    void duq(bool a);  // RVA: 0x7F9790
    void dur();  // RVA: 0x7F99F0
    void dus();  // RVA: 0x7F9B30
    void dut(Color a);  // RVA: 0x7F9C70
    void duu(int32_t a, int32_t b);  // RVA: 0x7F9D50
    RectTransform* duv();  // RVA: 0x7FA280
    void duw(RectTransform* a);  // RVA: 0x7FA3C0
    void OnDisable();  // RVA: 0x7F9200
    void .ctor();  // RVA: 0x7F93B0
    static void .cctor();  // RVA: 0x7F9350
};

// Namespace: <global>
class ActSlot : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    int32_t act; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* text_ActName; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Button* btn; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    ToggleButton* button_toggle; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    float m_selectedCorrectionY; // 0x0040
    uint8_t pad_0041[0x3]; // 0x0041
    float m_unSelectedCorrectionY; // 0x0044
    uint8_t pad_0045[0x3]; // 0x0045
    Color m_selectedColor; // 0x0048
    uint8_t pad_0049[0xF]; // 0x0049
    Color m_unSelectedColor; // 0x0058
    uint8_t pad_0059[0xF]; // 0x0059
    System.Action<System.Int32> bawo; // 0x0068

    // Methods
    void dux(int32_t a, System.Action<System.Int32> b);  // RVA: 0x7F2D50
    void duy();  // RVA: 0x7F2EB0
    void duz(bool a);  // RVA: 0x7F2F90
    void dva();  // RVA: 0x7F3070
    void .ctor();  // RVA: 0x629810
};

// Namespace: <global>
class u : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    System.Collections.Generic.List<TaskbarHero.UI.AttributeSlot> attributeSlots; // 0x0020

    // Methods
    void .ctor();  // RVA: 0x809670
};

// Namespace: <global>
class LogSlot : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    RectTransform* rt; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* Text_LogText; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Animator* animator; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    cba* feedback1; // 0x0038

    // Methods
    void dvb(Il2CppString* a, Vector2 b, GradeSO* c);  // RVA: 0x7F8270
    void offObject();  // RVA: 0x63E350
    void dvc();  // RVA: 0x7F83E0
    void .ctor();  // RVA: 0x629810
};

// Namespace: <global>
class ba : public MonoBehaviour
{
public:

    // Methods
    void .ctor();  // RVA: 0x629810
    void hwz();  // RVA: 0x63E350
    void fyj();  // RVA: 0x63E350
    void Start();  // RVA: 0x63E350
    void kdf();  // RVA: 0x63E350
    void bqr();  // RVA: 0x63E350
    void Update();  // RVA: 0x63E350
    void nrv();  // RVA: 0x63E350
};

// Namespace: <global>
class bb
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bawp; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* bawq; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BlinkAnimation* bawr; // 0x0020

    // Methods
    void .ctor(int32_t a);  // RVA: 0x67D2D0
    void dvd();  // RVA: 0x63E350
    bool MoveNext();  // RVA: 0x800DF0
    Il2CppObject* dve();  // RVA: 0x691970
    void dvf();  // RVA: 0x801010
    Il2CppObject* dvg();  // RVA: 0x691970
};

// Namespace: <global>
class bc
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t baws; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* bawt; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BlinkAnimation* bawu; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float bawv; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    float baww; // 0x002C
    uint8_t pad_002D[0x3]; // 0x002D
    float bawx; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float bawy; // 0x0034

    // Methods
    void .ctor(int32_t a);  // RVA: 0x67D2D0
    void dvh();  // RVA: 0x63E350
    bool MoveNext();  // RVA: 0x801050
    Il2CppObject* dvi();  // RVA: 0x691970
    void dvj();  // RVA: 0x801190
    Il2CppObject* dvk();  // RVA: 0x691970
};

// Namespace: <global>
class bd
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bawz; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* baxa; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BlinkAnimation* baxb; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float baxc; // 0x0028

    // Methods
    void .ctor(int32_t a);  // RVA: 0x67D2D0
    void dvl();  // RVA: 0x63E350
    bool MoveNext();  // RVA: 0x8011D0
    Il2CppObject* dvm();  // RVA: 0x691970
    void dvn();  // RVA: 0x8012E0
    Il2CppObject* dvo();  // RVA: 0x691970
};

// Namespace: <global>
class BlinkAnimation : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    float blinkSpeed; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    float minAlpha; // 0x0024
    uint8_t pad_0025[0x3]; // 0x0025
    float maxAlpha; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    bool smoothBlink; // 0x002C
    bool playOnStart; // 0x002D
    bool loop; // 0x002E
    bool unscaledTime; // 0x002F
    SpriteRenderer* baxd; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Image* baxe; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    CanvasGroup* baxf; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    TextMesh* baxg; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    MeshRenderer* baxh; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    TextMeshProUGUI* baxi; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    TextMeshPro* baxj; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    bool baxk; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    Coroutine* baxl; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    float baxm; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    Action* OnBlinkStart; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    Action* OnBlinkEnd; // 0x0088
    uint8_t pad_0089[0x7]; // 0x0089
    Action* OnBlinkCycle; // 0x0090

    // Methods
    bool dvp();  // RVA: 0x7F3150
    float dvq();  // RVA: 0x7F3160
    void dvr(float a);  // RVA: 0x7F3170
    float dvs();  // RVA: 0x7F3190
    float dvt();  // RVA: 0x7F31A0
    void Awake();  // RVA: 0x7F3090
    void Start();  // RVA: 0x7F3120
    void OnValidate();  // RVA: 0x7F30B0
    void dvu();  // RVA: 0x7F31B0
    void dvv();  // RVA: 0x7F3480
    void dvw();  // RVA: 0x7F36F0
    void dvx();  // RVA: 0x7F37A0
    void dvy();  // RVA: 0x7F37F0
    void dvz();  // RVA: 0x7F38E0
    void dwa(float a);  // RVA: 0x7F38F0
    float dwb();  // RVA: 0x7F3D00
    void dwc(float a, float b, float c, bool d);  // RVA: 0x7F3F70
    IEnumerator* dwd();  // RVA: 0x7F40E0
    IEnumerator* dwe(float a);  // RVA: 0x7F4150
    IEnumerator* dwf(float a);  // RVA: 0x7F41D0
    void dwg();  // RVA: 0x7F4250
    void .ctor();  // RVA: 0x7F3130
};

// Namespace: <global>
struct SpriteAnimClip
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Il2CppString* ClipName; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Sprite[][] Sprites; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bool Loop; // 0x0020
};

// Namespace: <global>
class be
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t baxn; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* baxo; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    SpriteAnimation_Image* baxp; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float baxq; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    int32_t baxr; // 0x002C

    // Methods
    void .ctor(int32_t a);  // RVA: 0x67D2D0
    void dwh();  // RVA: 0x63E350
    bool MoveNext();  // RVA: 0x801320
    Il2CppObject* dwi();  // RVA: 0x691970
    void dwj();  // RVA: 0x801560
    Il2CppObject* dwk();  // RVA: 0x691970
};

// Namespace: <global>
class SpriteAnimation_Image : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Image* image; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    System.Collections.Generic.List<UnityEngine.Sprite> sprites; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float duration; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float speed; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    bool playOnStart; // 0x0038
    bool PlayOnEnable; // 0x0039
    bool loop; // 0x003A
    bool unscaledTime; // 0x003B
    bool m_deactivateOnComplete; // 0x003C
    uint8_t pad_003D[0x3]; // 0x003D
    Coroutine* baxs; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    bool baxt; // 0x0048
    uint8_t pad_0049[0x3]; // 0x0049
    int32_t baxu; // 0x004C
    uint8_t pad_004D[0x3]; // 0x004D
    Action* OnAnimationStart; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    Action* OnAnimationComplete; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    System.Action<System.Int32> OnFrameChanged; // 0x0060

    // Methods
    Image* dwl();  // RVA: 0x63B450
    System.Collections.Generic.List<UnityEngine.Sprite> dwm();  // RVA: 0x6810D0
    float dwn();  // RVA: 0x7FA6E0
    float dwo();  // RVA: 0x7FA6F0
    bool dwp();  // RVA: 0x7FA700
    bool dwq();  // RVA: 0x7FA710
    int32_t dwr();  // RVA: 0x7FA720
    int32_t dws();  // RVA: 0x7FA730
    float dwt();  // RVA: 0x7FA770
    void Start();  // RVA: 0x7FA5F0
    void OnEnable();  // RVA: 0x7FA4E0
    void OnValidate();  // RVA: 0x7FA540
    void dwu();  // RVA: 0x7FA7C0
    void dwv();  // RVA: 0x7FA9A0
    void dww();  // RVA: 0x7FA9F0
    void dwx(int32_t a);  // RVA: 0x7FAA80
    void dwy();  // RVA: 0x7FAB80
    void dwz();  // RVA: 0x7FABD0
    IEnumerator* dxa();  // RVA: 0x7FAC30
    void dxb(float a, float b, bool c);  // RVA: 0x7FACA0
    void dxc(System.Collections.Generic.List<UnityEngine.Sprite> a);  // RVA: 0x7FAD40
    void dxd(Sprite* a);  // RVA: 0x7FAEC0
    void dxe(int32_t a);  // RVA: 0x7FAF50
    void dxf();  // RVA: 0x7FAFE0
    void dxg();  // RVA: 0x63E350
    void .ctor();  // RVA: 0x7FA650
};

// Namespace: <global>
class bf
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t baxv; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* baxw; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    SpriteAnimation_SpriteRenderer* baxx; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float baxy; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    int32_t baxz; // 0x002C

    // Methods
    void .ctor(int32_t a);  // RVA: 0x67D2D0
    void dxh();  // RVA: 0x63E350
    bool MoveNext();  // RVA: 0x8015A0
    Il2CppObject* dxi();  // RVA: 0x691970
    void dxj();  // RVA: 0x801A80
    Il2CppObject* dxk();  // RVA: 0x691970
};

// Namespace: <global>
class SpriteAnimation_SpriteRenderer : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    SpriteRenderer* spriteRenderer; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    System.Collections.Generic.List<UnityEngine.Sprite> sprites; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float duration; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float delay; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    bool playOnStart; // 0x0038
    bool PlayOnEnable; // 0x0039
    bool DisableObjectWhenPlayEnd; // 0x003A
    bool m_disableRendererWhenPlayEnd; // 0x003B
    bool loop; // 0x003C
    bool unscaledTime; // 0x003D
    bool randomZRotation; // 0x003E
    uint8_t pad_003F[0x1]; // 0x003F
    Coroutine* baya; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    bool bayb; // 0x0048
    uint8_t pad_0049[0x3]; // 0x0049
    int32_t bayc; // 0x004C
    uint8_t pad_004D[0x3]; // 0x004D
    Color bayd; // 0x0050
    uint8_t pad_0051[0xF]; // 0x0051
    bool baye; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    WaitForSeconds* bayf; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    WaitForSecondsRealtime* bayg; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    float bayh; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    Action* OnAnimationStart; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    Action* OnAnimationComplete; // 0x0088
    uint8_t pad_0089[0x7]; // 0x0089
    System.Action<System.Int32> OnFrameChanged; // 0x0090
    uint8_t pad_0091[0x7]; // 0x0091
    Action* OnDelayStart; // 0x0098
    uint8_t pad_0099[0x7]; // 0x0099
    Action* OnDelayComplete; // 0x00A0

    // Methods
    SpriteRenderer* dxl();  // RVA: 0x63B450
    System.Collections.Generic.List<UnityEngine.Sprite> dxm();  // RVA: 0x6810D0
    float dxn();  // RVA: 0x7FA6E0
    float dxo();  // RVA: 0x7FA6F0
    bool dxp();  // RVA: 0x7FB350
    bool dxq();  // RVA: 0x7FA710
    int32_t dxr();  // RVA: 0x7FA720
    int32_t dxs();  // RVA: 0x7FB360
    float dxt();  // RVA: 0x7FB3A0
    void Start();  // RVA: 0x7FB230
    void OnEnable();  // RVA: 0x7FB110
    void OnDisable();  // RVA: 0x7FB070
    void dxu();  // RVA: 0x7FB3F0
    void dxv();  // RVA: 0x7FB480
    void OnValidate();  // RVA: 0x7FB180
    void dxw();  // RVA: 0x7FB580
    void dxx();  // RVA: 0x7FB680
    void dxy();  // RVA: 0x7FB730
    void dxz(int32_t a);  // RVA: 0x7FB7A0
    void dya();  // RVA: 0x7FB8A0
    void dyb();  // RVA: 0x7FB8F0
    WaitForSeconds* dyc(float a);  // RVA: 0x7FB950
    WaitForSecondsRealtime* dyd(float a);  // RVA: 0x7FBA20
    IEnumerator* dye();  // RVA: 0x7FBAF0
    void dyf(float a, float b, bool c);  // RVA: 0x7FBB60
    void dyg(System.Collections.Generic.List<UnityEngine.Sprite> a);  // RVA: 0x7FBBE0
    void dyh(Sprite* a);  // RVA: 0x7FBD30
    void dyi(int32_t a);  // RVA: 0x7FBDC0
    void dyj();  // RVA: 0x7FBE50
    void dyk();  // RVA: 0x63E350
    void .ctor();  // RVA: 0x7FB2C0
};

// Namespace: <global>
class <>c
{
public:
    // Static fields
    // static <>c* <>9;
    // static UnityAction* <>9__15_0;


    // Methods
    static void .cctor();  // RVA: 0x7FDAA0
    void .ctor();  // RVA: 0x629380
    void dyl();  // RVA: 0x7FDB10
};

// Namespace: <global>
class BottomStageQuickMenu : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    bool bayi; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    RectTransform* m_quickMenu; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    ScreenBoundsCorrector* m_screenBoundsCorrector; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    float m_bottomOnTopPos; // 0x0038
    uint8_t pad_0039[0x3]; // 0x0039
    float m_bottomOnBottomPos; // 0x003C
    uint8_t pad_003D[0x3]; // 0x003D
    oi* m_quickMenuHoverCheck; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    Button* m_nonPresetButton; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Button* m_pinBattleScreenButton; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    TextMeshProUGUI* m_pinBattleScreenText; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    Button* m_muteButton; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    TextMeshProUGUI* m_muteText; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    Button* m_alwaysOnTopButton; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    TextMeshProUGUI* m_alwaysOnTopText; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    System.Collections.Generic.List<TaskbarHero.UI.LayoutPresetButton> m_layoutPresetButtons; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    bool bayj; // 0x0088

    // Methods
    void dym();  // RVA: 0x7F4910
    void dyn(bool a);  // RVA: 0x7F5590
    void dyo(bool a);  // RVA: 0x7F5610
    void dyp(bool a);  // RVA: 0x7F56F0
    void dyq(ESoundType a, float b);  // RVA: 0x7F57D0
    void Update();  // RVA: 0x7F48B0
    void OnDisable();  // RVA: 0x629800
    void OnPointerClick(PointerEventData* eventData);  // RVA: 0x7F46E0
    void OnPointerEnter(PointerEventData* eventData);  // RVA: 0x7F48A0
    void OnPointerExit(PointerEventData* eventData);  // RVA: 0x629800
    void .ctor();  // RVA: 0x629810
    void dyr();  // RVA: 0x7F5900
};

// Namespace: <global>
class StageTooltip : public MonoBehaviour
{
public:
    // Static fields
    // static int32_t bayk;
    // static int32_t bayl;

    uint8_t pad_0000[0x20]; // 0x0000
    TextMeshProUGUI* m_titleText; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* m_stageTypeText; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    TextMeshProUGUI* m_stageLevelText; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Image* m_BG; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Sprite[][] m_bgSprites; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    GameObject* m_soulStoneBG; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Image* m_soulStoneIcon; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    TextMeshProUGUI* m_soulStoneAmountText; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    SpriteAnimation_Image* m_bluePortalAnim; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    SpriteAnimation_Image* m_redPortalAnim; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    GameObject* m_lockIcon; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    GameObject* m_bottomText; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    TextMeshProUGUI* m_bottomTextLabel; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    GameObject* m_mouseIcon; // 0x0088
    uint8_t pad_0089[0x7]; // 0x0089
    TextMeshProUGUI* m_enterText; // 0x0090
    uint8_t pad_0091[0x7]; // 0x0091
    Color m_normalColor; // 0x0098
    uint8_t pad_0099[0xF]; // 0x0099
    Color m_actBossColor; // 0x00A8

    // Methods
    void Show(StageCache* cache);  // RVA: 0x7FBEC0
    void Hide();  // RVA: 0x7378B0
    void dys();  // RVA: 0x7FC380
    void dyt(StageCache* a, int32_t b);  // RVA: 0x7FC4E0
    void dyu(bool a, bool b);  // RVA: 0x7FC790
    void dyv(SpriteAnimation_Image* a, SpriteAnimation_Image* b, bool c);  // RVA: 0x7FC7C0
    void dyw(StageCache* a, bool b, bool c, bool d, int32_t e);  // RVA: 0x7FC8E0
    void dyx(bool a, Il2CppString* b, Color c);  // RVA: 0x7FCC20
    void .ctor();  // RVA: 0x629810
};

// Namespace: <global>
struct EWorldUILocation
{
public:
    // Static fields
    // static EWorldUILocation Left;
    // static EWorldUILocation Center;
    // static EWorldUILocation Right;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
class UI_Main : public MonoBehaviour
{
public:
    // Static fields
    // static float bayn;
    // static float bayo;
    // static float bayp;
    // static float bayq;

    uint8_t pad_0000[0x20]; // 0x0000
    UIManager* baym; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    UiStateMachineBehaviour* _usm; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    RectTransform* panel_left; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    RectTransform* panel_right; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    RectTransform* panel_center; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    xr* button_Stash; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    xr* button_Stat; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    xr* button_Cube; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    xr* button_Rune; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    xr* button_Portal; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    System.Collections.Generic.List<xr> ContentButtons; // 0x0070

    // Methods
    void Awake();  // RVA: 0x7FE3E0
    void dyy();  // RVA: 0x7FE7B0
    void Start();  // RVA: 0x7FE680
    void OnEnable();  // RVA: 0x7FE680
    void dyz();  // RVA: 0x7FE8C0
    EWorldUILocation dza(float a);  // RVA: 0x7FEB30
    bool dzb();  // RVA: 0x7FEB50
    bool dzc();  // RVA: 0x7FEBD0
    void dzd();  // RVA: 0x7FEC50
    void dze(float a);  // RVA: 0x7FEC90
    void dzf(float a);  // RVA: 0x7FED40
    void dzg(float a);  // RVA: 0x7FEDF0
    void dzh();  // RVA: 0x7FEEA0
    void dzi();  // RVA: 0x7FEEA0
    void dzj();  // RVA: 0x7FF000
    void dzk();  // RVA: 0x7FF0E0
    void dzl();  // RVA: 0x7FF0F0
    void dzm();  // RVA: 0x7FF340
    void dzn();  // RVA: 0x7FF4C0
    void dzo();  // RVA: 0x7FF4C0
    void .ctor();  // RVA: 0x7FE730
};

// Namespace: <global>
class OfflineHeroSlot
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    GameObject* slotObject; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    TextMeshProUGUI* nameText; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    TextMeshProUGUI* levelText; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* expText; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Image* baseExp; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Image* addedExp; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    GameObject* levelUpFX; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    System.Collections.Generic.List<UnityEngine.GameObject> heroList; // 0x0048

    // Methods
    void .ctor();  // RVA: 0x7F85F0
};

// Namespace: <global>
struct <ShowLevelUpFX>d__21
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    UI_OfflineReward* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    System.Collections.Generic.List<UI_OfflineReward.OfflineHeroSlot> list; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Awaiter <>u__1; // 0x0030

    // Methods
    void MoveNext();  // RVA: 0x7FD6F0
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7FD220
};

// Namespace: <global>
class UI_OfflineReward : public MonoBehaviour
{
public:
    // Static fields
    // static float bayr;
    // static float bays;
    // static EEquipClassType[][] bayt;

    uint8_t pad_0000[0x20]; // 0x0000
    TextMeshProUGUI* m_lastLoginText; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* m_offlineTimeText; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Slider* m_timeSlider; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    TextMeshProUGUI* m_goldText; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    GameObject* m_blockBG; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    OfflineHeroSlot[][] heroSlots; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    CanvasGroup* m_parentCanvasGroup; // 0x0050

    // Methods
    void dzp(OfflineRewardResult a);  // RVA: 0x7FF730
    void dzq(bool a);  // RVA: 0x7FFA10
    void dzr(OfflineRewardResult a);  // RVA: 0x7FFA30
    void dzs(OfflineRewardResult a);  // RVA: 0x7FFCB0
    void dzt(OfflineRewardResult a);  // RVA: 0x7FFD70
    void dzu(OfflineHeroSlot* a, OfflineRewardHeroResult b);  // RVA: 0x8000F0
    void dzv(OfflineHeroSlot* a, HeroInfoData* b);  // RVA: 0x800610
    int32_t dzw(HeroInfoData* a);  // RVA: 0x8007D0
    HeroInfoData* dzx(int32_t a);  // RVA: 0x8008B0
    float dzy(float a, float b);  // RVA: 0x8009A0
    UniTaskVoid dzz(System.Collections.Generic.List<UI_OfflineReward.OfflineHeroSlot> a);  // RVA: 0x8009D0
    void OnDisable();  // RVA: 0x7FF4F0
    void .ctor();  // RVA: 0x629810
    static void .cctor();  // RVA: 0x7FF6A0
    bool eaa();  // RVA: 0x800A80
};

// Namespace: <global>
struct EStatusUIState
{
public:
    // Static fields
    // static EStatusUIState Default;
    // static EStatusUIState StatDetail;
    // static EStatusUIState AttributeDetail;
    // static EStatusUIState SkillEquip;
    // static EStatusUIState SkillSlot;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
class bg : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Vector2 bayu; // 0x0020

    // Methods
    void kif(Vector2 a);  // RVA: 0x801AC0
    void ead(float a);  // RVA: 0x801AD0
    void .ctor();  // RVA: 0x629810
    void hkj(float a);  // RVA: 0x801AD0
    void jin(float a);  // RVA: 0x801AD0
    void ess(float a);  // RVA: 0x801AD0
    void eac(Vector2 a);  // RVA: 0x801AD0
    void lky(Vector2 a);  // RVA: 0x801AC0
    void hsi(Vector2 a);  // RVA: 0x801AC0
    void ldn(float a);  // RVA: 0x801AD0
    void fcb(Vector2 a);  // RVA: 0x801AD0
    void oix(Vector2 a);  // RVA: 0x801AC0
    void eab(Vector2 a);  // RVA: 0x801AC0
};

// Namespace: <global>
struct <UpdateCoolTimeAsync>d__11
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bh* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x7FDFA0
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7FD220
};

// Namespace: <global>
class bh
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    float bayv; // 0x0010
    uint8_t pad_0011[0x3]; // 0x0011
    int32_t bayw; // 0x0014
    uint8_t pad_0015[0x3]; // 0x0015
    System.Action<System.Int32> bayx; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    CancellationTokenSource* bayy; // 0x0020

    // Methods
    void nzs();  // RVA: 0x801C30
    bool eaf();  // RVA: 0x801B20
    void eag();  // RVA: 0x801B30
    void jiw();  // RVA: 0x801E10
    void .ctor(int32_t a);  // RVA: 0x801AE0
    float eae();  // RVA: 0x801B10
    UniTaskVoid eai();  // RVA: 0x801C80
    void eah();  // RVA: 0x801C30
    void gbq();  // RVA: 0x801C30
    void ota();  // RVA: 0x801C30
    void hqb();  // RVA: 0x801D10
};

// Namespace: <global>
class bi
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bayz; // 0x0010

    // Methods
    void .ctor();  // RVA: 0x629380
};

// Namespace: <global>
class bj
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t baza; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* bazb; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    DeadUnitData* bazc; // 0x0020

    // Methods
    void .ctor(int32_t a);  // RVA: 0x67D2D0
    void eaj();  // RVA: 0x63E350
    bool MoveNext();  // RVA: 0x801F10
    Il2CppObject* eak();  // RVA: 0x691970
    void eal();  // RVA: 0x8020A0
    Il2CppObject* eam();  // RVA: 0x691970
};

// Namespace: <global>
class DeadUnitData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    uf* cache; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    float currentResurrectionTime; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    System.Action<System.Single> OnProcessChange; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Coroutine* resurrectionCoroutine; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    int32_t bazd; // 0x0030

    // Methods
    int32_t ean();  // RVA: 0x7F5E50
    void .ctor(uf* cache, int32_t dieOrder);  // RVA: 0x7F5D00
    void eao();  // RVA: 0x7F5E60
    void eap();  // RVA: 0x7F5F30
    IEnumerator* eaq();  // RVA: 0x7F5FB0
};

// Namespace: <global>
class ObstacleScriptableObject : public ScriptableObject
{
public:
    uint8_t pad_0000[0x18]; // 0x0000
    System.Collections.Generic.List<System.Single> ObstacleMoveSpeeds; // 0x0018

    // Methods
    void .ctor();  // RVA: 0x6C10E0
};

// Namespace: <global>
class SkillSO : public ScriptableObject
{
public:
    uint8_t pad_0000[0x18]; // 0x0000
    SKILLTYPE skillTYPE; // 0x0018
    uint8_t pad_0019[0x3]; // 0x0019
    float preTime; // 0x001C
    uint8_t pad_001D[0x3]; // 0x001D
    float actionTime; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    float postTime; // 0x0024
    uint8_t pad_0025[0x3]; // 0x0025
    bool KeepActivateOnRecast; // 0x0028
    bool CanMultiCastSkill; // 0x0029
    uint8_t pad_002A[0x6]; // 0x002A
    PrefabAndOffSetEffect* SkillEf_StartEf_Me; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    PrefabAndOffSetEffect* SkillEf_Direct_Other; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    PrefabAndOffSetEffect* AreaOfEffect_Other_Hitted; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    PrefabAndOffSetProjecTile* SkillProjecTile; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    AreaOfEffectData AreaOfEffectObject; // 0x0050
    uint8_t pad_0051[0x17]; // 0x0051
    bco* WillSpawnTurret; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    bl* WillSpawnTrap; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    float WillSpawnTrapFixedY; // 0x0078
    uint8_t pad_0079[0x3]; // 0x0079
    float WillSpawnTrapSpeed; // 0x007C
    uint8_t pad_007D[0x3]; // 0x007D
    float WillSpawnTrapRandPosOffsetDividedRange; // 0x0080
    uint8_t pad_0081[0x3]; // 0x0081
    float WillSpawnTrapRandPosOffsetIncrementDividedRange; // 0x0084
    uint8_t pad_0085[0x3]; // 0x0085
    float WillSpawnTrapRandPosMaxOffsetDividedRange; // 0x0088
    uint8_t pad_0089[0x3]; // 0x0089
    float WillFinalOffsetXDividedRange_Move; // 0x008C
    uint8_t pad_008D[0x3]; // 0x008D
    float WillFinalOffsetXDividedRange_NotMove; // 0x0090
    uint8_t pad_0091[0x7]; // 0x0091
    SpawnSomethingData SpawnSomethingData; // 0x0098
    uint8_t pad_0099[0x17]; // 0x0099
    MonsterRandomSpawnData RandomMonsterSpawnData; // 0x00B0
    uint8_t pad_00B1[0x17]; // 0x00B1
    Sprite* SkillSprite; // 0x00C8
    uint8_t pad_00C9[0x7]; // 0x00C9
    AnimationClip* SkillClip1; // 0x00D0
    uint8_t pad_00D1[0x7]; // 0x00D1
    AnimationClip* SkillClip2; // 0x00D8
    uint8_t pad_00D9[0x7]; // 0x00D9
    AnimationClip* SkillClip3; // 0x00E0

    // Methods
    bool ear();  // RVA: 0x7FA470
    bool eas();  // RVA: 0x7FA480
    bool eat();  // RVA: 0x7FA490
    bool eau();  // RVA: 0x7FA4A0
    bool eav();  // RVA: 0x7FA4B0
    bool eaw();  // RVA: 0x7FA4C0
    bool eax();  // RVA: 0x7FA4D0
    void .ctor();  // RVA: 0x7FA460
};

// Namespace: <global>
struct SpawnSomethingData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    GameObject* SpawnPrefab; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector3 Offset; // 0x0018
};

// Namespace: <global>
struct MonsterRandomSpawnData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    System.Collections.Generic.List<System.Int32> RandomSpawnMonsterKey; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    int32_t SpawnCount; // 0x0018
    uint8_t pad_0019[0x3]; // 0x0019
    float RandomSpawnPosOffsetMin; // 0x001C
    uint8_t pad_001D[0x3]; // 0x001D
    float RandomSpawnPosOffsetMax; // 0x0020
};

// Namespace: <global>
struct AreaOfEffectData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    GameObject* Prefab; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector3 OffSet; // 0x0018
};

// Namespace: <global>
class PrefabAndOffSetEffect
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    GameObject* Go_Prefab; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector3 OffSet; // 0x0018

    // Methods
    void .ctor();  // RVA: 0x7F8670
};

// Namespace: <global>
class PrefabAndOffSetProjecTile
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    bdb* Go_Prefab; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector3 OffSet; // 0x0018

    // Methods
    void .ctor();  // RVA: 0x7F8670
};

// Namespace: <global>
class TrapExplosionData : public ScriptableObject
{
public:
    uint8_t pad_0000[0x18]; // 0x0000
    EDamageAttribute ReactDamageType; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bbs* AreaOfEffect; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Il2CppString* ExplosionTriggerName; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float DividedExplosionDelayTime; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    int32_t DamageIncreaseValue; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    StatusEffectType StatusEffectType; // 0x0038
    uint8_t pad_0039[0x3]; // 0x0039
    float StatusEffectChance; // 0x003C

    // Methods
    void .ctor();  // RVA: 0x6C10E0
};

// Namespace: <global>
struct <ActivatingExplosion>d__31
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bk* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TrapExplosionData* data; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Awaiter <>u__1; // 0x0030

    // Methods
    void MoveNext();  // RVA: 0x7FCD50
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7FD220
};

// Namespace: <global>
class bk : public bl
{
public:
    uint8_t pad_0000[0x48]; // 0x0000
    TrapExplosionData[][] ExplosionData; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Unit* baze; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    System.Collections.Generic.Dictionary<TaskbarHero.Data.EDamageAttribute,TrapExplosionData> bazf; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    float bazg; // 0x0060
    uint8_t pad_0061[0x3]; // 0x0061
    EDamageAttribute bazh; // 0x0064
    uint8_t pad_0065[0x3]; // 0x0065
    EDamageType bazi; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    TrapExplosionData* bazj; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    bool bazk; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    CancellationTokenSource* bazl; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    Action* bazm; // 0x0088
    uint8_t pad_0089[0x7]; // 0x0089
    int32_t bazn; // 0x0090
    uint8_t pad_0091[0x3]; // 0x0091
    int32_t bazo; // 0x0094
    uint8_t pad_0095[0x3]; // 0x0095
    int32_t bazp; // 0x0098

    // Methods
    void ebk();  // RVA: 0x802710
    bool eaz();  // RVA: 0x674DC0
    void ebg(float a);  // RVA: 0x802160
    Transform* ebc();  // RVA: 0x802220
    DamageableType eba();  // RVA: 0x802200
    void oio(float a, Unit* b, EDamageType c, Action* d);  // RVA: 0x802230
    void ouc(int32_t a, int32_t b, int32_t c);  // RVA: 0x802280
    void fdh(float a, Unit* b, EDamageType c, Action* d);  // RVA: 0x802230
    DamageInfo fnb();  // RVA: 0x802AE0
    Vector3 eay();  // RVA: 0x8021B0
    DamageInfo kdg();  // RVA: 0x802CA0
    void ebh(Vector3 a, Vector3 b, float c, float d);  // RVA: 0x802350
    int32_t ebq();  // RVA: 0x802AD0
    UniTaskVoid ebl(TrapExplosionData* a);  // RVA: 0x802770
    void eb(float a);  // RVA: 0x802160
    void lok(float a);  // RVA: 0x802160
    void nlr(float a, Unit* b, EDamageType c, Action* d);  // RVA: 0x802230
    Vector3 ebp();  // RVA: 0x630C20
    void .ctor();  // RVA: 0x8020E0
    float ebn();  // RVA: 0x8029E0
    void ebd(float a, Unit* b, EDamageType c, Action* d);  // RVA: 0x802230
    void ebf(EDamageAttribute a);  // RVA: 0x8022A0
    void gkw(float a, Unit* b, EDamageType c, Action* d);  // RVA: 0x802230
    Unit* ebb();  // RVA: 0x802210
    DamageInfo ebm();  // RVA: 0x802820
    void cgd(float a);  // RVA: 0x802160
    void ebi(DamageInfo a, bool b);  // RVA: 0x8024D0
    DamageInfo lza();  // RVA: 0x803020
    DamageInfo lni();  // RVA: 0x802E60
    void ebe(int32_t a, int32_t b, int32_t c);  // RVA: 0x802280
    void ebj();  // RVA: 0x802680
    void mrx(EDamageAttribute a);  // RVA: 0x8031E0
    Bounds ebo();  // RVA: 0x802A10
};

// Namespace: <global>
struct <UpdateTrapLifeTime>d__11
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bl* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x7FE1A0
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7FD220
};

// Namespace: <global>
class bl : public bch
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Animator* TrapAnimator; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    bdg* TrapMover; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float LifeTime; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float TrapMoveSpeed; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    float TrapMoveHeight; // 0x0038
    uint8_t pad_0039[0x3]; // 0x0039
    bool bazq; // 0x003C
    uint8_t pad_003D[0x3]; // 0x003D
    CancellationTokenSource* bazr; // 0x0040

    // Methods
    void bwn();  // RVA: 0x8032C0
    void OnDisable();  // RVA: 0x803290
    void ebr();  // RVA: 0x8036F0
    void ebj();  // RVA: 0x8036A0
    UniTaskVoid ebs();  // RVA: 0x803770
    void ebh(Vector3 a, Vector3 b, float c, float d);  // RVA: 0x803340
    void .ctor();  // RVA: 0x8032B0
    void ebt();  // RVA: 0x803800
    void ebu();  // RVA: 0x803880
    void oik();  // RVA: 0x8038C0
};

// Namespace: <global>
struct <UpdateAsync>d__15
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    LineController* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x7FDB40
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7FD220
};

// Namespace: <global>
class LineController : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    bool OnlyOneLoop; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    LineRenderer* LineRenderer; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Texture[][] lineTextures; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    float Fps; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    SpriteRenderer* m_headCap; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    SpriteRenderer* m_tailCap; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    float bazs; // 0x0050
    uint8_t pad_0051[0x3]; // 0x0051
    int32_t bazt; // 0x0054
    uint8_t pad_0055[0x3]; // 0x0055
    bool bazu; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    Transform* bazv; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    Transform* bazw; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    Vector3 bazx; // 0x0070
    uint8_t pad_0071[0xB]; // 0x0071
    Vector3 bazy; // 0x007C

    // Methods
    void ebv();  // RVA: 0x7F7C80
    void ebw(Transform* a, Transform* b, Vector3 c, Vector3 d);  // RVA: 0x7F7CE0
    UniTaskVoid ebx();  // RVA: 0x7F7F90
    void eby(Vector3 a, Vector3 b);  // RVA: 0x7F8010
    void .ctor();  // RVA: 0x629810
};

// Namespace: <global>
class bm : public bz
{
public:
    uint8_t pad_0000[0x38]; // 0x0000
    float FloorHalfSize; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    System.Collections.Generic.List<UnityEngine.GameObject> Presets; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    FollowCamera* FollowCamera; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    float ObstacleMoveSpeed; // 0x0050
    uint8_t pad_0051[0x3]; // 0x0051
    float TimeCorrectionValue; // 0x0054
    uint8_t pad_0055[0x3]; // 0x0055
    float bazz; // 0x0058
    uint8_t pad_0059[0x3]; // 0x0059
    int32_t bbaa; // 0x005C
    uint8_t pad_005D[0x3]; // 0x005D
    System.Collections.Generic.List<bo> ChildLayers; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    int32_t bbab; // 0x0068
    uint8_t pad_0069[0x3]; // 0x0069
    float bbac; // 0x006C
    uint8_t pad_006D[0x3]; // 0x006D
    Transform* bbad; // 0x0070

    // Methods
    void kkc();  // RVA: 0x8054F0
    void ecc(Transform* a);  // RVA: 0x804A00
    void Update();  // RVA: 0x803B90
    void End();  // RVA: 0x803940
    void ezo();  // RVA: 0x804E70
    void deb(Vector3 a, float b, int32_t c);  // RVA: 0x803F30
    void zu();  // RVA: 0x803B60
    void ejm();  // RVA: 0x804C80
    void mgv(Vector3 a, float b, int32_t c);  // RVA: 0x805900
    void fyf(Vector3 a, float b, int32_t c);  // RVA: 0x805000
    void .ctor();  // RVA: 0x803EB0
    void icm();  // RVA: 0x803B30
    void eca();  // RVA: 0x8045F0
    void mwn();  // RVA: 0x805C60
    void lyr(Transform* a);  // RVA: 0x805680
    void gvq();  // RVA: 0x805360
    void io();  // RVA: 0x803B30
    void ebz(Vector3 a, float b, int32_t c);  // RVA: 0x804290
    void bze();  // RVA: 0x803B30
    void Show();  // RVA: 0x803B60
    void du();  // RVA: 0x803B30
    void orh();  // RVA: 0x805DF0
    void ecb(Transform* a);  // RVA: 0x804780
    void Hide();  // RVA: 0x803B30
};

// Namespace: <global>
class bn : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Camera* bbae; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    UI_Stage* bbaf; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    bool OnHover; // 0x0030

    // Methods
    void bwd();  // RVA: 0x806070
    void ksc();  // RVA: 0x8060A0
    void Update();  // RVA: 0x806070
    void Start();  // RVA: 0x805FE0
    void .ctor();  // RVA: 0x629810
    void irn();  // RVA: 0x806070
    void fhe();  // RVA: 0x806070
};

// Namespace: <global>
class bo : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    System.Collections.Generic.List<SpriteAnimation_SpriteRenderer> SpriteAnimationList; // 0x0020

    // Methods
    void ghd();  // RVA: 0x806490
    void .ctor();  // RVA: 0x629810
    void onj();  // RVA: 0x8066B0
    void ece();  // RVA: 0x806270
    void hxh();  // RVA: 0x8065A0
    void qj();  // RVA: 0x8067F0
    void ecd();  // RVA: 0x806130
    void gaa();  // RVA: 0x806380
};

// Namespace: <global>
class bp : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    System.Collections.Generic.List<UnityEngine.GameObject> BackGroundPresets; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    FollowCamera* FollowCamera; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float ObstacleMoveSpeed; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    System.Collections.Generic.List<SpriteAnimation_SpriteRenderer> SpriteAnimationList; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Vector3 bbag; // 0x0040

    // Methods
    void ep();  // RVA: 0x806900
    void kzg();  // RVA: 0x8072C0
    void gqo();  // RVA: 0x807090
    void .ctor();  // RVA: 0x629810
    void Awake();  // RVA: 0x806900
    void ecf(Vector3 a);  // RVA: 0x806CC0
    void Update();  // RVA: 0x806A90
    void esc();  // RVA: 0x806900
    void lqo();  // RVA: 0x8074F0
    void End();  // RVA: 0x806940
    void jh();  // RVA: 0x806900
};

// Namespace: <global>
class bq
{
public:
    // Static fields
    // static Il2CppString* bbah;
    // static Il2CppString* bbai;
    // static Il2CppString* bbaj;
    // static Il2CppString* bbak;
    // static Il2CppString* bbal;
    // static Il2CppString* bbam;
    // static Il2CppString* bban;


    // Methods
    static void .cctor();  // RVA: 0x807720
};

// Namespace: <global>
class FollowCamera : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    StageManager* _stageController; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Unit[][] _targets; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Vector3 _battleModeOffset; // 0x0030
    uint8_t pad_0031[0xF]; // 0x0031
    RectTransform* m_stageUIRect; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    BoxCollider2D* m_collider2D; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Vector3 windowFrameOffset; // 0x0050
    uint8_t pad_0051[0xB]; // 0x0051
    Vector3 bbao; // 0x005C
    uint8_t pad_005D[0xB]; // 0x005D
    float bbap; // 0x0068
    uint8_t pad_0069[0x3]; // 0x0069
    float bbaq; // 0x006C
    uint8_t pad_006D[0x3]; // 0x006D
    float m_monsterTargetOffsetValue; // 0x0070
    uint8_t pad_0071[0x3]; // 0x0071
    float m_monsterFollowCameraCenterOffset; // 0x0074
    uint8_t pad_0075[0x3]; // 0x0075
    Vector3 m_windowFrameMonsterBattleFollowOffset; // 0x0078
    uint8_t pad_0079[0xB]; // 0x0079
    Vector3 m_windowFrameCorrectionOffset; // 0x0084
    uint8_t pad_0085[0xB]; // 0x0085
    float m_heroSpreadMaxDistance; // 0x0090
    uint8_t pad_0091[0x3]; // 0x0091
    float m_heroSpreadTargetOffsetX; // 0x0094
    uint8_t pad_0095[0x3]; // 0x0095
    float m_maxFollowDistance; // 0x0098
    uint8_t pad_0099[0x3]; // 0x0099
    float m_catchUpSpeedMultiplier; // 0x009C
    uint8_t pad_009D[0x3]; // 0x009D
    float bbar; // 0x00A0
    uint8_t pad_00A1[0x7]; // 0x00A1
    TMP_InputField* m_debugCorrectionOffsetXInput; // 0x00A8
    uint8_t pad_00A9[0x7]; // 0x00A9
    TMP_InputField* m_debugCorrectionOffsetYInput; // 0x00B0
    uint8_t pad_00B1[0x7]; // 0x00B1
    TMP_InputField* m_debugCorrectionOffsetZInput; // 0x00B8

    // Methods
    Transform* ecg();  // RVA: 0x7F6450
    Vector3 ech();  // RVA: 0x7F6480
    float eci();  // RVA: 0x7F64C0
    void Start();  // RVA: 0x7F6390
    void ecj();  // RVA: 0x7F64D0
    void eck(Il2CppString* a);  // RVA: 0x7F67D0
    void ecl(Il2CppString* a);  // RVA: 0x7F6810
    void ecm(Il2CppString* a);  // RVA: 0x7F6850
    void Update();  // RVA: 0x7F63A0
    void ecn();  // RVA: 0x7F6890
    void eco(float a);  // RVA: 0x7F6B60
    void ecp(Unit[][] a);  // RVA: 0x7F6B70
    Vector3 ecq();  // RVA: 0x7F6E30
    Vector3 ecr();  // RVA: 0x7F6F40
    Vector3 ecs();  // RVA: 0x7F7050
    void ect(Vector3 a);  // RVA: 0x7F7550
    void .ctor();  // RVA: 0x7F63B0
};

// Namespace: <global>
class TestFollowScript : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Transform* m_stageUIRect; // 0x0020

    // Methods
    void Update();  // RVA: 0x80ED50
    void .ctor();  // RVA: 0x629810
};

// Namespace: <global>
class br
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Il2CppString* bbas; // 0x0010

    // Methods
    bool lbh(Il2CppString* a);  // RVA: 0x810070
    void .ctor();  // RVA: 0x629380
    bool fqu(Il2CppString* a);  // RVA: 0x810070
    bool fla(Il2CppString* a);  // RVA: 0x810070
    bool glr(Il2CppString* a);  // RVA: 0x810070
    bool ecu(Il2CppString* a);  // RVA: 0x810070
};

// Namespace: <global>
class CsvManager : public MonoBehaviour
{
public:
    // Static fields
    // static CsvManager* bbat;

    uint8_t pad_0000[0x20]; // 0x0000
    Il2CppString* m_csvFolderPath; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    System.Collections.Generic.List<UnityEngine.TextAsset> m_csvTextAssets; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    System.Collections.Generic.Dictionary<System.String,UnityEngine.TextAsset> bbau; // 0x0030

    // Methods
    static CsvManager* ecv();  // RVA: 0x80AC40
    void Awake();  // RVA: 0x80AAE0
    void ecw();  // RVA: 0x80AC80
    System.Collections.Generic.List<a> ecx(Il2CppString* a);  // RVA: 0x41BD90
    TextAsset* ecy(Il2CppString* a);  // RVA: 0x80AE10
    String[][] ecz(Il2CppString* a);  // RVA: 0x80AE70
    void .ctor();  // RVA: 0x80AB40
};

// Namespace: <global>
class AnimationEf : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    SpriteRenderer* spr; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    SpriteAnimation_SpriteRenderer* sprite_Animation; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    System.Collections.Generic.List<SpriteAnimation_SpriteRenderer> additionalAnimations; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Action* bbav; // 0x0038
