// ============================================================
// Image: ACTk.Runtime.dll
// ============================================================

namespace Microsoft.CodeAnalysis
{

    // Namespace: Microsoft.CodeAnalysis
    class EmbeddedAttribute : public Attribute
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x66FAE0
    };

} // namespace Microsoft.CodeAnalysis

namespace System.Runtime.CompilerServices
{

    // Namespace: System.Runtime.CompilerServices
    class IsUnmanagedAttribute : public Attribute
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x66FAE0
    };

} // namespace System.Runtime.CompilerServices

// Namespace: <global>
struct MonoScriptData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Byte[][] FilePathsData; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Byte[][] TypesData; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    int32_t TotalTypes; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    int32_t TotalFiles; // 0x0024
    uint8_t pad_0025[0x3]; // 0x0025
    bool IsEditorOnly; // 0x0028
};

// Namespace: <global>
class dam
{
public:

    // Methods
    static MonoScriptData vyh();  // RVA: 0x670790
    void .ctor();  // RVA: 0x629380
};

// Namespace: <global>
class dan
{
public:

    // Methods
    static void vyj();  // RVA: 0x63E350
    static void cfd();  // RVA: 0x63E350
    static void dkg();  // RVA: 0x63E350
    static void vyi();  // RVA: 0x63E350
    static void gie();  // RVA: 0x63E350
    static void hao();  // RVA: 0x63E350
};

// Namespace: <global>
class ApplicationFocusEventHandler : public MulticastDelegate
{
public:

    // Methods
    void .ctor(Il2CppObject* object, intptr_t method);  // RVA: 0x66F9D0
    void Invoke(bool hasFocus);  // RVA: 0x66F9C0
    IAsyncResult* BeginInvoke(bool hasFocus, AsyncCallback* callback, Il2CppObject* object);  // RVA: 0x66F950
    void EndInvoke(IAsyncResult* result);  // RVA: 0x66F9B0
};

// Namespace: <global>
class ApplicationPauseEventHandler : public MulticastDelegate
{
public:

    // Methods
    void .ctor(Il2CppObject* object, intptr_t method);  // RVA: 0x66F9D0
    void Invoke(bool pauseStatus);  // RVA: 0x66F9C0
    IAsyncResult* BeginInvoke(bool pauseStatus, AsyncCallback* callback, Il2CppObject* object);  // RVA: 0x66F950
    void EndInvoke(IAsyncResult* result);  // RVA: 0x66F9B0
};

// Namespace: <global>
class dao : public MonoBehaviour
{
public:
    // Static fields
    // static dao* bmmk;

    uint8_t pad_0000[0x20]; // 0x0000
    ApplicationFocusEventHandler* bmmi; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    ApplicationPauseEventHandler* bmmj; // 0x0028

    // Methods
    void vyn(ApplicationPauseEventHandler* a);  // RVA: 0x670D10
    void Awake();  // RVA: 0x670870
    void vym(ApplicationPauseEventHandler* a);  // RVA: 0x670C70
    void vyl(ApplicationFocusEventHandler* a);  // RVA: 0x670BD0
    void dxq();  // RVA: 0x6709F0
    void hmg(bool pauseStatus);  // RVA: 0x670930
    void OnApplicationPause(bool pauseStatus);  // RVA: 0x670930
    void itp();  // RVA: 0x670A90
    void doo();  // RVA: 0x670950
    void gxp(bool pauseStatus);  // RVA: 0x670930
    void .ctor();  // RVA: 0x629810
    void vyk(ApplicationFocusEventHandler* a);  // RVA: 0x670B30
    static dao* vyo();  // RVA: 0x670DB0
    void dqa(bool pauseStatus);  // RVA: 0x670930
    void OnApplicationFocus(bool hasFocus);  // RVA: 0x670910
    void opk(bool pauseStatus);  // RVA: 0x670930
};

// Namespace: <global>
class dap
{
public:

    // Methods
    static Il2CppString* vys(Char[][] a);  // RVA: 0x671850
    static Char[][] jir(Il2CppString* a);  // RVA: 0x6714B0
    static Char[][] vyq(Il2CppString* a);  // RVA: 0x671690
    static Il2CppString* dkp(Il2CppString* a);  // RVA: 0x670F80
    static Il2CppString* gnj(Il2CppString* a);  // RVA: 0x6712F0
    static Il2CppString* fdx(Il2CppString* a);  // RVA: 0x671130
    static Il2CppString* vyr(Il2CppString* a);  // RVA: 0x671730
    static Il2CppString* vyp(Il2CppString* a);  // RVA: 0x6715F0
    static Char[][] git(Il2CppString* a);  // RVA: 0x671250
    static Il2CppString* jao(Il2CppString* a);  // RVA: 0x671390
    static Il2CppString* jnm(Il2CppString* a);  // RVA: 0x671550
    static Char[][] dib(Il2CppString* a);  // RVA: 0x670EE0
    static Il2CppString* eoc(Char[][] a);  // RVA: 0x671020
};

// Namespace: <global>
class daq
{
public:
    // Static fields
    // static int32_t bmml;
    // static uint8_t bmmm;
    // static uint8_t bmmn;
    // static uint8_t bmmo;
    // static uint8_t bmmp;
    // static uint8_t bmmq;


    // Methods
    static void hey(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x6719D0
    static void vyy(Stream* a, Stream* b, Byte[][] c, uint8_t d, uint8_t e);  // RVA: 0x41A4E0
    static void vyt(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x671C00
    static void vyw(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x671D50
    static void ljg(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x671B20
    static void ohy(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x671B90
    static void vyv(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x671CE0
    static void dzx(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x671960
    static void vyu(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x671C70
    static void jmi(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x671AB0
    static void vyx(Stream* a, Stream* b, Byte[][] c, uint8_t d);  // RVA: 0x5640F0
    static void hqz(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x671A40
};

// Namespace: <global>
class dar
{
public:
    // Static fields
    // static int32_t bmmr;


    // Methods
    static bool nfg(bool a, int32_t b);  // RVA: 0x672610
    static bool vza(bool a, int32_t b);  // RVA: 0x672610
    static bool nmj(DateTimeOffset a, int32_t b);  // RVA: 0x672910
    static bool vzc(int32_t a, int32_t b);  // RVA: 0x672220
    static bool nng(int64_t a, int32_t b);  // RVA: 0x672270
    static bool vze(uint32_t a, int32_t b);  // RVA: 0x672220
    static bool bql(Guid a, int32_t b);  // RVA: 0x671F70
    static int32_t vzz(uint32_t a);  // RVA: 0x672630
    static int32_t lkf(float a);  // RVA: 0x673200
    static bool igg(Guid a, int32_t b);  // RVA: 0x671F70
    static int32_t waj(Il2CppString* a);  // RVA: 0x674CF0
    static bool moj(Vector3Int a, int32_t b);  // RVA: 0x673A50
    static int32_t vzr(BigInteger a);  // RVA: 0x674140
    static int32_t tk(Vector2 a);  // RVA: 0x672120
    static bool ewv(bool a, int32_t b);  // RVA: 0x672610
    static bool vzo(DateTimeOffset a, int32_t b);  // RVA: 0x672910
    static bool vzl(float a, int32_t b);  // RVA: 0x6725B0
    static bool osf(Decimal a, int32_t b);  // RVA: 0x6720F0
    static int32_t gdm(DateTime a);  // RVA: 0x672680
    static bool ger(Vector2 a, int32_t b);  // RVA: 0x672770
    static bool vzp(Guid a, int32_t b);  // RVA: 0x671F70
    static bool bia(double a, int32_t b);  // RVA: 0x671DC0
    static int32_t hvc(bool a);  // RVA: 0x672AE0
    static bool kij(Vector2 a, int32_t b);  // RVA: 0x672770
    static int32_t jqg(int32_t a);  // RVA: 0x672CF0
    static int32_t vzx(Guid a);  // RVA: 0x6747E0
    static bool otd(bool a, int32_t b);  // RVA: 0x672610
    static int32_t isp(Char[][] a);  // RVA: 0x672BC0
    static int32_t kxy(Quaternion a);  // RVA: 0x6729A0
    static int32_t fab(uint32_t a);  // RVA: 0x672630
    static bool vzk(Vector3Int a, int32_t b);  // RVA: 0x673A50
    static bool col(Decimal a, int32_t b);  // RVA: 0x6720F0
    static bool vzf(uint64_t a, int32_t b);  // RVA: 0x672B10
    static int32_t lgi(Quaternion a);  // RVA: 0x6729A0
    static int32_t wac(double a);  // RVA: 0x674B80
    static bool vzb(Decimal a, int32_t b);  // RVA: 0x6720F0
    static int32_t vzu(int32_t a);  // RVA: 0x672630
    static bool vzn(Char[][] a, int32_t b);  // RVA: 0x6740E0
    static bool lmi(BigInteger a, int32_t b);  // RVA: 0x6721C0
    static int32_t waa(uint64_t a);  // RVA: 0x674AE0
    static bool mns(Vector2 a, int32_t b);  // RVA: 0x672770
    static bool vzg(Quaternion a, int32_t b);  // RVA: 0x6721F0
    static bool lqr(Guid a, int32_t b);  // RVA: 0x671F70
    static int32_t npq(int64_t a);  // RVA: 0x673C10
    static bool ekv(float a, int32_t b);  // RVA: 0x6725B0
    static int32_t vzw(DateTimeOffset a);  // RVA: 0x674700
    static int32_t jzo(BigInteger a);  // RVA: 0x672D80
    static int32_t gyw(uint64_t a);  // RVA: 0x672940
    static int32_t mqr(Vector2Int a);  // RVA: 0x673A80
    static int32_t wai(Char[][] a);  // RVA: 0x674CA0
    static bool ckb(Vector3 a, int32_t b);  // RVA: 0x671FE0
    static int32_t lkn(BigInteger a);  // RVA: 0x673250
    static int32_t hwg(double a);  // RVA: 0x672AF0
    static bool oqg(uint64_t a, int32_t b);  // RVA: 0x672B10
    static bool dgk(Quaternion a, int32_t b);  // RVA: 0x6721F0
    static int32_t vzv(DateTime a);  // RVA: 0x674610
    static bool vzj(Vector3 a, int32_t b);  // RVA: 0x671FE0
    static bool npm(Vector2 a, int32_t b);  // RVA: 0x672770
    static bool vzm(double a, int32_t b);  // RVA: 0x671DC0
    static int32_t nbw(float a);  // RVA: 0x673200
    static bool nld(Vector2Int a, int32_t b);  // RVA: 0x672820
    static int32_t yh(uint64_t a);  // RVA: 0x674D70
    static bool vzi(Vector2Int a, int32_t b);  // RVA: 0x672820
    static bool gvz(Decimal a, int32_t b);  // RVA: 0x6720F0
    static bool ieq(double a, int32_t b);  // RVA: 0x671DC0
    static bool kta(Vector3 a, int32_t b);  // RVA: 0x671FE0
    static int32_t nxb(float a);  // RVA: 0x673200
    static bool iwm(DateTimeOffset a, int32_t b);  // RVA: 0x672910
    static bool vzh(Vector2 a, int32_t b);  // RVA: 0x672770
    static bool ntr(float a, int32_t b);  // RVA: 0x6725B0
    static int32_t wah(Vector3Int a);  // RVA: 0x674BA0
    static int32_t vzs(bool a);  // RVA: 0x674430
    static int32_t olg(Vector2Int a);  // RVA: 0x673A80
    static int32_t dwx(Vector2 a);  // RVA: 0x672120
    static int32_t vzq(a a);  // RVA: 0x5640F0
    static bool ian(uint64_t a, int32_t b);  // RVA: 0x672B10
    static int32_t up(DateTime a);  // RVA: 0x673FF0
    static bool hkf(float a, int32_t b);  // RVA: 0x6725B0
    static int32_t lud(Decimal a);  // RVA: 0x673540
    static int32_t nsa(BigInteger a);  // RVA: 0x673CB0
    static bool glr(Vector2Int a, int32_t b);  // RVA: 0x672820
    static bool djy(uint32_t a, int32_t b);  // RVA: 0x672220
    static int32_t lxa(BigInteger a);  // RVA: 0x673670
    static bool imu(Vector2Int a, int32_t b);  // RVA: 0x672820
    static int32_t vzt(Decimal a);  // RVA: 0x674440
    static int32_t waf(Vector2Int a);  // RVA: 0x673A80
    static bool gv(DateTimeOffset a, int32_t b);  // RVA: 0x672910
    static int32_t jfi(DateTimeOffset a);  // RVA: 0x672C10
    static int32_t chr(int32_t a);  // RVA: 0x671FA0
    static int32_t kgc(int32_t a);  // RVA: 0x673070
    static int32_t wag(Vector3 a);  // RVA: 0x673B20
    static bool nss(Vector3 a, int32_t b);  // RVA: 0x671FE0
    static int32_t wad(Quaternion a);  // RVA: 0x6729A0
    static int32_t wab(float a);  // RVA: 0x673200
    static bool nua(int32_t a, int32_t b);  // RVA: 0x672220
    static int32_t kgu(double a);  // RVA: 0x6730B0
    static int32_t jvz(Char[][] a);  // RVA: 0x672D30
    static int32_t goz(int32_t a);  // RVA: 0x6728D0
    static bool vyz(BigInteger a, int32_t b);  // RVA: 0x6721C0
    static int32_t dre(double a);  // RVA: 0x672590
    static bool mds(bool a, int32_t b);  // RVA: 0x672610
    static int32_t wae(Vector2 a);  // RVA: 0x672120
    static bool min(Vector3 a, int32_t b);  // RVA: 0x671FE0
    static int32_t oak(Char[][] a);  // RVA: 0x673FA0
    static int32_t dmr(Vector3Int a);  // RVA: 0x6724A0
    static int32_t hgr(Quaternion a);  // RVA: 0x6729A0
    static int32_t dmm(Decimal a);  // RVA: 0x672320
    static bool ta(Decimal a, int32_t b);  // RVA: 0x6720F0
    static int32_t bnp(Decimal a);  // RVA: 0x671DF0
    static bool jdl(DateTimeOffset a, int32_t b);  // RVA: 0x672910
    static int32_t crv(Vector2 a);  // RVA: 0x672120
    static bool vzd(int64_t a, int32_t b);  // RVA: 0x672270
    static bool dlb(int64_t a, int32_t b);  // RVA: 0x672270
    static int32_t vzy(int64_t a);  // RVA: 0x674A40
    static int32_t khb(DateTimeOffset a);  // RVA: 0x6730D0
    static int32_t myp(Vector3 a);  // RVA: 0x673B20
    static int32_t mih(Vector3Int a);  // RVA: 0x673960
    static int32_t hoc(Vector2 a);  // RVA: 0x672120
    static bool jsq(int32_t a, int32_t b);  // RVA: 0x672220
    static bool dfd(BigInteger a, int32_t b);  // RVA: 0x6721C0
    static int32_t ljd(Char[][] a);  // RVA: 0x6731B0
};

// Namespace: <global>
class das : public CertificateHandler
{
public:

    // Methods
    bool ValidateCertificate(Byte[][] certificateData);  // RVA: 0x674DC0
    void .ctor();  // RVA: 0x674DD0
};

// Namespace: <global>
class dat
{
public:

    // Methods
    static bool wal(double a, double b, double c);  // RVA: 0x674FC0
    static bool nyu(double a, double b, double c);  // RVA: 0x674DE0
    static bool wak(float a, float b, float c);  // RVA: 0x674F10
};

// Namespace: <global>
class dau
{
public:

    // Methods
    static void wam(System.IProgress<CodeStage.AntiCheat.Genuine.CodeHash.FilesProgress> a, int32_t b, int32_t c, int64_t d, Il2CppString* e);  // RVA: 0x6750F0
};

// Namespace: <global>
class dav
{
public:

    // Methods
    static uint16_t mie();  // RVA: 0x675800
    static int16_t war();  // RVA: 0x675AC0
    static int8_t wap();  // RVA: 0x675A20
    static int32_t bax();  // RVA: 0x675220
    static int32_t las();  // RVA: 0x675760
    static uint16_t was();  // RVA: 0x675B10
    static uint32_t jrx();  // RVA: 0x675710
    static int16_t ibd();  // RVA: 0x675630
    static uint8_t wao();  // RVA: 0x6759D0
    static int64_t fxl();  // RVA: 0x675530
    static int8_t efa();  // RVA: 0x675310
    static uint8_t epf();  // RVA: 0x675400
    static void wax(Char[][] a);  // RVA: 0x675B60
    static void ilo(Char[][] a);  // RVA: 0x675680
    static uint8_t lpw();  // RVA: 0x6757B0
    static int8_t egi();  // RVA: 0x675360
    static uint64_t hsk();  // RVA: 0x6755D0
    static uint16_t cdw();  // RVA: 0x675270
    static int8_t hdt();  // RVA: 0x675580
    static uint16_t elr();  // RVA: 0x6753B0
    static uint16_t dgx();  // RVA: 0x6752C0
    static Il2CppString* wan(int32_t a);  // RVA: 0x6758F0
    static int32_t mzj();  // RVA: 0x6758A0
    static uint64_t waw();  // RVA: 0x6755D0
    static wchar_t waq();  // RVA: 0x675A70
    static Il2CppString* fxk(int32_t a);  // RVA: 0x675450
    static int64_t mnc();  // RVA: 0x675850
    static int64_t wav();  // RVA: 0x6755D0
    static int32_t wat();  // RVA: 0x675710
    static uint32_t wau();  // RVA: 0x675710
};

// Namespace: <global>
class daw
{
public:
    // Static fields
    // static Char[][] bmms;


    // Methods
    static Il2CppString* wbd(Byte[][] a);  // RVA: 0x675F70
    static Il2CppString* wbb(Byte[][] a);  // RVA: 0x675D70
    static Char[][] wba(Byte[][] a);  // RVA: 0x675CD0
    static Byte[][] waz(Il2CppString* a);  // RVA: 0x675C80
    static Char[][] bqp(Byte[][] a);  // RVA: 0x675CD0
    static Byte[][] hsp(Char[][] a);  // RVA: 0x675DB0
    static void .cctor();  // RVA: 0x675BF0
    static Il2CppString* hwk(Byte[][] a);  // RVA: 0x675DF0
    static Il2CppString* wbc(Byte[][] a, int32_t b, int32_t c);  // RVA: 0x675D10
    static Byte[][] beo(Il2CppString* a);  // RVA: 0x675C80
    static Byte[][] fnf(Il2CppString* a);  // RVA: 0x675C80
    static Il2CppString* gmb(Byte[][] a);  // RVA: 0x675D70
    static Il2CppString* igr(Byte[][] a);  // RVA: 0x675D70
    static Il2CppString* emz(Byte[][] a, int32_t b, int32_t c);  // RVA: 0x675D10
    static Il2CppString* ltr(Byte[][] a);  // RVA: 0x675D70
    static Il2CppString* mkf(Byte[][] a, int32_t b, int32_t c);  // RVA: 0x675D10
    static Byte[][] way(Char[][] a);  // RVA: 0x675DB0
};

// Namespace: <global>
class dax`1
{
public:
    System.Collections.Concurrent.ConcurrentBag<a> bmmt; // 0x0000
    System.Func<a> bmmu; // 0x0000

    // Methods
    void wbf(a a);  // RVA: 0x5640F0
    void wbg();  // RVA: 0x430790
    a wbe();  // RVA: 0x5640F0
    void .ctor(System.Func<a> a);  // RVA: 0x41A6C0
    void kni();  // RVA: 0x430790
    void fzl();  // RVA: 0x430790
    void hmc();  // RVA: 0x430790
};

// Namespace: <global>
class day
{
public:
    // Static fields
    // static Random* bmmv;
    // static Random* bmmw;


    // Methods
    static void lyd(Char[][] a);  // RVA: 0x677D00
    static int64_t icl(int64_t a, int64_t b);  // RVA: 0x6773F0
    static int32_t gii(int32_t a, int32_t b);  // RVA: 0x676D20
    static void de(Char[][] a);  // RVA: 0x676390
    static void dmr(Random* a, Char[][] b);  // RVA: 0x6766A0
    static int32_t fgf(int32_t a, int32_t b);  // RVA: 0x676A70
    static void efg(Random* a, Char[][] b);  // RVA: 0x6769D0
    static int64_t wbl(Random* a, int64_t b, int64_t c);  // RVA: 0x678D20
    static int32_t wbh(int32_t a, int32_t b);  // RVA: 0x6782F0
    static void kby(Random* a, Char[][] b);  // RVA: 0x677B80
    static int32_t gxd(int32_t a, int32_t b);  // RVA: 0x676F40
    static void htp(Byte[][] a);  // RVA: 0x677160
    static int64_t nto(int64_t a, int64_t b);  // RVA: 0x678080
    static void fze(Random* a, Char[][] b);  // RVA: 0x676C90
    static int64_t kij(Random* a, int64_t b, int64_t c);  // RVA: 0x677C20
    static void wbj(Byte[][] a);  // RVA: 0x678780
    static void kbj(Byte[][] a);  // RVA: 0x6778F0
    static int64_t wbi(int64_t a, int64_t b);  // RVA: 0x678510
    static void wbk(Char[][] a);  // RVA: 0x678A10
    static void wbm(Random* a, Char[][] b);  // RVA: 0x678DA0
    static int64_t mtd(Random* a, int64_t b, int64_t c);  // RVA: 0x678010
    static int32_t bvi(int32_t a, int32_t b);  // RVA: 0x676170
    static int64_t ktc(Random* a, int64_t b, int64_t c);  // RVA: 0x677C90
    static void iub(Byte[][] a);  // RVA: 0x677660
    static void dxp(Byte[][] a);  // RVA: 0x676740
    static void .cctor();  // RVA: 0x6760F0
};

// Namespace: <global>
class daz
{
public:
    // Static fields
    // static int64_t bmmx;


    // Methods
    static int64_t wbn();  // RVA: 0x6791A0
    static double nvl();  // RVA: 0x679130
    static int64_t ill();  // RVA: 0x678FB0
    static int64_t wbq();  // RVA: 0x679290
    static int64_t jeg();  // RVA: 0x678FD0
    static int64_t ehl();  // RVA: 0x678E70
    static int64_t lvk();  // RVA: 0x679050
    static int64_t bsn();  // RVA: 0x678E30
    static double iar();  // RVA: 0x678F40
    static int64_t wbr();  // RVA: 0x6792B0
    static double wbo();  // RVA: 0x679200
    static int64_t nrk();  // RVA: 0x679110
    static int64_t juo();  // RVA: 0x679030
    static double fei();  // RVA: 0x678ED0
    static int64_t csj();  // RVA: 0x678E50
    static double xl();  // RVA: 0x6792D0
    static int64_t wbp();  // RVA: 0x679270
    static int64_t nbv();  // RVA: 0x6790B0
};

// Namespace: <global>
class dba
{
public:
    // Static fields
    // static uint32_t bmmy;
    // static uint32_t bmmz;
    // static uint32_t bmna;
    // static uint32_t bmnb;
    // static uint32_t bmnc;


    // Methods
    static uint32_t esr(Stream* a, int64_t b, uint32_t c);  // RVA: 0x679340
    static uint32_t jpg(Stream* a, int64_t b, uint32_t c);  // RVA: 0x679AF0
    static uint32_t wbt(Stream* a, int64_t b, uint32_t c);  // RVA: 0x67A260
    static uint32_t iil(Byte[][] a, int32_t b, uint32_t c);  // RVA: 0x679940
    static uint32_t wbs(Byte[][] a, int32_t b, uint32_t c);  // RVA: 0x679E30
    static uint32_t gnh(Stream* a, int64_t b, uint32_t c);  // RVA: 0x679660
};

// Namespace: <global>
class dbb : public dcx`1
{
public:
    // Static fields
    // static bool bmnd;
    // static bool bmne;
    // static float bmnf;
    // static float bmng;
    // static float bmnh;
    // static float bmni;
    // static float bmnj;
    // static float bmnk;
    // static bool bmnl;

    uint8_t pad_0000[0x30]; // 0x0000
    int64_t bmnm; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    int64_t bmnn; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    int64_t bmno; // 0x0040

    // Methods
    static void wcd(float a);  // RVA: 0x67C4C0
    bool kag();  // RVA: 0x67B5F0
    static void wbu();  // RVA: 0x67BD90
    static void mhh();  // RVA: 0x67BAF0
    bool grf();  // RVA: 0x67B0E0
    void Update();  // RVA: 0x67A6C0
    static float wbz();  // RVA: 0x67C270
    void wcg();  // RVA: 0x67C7B0
    static float wca();  // RVA: 0x67C330
    static float wby();  // RVA: 0x67C1B0
    void .ctor();  // RVA: 0x67A920
    static float wcc();  // RVA: 0x67C4B0
    void cwj();  // RVA: 0x67AB90
    void wcf();  // RVA: 0x67C6E0
    static float wbw();  // RVA: 0x67C030
    void wci(Scene a, LoadSceneMode b);  // RVA: 0x67C960
    static void kcw();  // RVA: 0x67B800
    static void lpn();  // RVA: 0x67BA80
    void wch();  // RVA: 0x67C8C0
    static void nrp();  // RVA: 0x67BB60
    static void fcm();  // RVA: 0x67ACA0
    static void bqi();  // RVA: 0x67A960
    static float wcb();  // RVA: 0x67C3F0
    void hfg();  // RVA: 0x67B520
    bool lko();  // RVA: 0x67B870
    bool gad();  // RVA: 0x67AED0
    bool wce();  // RVA: 0x67C4D0
    static void wbv();  // RVA: 0x67BE00
    static void gtl();  // RVA: 0x67B2F0
    static float wbx();  // RVA: 0x67C0F0
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct StorageDataType
    {
    public:
        // Static fields
        // static StorageDataType Unknown;
        // static StorageDataType SByte;
        // static StorageDataType Byte;
        // static StorageDataType Int16;
        // static StorageDataType UInt16;
        // static StorageDataType Int32;
        // static StorageDataType UInt32;
        // static StorageDataType Int64;
        // static StorageDataType UInt64;
        // static StorageDataType Char;
        // static StorageDataType Single;
        // static StorageDataType Double;
        // static StorageDataType Decimal;
        // static StorageDataType BigInteger;
        // static StorageDataType Boolean;
        // static StorageDataType String;
        // static StorageDataType DateTime;
        // static StorageDataType ByteArray;
        // static StorageDataType Vector2;
        // static StorageDataType Vector2Int;
        // static StorageDataType Vector3;
        // static StorageDataType Vector3Int;
        // static StorageDataType Vector4;
        // static StorageDataType Quaternion;
        // static StorageDataType Color;
        // static StorageDataType Color32;
        // static StorageDataType Rect;
        // static StorageDataType RectInt;
        // static StorageDataType RangeInt;
        // static StorageDataType Matrix4x4;
        // static StorageDataType Ray;
        // static StorageDataType Ray2D;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredPrefsData
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        StorageDataType type; // 0x0010
        uint8_t pad_0011[0x7]; // 0x0011
        Byte[][] data; // 0x0018
    
        // Methods
        void .ctor(StorageDataType type, Byte[][] data);  // RVA: 0x670670
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbc
{
public:

    // Methods
    static Byte[][] wcq(T a);  // RVA: 0x5640F0
    static Byte[][] wco(StorageDataType a, e b);  // RVA: 0x5640F0
    static f wcp(StorageDataType a, Byte[][] b);  // RVA: 0x5640F0
    static T wcr(Byte[][] a);  // RVA: 0x5640F0
    static c wcm(Byte[][] a);  // RVA: 0x5640F0
    static d wcn(StorageDataType a, Byte[][] b);  // RVA: 0x5640F0
    static Color32 wcj(Byte[][] a);  // RVA: 0x67C9E0
    static b wcl(ObscuredPrefsData a);  // RVA: 0x5640F0
    static ObscuredPrefsData wck(a a);  // RVA: 0x5640F0
};

// Namespace: <global>
class dbd
{
public:
    // Static fields
    // static Type* bmnp;
    // static Type* bmnq;
    // static Type* bmnr;
    // static Type* bmns;
    // static Type* bmnt;
    // static Type* bmnu;
    // static Type* bmnv;
    // static Type* bmnw;
    // static Type* bmnx;
    // static Type* bmny;
    // static Type* bmnz;
    // static Type* bmoa;
    // static Type* bmob;
    // static Type* bmoc;
    // static Type* bmod;
    // static Type* bmoe;
    // static Type* bmof;
    // static Type* bmog;
    // static Type* bmoh;
    // static Type* bmoi;
    // static Type* bmoj;
    // static Type* bmok;
    // static Type* bmol;
    // static Type* bmom;
    // static Type* bmon;
    // static Type* bmoo;
    // static Type* bmop;
    // static Type* bmoq;
    // static Type* bmor;
    // static Type* bmos;
    // static Type* bmot;


    // Methods
    static StorageDataType wcs();  // RVA: 0x423920
    static void .cctor();  // RVA: 0x67CA20
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    class UnsupportedDataTypeException : public Exception
    {
    public:
    
        // Methods
        void .ctor(Type* type);  // RVA: 0x6706F0
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class HashCheckSumModifierDelegate : public MulticastDelegate
{
public:

    // Methods
    void .ctor(Il2CppObject* object, intptr_t method);  // RVA: 0x66FB20
    Byte[][] Invoke(Il2CppString* input);  // RVA: 0x66F9C0
    IAsyncResult* BeginInvoke(Il2CppString* input, AsyncCallback* callback, Il2CppObject* object);  // RVA: 0x66FAF0
    Byte[][] EndInvoke(IAsyncResult* result);  // RVA: 0x66F9B0
};

// Namespace: <global>
class dbe
{
public:
    // Static fields
    // static Il2CppString* bmou;

    uint8_t pad_0000[0x10]; // 0x0000
    uint32_t bmov; // 0x0010
    uint8_t pad_0011[0x3]; // 0x0011
    uint32_t bmow; // 0x0014
    uint8_t pad_0015[0x3]; // 0x0015
    HashCheckSumModifierDelegate* bmox; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bool <bmoy>k__BackingField; // 0x0020

    // Methods
    void izy(HashCheckSumModifierDelegate* a);  // RVA: 0x67D320
    void hof();  // RVA: 0x67D310
    void wdc();  // RVA: 0x67D310
    static Il2CppString* ezg();  // RVA: 0x67D330
    static Il2CppString* wcw();  // RVA: 0x67D330
    uint32_t wdd(Il2CppString* a);  // RVA: 0x67D6E0
    void wcy(bool a);  // RVA: 0x67D580
    void hks();  // RVA: 0x67D310
    static Il2CppString* off();  // RVA: 0x67D330
    void wdb(bool a);  // RVA: 0x67D300
    void hzl(bool a);  // RVA: 0x67D300
    static void wcu(Il2CppString* a);  // RVA: 0x67D420
    void .ctor(uint32_t a);  // RVA: 0x67D2D0
    void wda(HashCheckSumModifierDelegate* a);  // RVA: 0x67D320
    static void wcv();  // RVA: 0x67D480
    bool wcx();  // RVA: 0x6702C0
    static Il2CppString* wct();  // RVA: 0x67D370
    void esh(HashCheckSumModifierDelegate* a);  // RVA: 0x67D320
    void kfa(bool a);  // RVA: 0x67D300
    static Il2CppString* lgx();  // RVA: 0x67D330
    void cqe(bool a);  // RVA: 0x67D300
    uint32_t wcz();  // RVA: 0x67D590
    void kbm(bool a);  // RVA: 0x67D300
    void dmy(HashCheckSumModifierDelegate* a);  // RVA: 0x67D320
    void nvl();  // RVA: 0x67D310
    void cuw();  // RVA: 0x67D310
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct DeviceLockLevel
    {
    public:
        // Static fields
        // static DeviceLockLevel None;
        // static DeviceLockLevel Soft;
        // static DeviceLockLevel Strict;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbf
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    DeviceLockLevel <bmoz>k__BackingField; // 0x0010
    DeviceLockTamperingSensitivity <bmpa>k__BackingField; // 0x0011

    // Methods
    DeviceLockLevel wde();  // RVA: 0x6705A0
    void wdf(DeviceLockLevel a);  // RVA: 0x67D850
    DeviceLockTamperingSensitivity wdg();  // RVA: 0x67D860
    void wdh(DeviceLockTamperingSensitivity a);  // RVA: 0x67D870
    void .ctor(DeviceLockLevel a, DeviceLockTamperingSensitivity b);  // RVA: 0x67D810
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct DeviceLockTamperingSensitivity
    {
    public:
        // Static fields
        // static DeviceLockTamperingSensitivity Disabled;
        // static DeviceLockTamperingSensitivity Low;
        // static DeviceLockTamperingSensitivity Normal;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

    // Namespace: CodeStage.AntiCheat.Storage
    class DeviceUniqueIdentifierException : public BackgroundThreadAccessException
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x66FA80
    };

    // Namespace: CodeStage.AntiCheat.Storage
    class PersistentDataPathException : public BackgroundThreadAccessException
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x670690
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbg
{
public:
    // Static fields
    // static Il2CppString* bmpb;
    // static Il2CppString* bmpc;
    // static dbe* bmpd;

    uint8_t pad_0000[0x10]; // 0x0000
    Action* bmpe; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Action* bmpf; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    dbq* <bmpg>k__BackingField; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Il2CppString* <bmph>k__BackingField; // 0x0028

    // Methods
    void gfs();  // RVA: 0x67ED70
    ObscuredFileWriteResult uh(Byte[][] a);  // RVA: 0x680940
    void est(Stream* a, DeviceLockLevel b);  // RVA: 0x67ECE0
    Il2CppString* luh(Il2CppString* a);  // RVA: 0x67FBC0
    void wdi(Action* a);  // RVA: 0x680E40
    bool wdn();  // RVA: 0x6810C0
    Il2CppString* wdo();  // RVA: 0x6810D0
    void .ctor(Il2CppString* a, dbq* b);  // RVA: 0x67D900
    void .ctor();  // RVA: 0x67DAA0
    void .ctor(dbr* a);  // RVA: 0x67D960
    void ora();  // RVA: 0x67ED70
    void mgi(Stream* a, DeviceLockLevel b);  // RVA: 0x67FE40
    void hbv(Stream* a);  // RVA: 0x67EDD0
    ObscuredFileWriteResult wdr(Byte[][] a);  // RVA: 0x67EDA0
    ObscuredFileReadResult iqh();  // RVA: 0x67EE40
    void wdk(Action* a);  // RVA: 0x680F80
    static void wdp(Il2CppString* a);  // RVA: 0x6810E0
    void wdj(Action* a);  // RVA: 0x680EE0
    Il2CppString* cng(Il2CppString* a);  // RVA: 0x67DB60
    Il2CppString* wdy(Il2CppString* a);  // RVA: 0x6823E0
    dbq* wdm();  // RVA: 0x63B450
    ObscuredFileWriteResult wdv(Byte[][] a);  // RVA: 0x681DE0
    void kqk();  // RVA: 0x67ED70
    void icl();  // RVA: 0x67ED70
    void wdl(Action* a);  // RVA: 0x681020
    ObscuredFileHeader wdu(Stream* a);  // RVA: 0x67EEF0
    ObscuredFileWriteResult gfz(Byte[][] a);  // RVA: 0x67EDA0
    ObscuredFileReadResult efa();  // RVA: 0x67E070
    void knq(Stream* a);  // RVA: 0x67EE80
    void nxq(Stream* a);  // RVA: 0x6808D0
    ObscuredFileHeader ngz(Stream* a);  // RVA: 0x67EEF0
    void wdw(Stream* a);  // RVA: 0x6822E0
    void .ctor(Il2CppString* a);  // RVA: 0x67DA00
    void wdx(Stream* a, DeviceLockLevel b);  // RVA: 0x682350
    ObscuredFileWriteResult mrp(Byte[][] a);  // RVA: 0x6803D0
    ObscuredFileReadResult wdt();  // RVA: 0x681170
    ObscuredFileHeader kso(Stream* a);  // RVA: 0x67EEF0
    static void .cctor();  // RVA: 0x67D880
    void wdq();  // RVA: 0x67ED70
    ObscuredFileReadResult wds();  // RVA: 0x67EE40
    ObscuredFileWriteResult mgq(Byte[][] a);  // RVA: 0x67FED0
    ObscuredFileReadResult kxd();  // RVA: 0x67EF50
    void daf(Stream* a);  // RVA: 0x67E000
    Il2CppString* cq(Il2CppString* a);  // RVA: 0x67DDB0
};

// Namespace: <global>
class dbh
{
public:
    // Static fields
    // static int32_t bmpi;
    // static int32_t bmpj;
    // static Byte[][] bmpk;


    // Methods
    static void wef(Stream* a, Stream* b, dbp* c);  // RVA: 0x682A20
    static void weh(Stream* a, Stream* b, dbp* c);  // RVA: 0x682E30
    static uint32_t cip(Stream* a);  // RVA: 0x682950
    static void isb(Stream* a, Stream* b, dbp* c);  // RVA: 0x682A20
    static uint32_t wec(Stream* a);  // RVA: 0x682CA0
    static uint32_t bmp(Stream* a);  // RVA: 0x682810
    static uint32_t web(Stream* a);  // RVA: 0x6829E0
    static uint32_t weg(Byte[][] a);  // RVA: 0x682E10
    static uint32_t gvj(Stream* a);  // RVA: 0x6829E0
    static void bzc(Stream* a, Stream* b, dbp* c);  // RVA: 0x682850
    static uint32_t wee(Stream* a);  // RVA: 0x6829E0
    static void wea(Stream* a, Stream* b, dbp* c);  // RVA: 0x682C90
    static void kja(Stream* a, uint32_t b);  // RVA: 0x682AD0
    static void odr(Stream* a, uint32_t b);  // RVA: 0x682BB0
    static void wed(Stream* a, uint32_t b);  // RVA: 0x682D30
    static void be(Stream* a, Stream* b, dbp* c);  // RVA: 0x682660
    static void bkj(Stream* a, Stream* b, dbp* c);  // RVA: 0x682710
    static void wdz(Stream* a, Stream* b, dbp* c);  // RVA: 0x682A20
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileHeader
    {
    public:
        // Static fields
        // static uint8_t HeaderByte1;
        // static uint8_t HeaderByte2;
        // static uint8_t HeaderByte3;
        // static uint8_t HeaderByte4;
        // static uint8_t HeaderVersion;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t <Byte1>k__BackingField; // 0x0010
        uint8_t <Byte2>k__BackingField; // 0x0011
        uint8_t <Byte3>k__BackingField; // 0x0012
        uint8_t <Byte4>k__BackingField; // 0x0013
        uint8_t <Version>k__BackingField; // 0x0014
        ObscurationMode <ObscurationMode>k__BackingField; // 0x0015
    
        // Methods
        uint8_t get_Byte1();  // RVA: 0x66FCF0
        void set_Byte1(uint8_t value);  // RVA: 0x66FD90
        uint8_t get_Byte2();  // RVA: 0x66FD40
        void set_Byte2(uint8_t value);  // RVA: 0x66FDA0
        uint8_t get_Byte3();  // RVA: 0x66FD50
        void set_Byte3(uint8_t value);  // RVA: 0x66FDB0
        uint8_t get_Byte4();  // RVA: 0x66FD60
        void set_Byte4(uint8_t value);  // RVA: 0x66FDC0
        uint8_t get_Version();  // RVA: 0x66FD80
        void set_Version(uint8_t value);  // RVA: 0x66FDE0
        ObscurationMode get_ObscurationMode();  // RVA: 0x66FD70
        void set_ObscurationMode(ObscurationMode value);  // RVA: 0x66FDD0
        bool IsValid();  // RVA: 0x66FD10
        void wei(Stream* a);  // RVA: 0x66FDF0
        static void wej(Stream* a, ObscurationMode b);  // RVA: 0x66FEB0
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileErrorCode
    {
    public:
        // Static fields
        // static ObscuredFileErrorCode NoError;
        // static ObscuredFileErrorCode FileNotFound;
        // static ObscuredFileErrorCode FileDamaged;
        // static ObscuredFileErrorCode DataIsNotLocked;
        // static ObscuredFileErrorCode NotInitialized;
        // static ObscuredFileErrorCode OtherException;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileError
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        ObscuredFileErrorCode <ErrorCode>k__BackingField; // 0x0010
        uint8_t pad_0011[0x7]; // 0x0011
        Exception* <Exception>k__BackingField; // 0x0018
    
        // Methods
        ObscuredFileErrorCode get_ErrorCode();  // RVA: 0x66FCF0
        Exception* get_Exception();  // RVA: 0x66FD00
        void .ctor(ObscuredFileErrorCode code);  // RVA: 0x66FCD0
        void .ctor(Exception* exception);  // RVA: 0x66FCC0
        Il2CppString* ToString();  // RVA: 0x66FBE0
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileReadResult
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        Byte[][] <Data>k__BackingField; // 0x0010
        uint8_t pad_0011[0x7]; // 0x0011
        bool <DataIsNotGenuine>k__BackingField; // 0x0018
        bool <DataFromAnotherDevice>k__BackingField; // 0x0019
        uint8_t pad_001A[0x6]; // 0x001A
        ObscuredFileError <Error>k__BackingField; // 0x0020
        uint8_t pad_0021[0xF]; // 0x0021
        bool <IsValid>k__BackingField; // 0x0030
    
        // Methods
        bool wek();  // RVA: 0x6702D0
        Byte[][] get_Data();  // RVA: 0x6702A0
        bool wel();  // RVA: 0x670300
        bool get_DataIsNotGenuine();  // RVA: 0x670290
        bool get_DataFromAnotherDevice();  // RVA: 0x670280
        ObscuredFileError get_Error();  // RVA: 0x6702B0
        bool get_IsValid();  // RVA: 0x6702C0
        void .ctor(Byte[][] data, bool dataIsNotGenuine, bool dataFromAnotherDevice);  // RVA: 0x670230
        void .ctor(ObscuredFileError error);  // RVA: 0x6701E0
        static ObscuredFileReadResult wem(Exception* a);  // RVA: 0x670310
        static ObscuredFileReadResult wen(ObscuredFileErrorCode a);  // RVA: 0x670390
        Il2CppString* ToString();  // RVA: 0x66FF70
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileWriteResult
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        ObscuredFileError <Error>k__BackingField; // 0x0010
        uint8_t pad_0011[0xF]; // 0x0011
        bool <IsValid>k__BackingField; // 0x0020
    
        // Methods
        bool weo();  // RVA: 0x6705B0
        ObscuredFileError get_Error();  // RVA: 0x670590
        bool get_IsValid();  // RVA: 0x6705A0
        void .ctor(ObscuredFileErrorCode result);  // RVA: 0x670540
        void .ctor(ObscuredFileError error);  // RVA: 0x670510
        static ObscuredFileWriteResult wep(Exception* a);  // RVA: 0x6705C0
        static ObscuredFileWriteResult weq(ObscuredFileErrorCode a);  // RVA: 0x670610
        Il2CppString* ToString();  // RVA: 0x670410
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbi
{
public:
    // Static fields
    // static Il2CppString* bmpl;
    // static Il2CppString* bmpm;
    // static Action* bmpn;
    // static Action* bmpo;
    // static dbg* bmpp;
    // static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> bmpq;
    // static Il2CppObject* bmpr;
    // static bool <bmps>k__BackingField;
    // static bool <bmpt>k__BackingField;
    // static bool <bmpu>k__BackingField;
    // static ObscuredFileReadResult <bmpv>k__BackingField;
    // static ObscuredFileWriteResult <bmpw>k__BackingField;
    // static dbl* <bmpx>k__BackingField;


    // Methods
    static void wgt(Il2CppString* a, ObscuredLong b);  // RVA: 0x68E190
    static dbg* ido(Il2CppString* a, dbq* b);  // RVA: 0x687DF0
    static ObscuredDecimal diz(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x6842F0
    static dbq* wev();  // RVA: 0x68B9F0
    static void njd(Il2CppString* a, ObscuredShort b);  // RVA: 0x68A310
    static void wgq(Il2CppString* a, ObscuredFloat b);  // RVA: 0x68DFC0
    static ObscuredChar tq(Il2CppString* a, ObscuredChar b);  // RVA: 0x68B470
    static ObscuredFloat whn(Il2CppString* a, ObscuredFloat b);  // RVA: 0x68EF20
    static void wgu(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x68E220
    static void wgx(Il2CppString* a, ObscuredString* b);  // RVA: 0x68E3E0
    static void wgl(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x68DC80
    static void .cctor();  // RVA: 0x6832D0
    static ObscuredVector3Int wib(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x68F9D0
    static void qi(Il2CppString* a, ObscuredLong b);  // RVA: 0x68B2E0
    static void wes(Action* a);  // RVA: 0x68B700
    static System.Collections.Generic.ICollection<System.String> nhd();  // RVA: 0x68A290
    static ObscuredUInt whv(Il2CppString* a, ObscuredUInt b);  // RVA: 0x68F510
    static void wfi(ObscuredFileWriteResult a);  // RVA: 0x68BED0
    static ObscuredChar whh(Il2CppString* a, ObscuredChar b);  // RVA: 0x68E9D0
    static void wgb();  // RVA: 0x68D090
    static ObscuredQuaternion fak(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x685AB0
    static void mvs(Il2CppString* a, ObscuredBool b);  // RVA: 0x689E40
    static void blr(Il2CppString* a, ObscuredDouble b);  // RVA: 0x683850
    static void wfo(dbq* a, bool b);  // RVA: 0x68C270
    static ObscuredChar ntm(Il2CppString* a, ObscuredChar b);  // RVA: 0x68A740
    static void wfq();  // RVA: 0x68C550
    static ObscuredChar deq(Il2CppString* a, ObscuredChar b);  // RVA: 0x684170
    static void wfs(bool a);  // RVA: 0x68CA40
    static ObscuredQuaternion fmm(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x6861E0
    static ObscuredVector2Int whz(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x68F810
    static b wfy(Il2CppString* a, b b);  // RVA: 0x5640F0
    static bool fzi(Il2CppString* a);  // RVA: 0x686DB0
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> dvi();  // RVA: 0x684820
    static ObscuredSByte jij(Il2CppString* a, ObscuredSByte b);  // RVA: 0x688740
    static void ofz();  // RVA: 0x68ABE0
    static ObscuredSByte whs(Il2CppString* a, ObscuredSByte b);  // RVA: 0x68F350
    static void wfx(Il2CppString* a, a b);  // RVA: 0x5640F0
    static void igk(dbq* a, bool b);  // RVA: 0x687FA0
    static System.Collections.Generic.ICollection<System.String> wfu();  // RVA: 0x68CBA0
    static ObscuredBigInteger gbh(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x686EE0
    static ObscuredBigInteger whl(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x68ED40
    static void wfn(Il2CppString* a, bool b);  // RVA: 0x68C1E0
    static void flr();  // RVA: 0x685EB0
    static void nxi(Il2CppString* a);  // RVA: 0x68A8B0
    static ObscuredFileWriteResult wgd();  // RVA: 0x68D500
    static void wgp(Il2CppString* a, ObscuredDouble b);  // RVA: 0x68DF20
    static void fuf(Il2CppString* a, ObscuredLong b);  // RVA: 0x686790
    static bool wft(Il2CppString* a);  // RVA: 0x68CB20
    static ObscuredGuid who(Il2CppString* a, ObscuredGuid b);  // RVA: 0x68EFE0
    static ObscuredShort jn(Il2CppString* a, ObscuredShort b);  // RVA: 0x6887C0
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> eys();  // RVA: 0x6856B0
    static void wfr();  // RVA: 0x68C710
    static ObscuredQuaternion whr(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x68F250
    static void wgz(Il2CppString* a, ObscuredULong b);  // RVA: 0x68E4E0
    static ObscuredLong lyw(Il2CppString* a, ObscuredLong b);  // RVA: 0x6899F0
    static void nec(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x68A170
    static ObscuredDateTimeOffset whj(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x68EB50
    static void hnk(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x6874B0
    static void nu(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x68A800
    static ObscuredULong fil(Il2CppString* a, ObscuredULong b);  // RVA: 0x685C50
    static ObscuredChar iis(Il2CppString* a, ObscuredChar b);  // RVA: 0x688100
    static void wet(Action* a);  // RVA: 0x68B7F0
    static void wgm(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x68DD10
    static ObscuredDateTimeOffset hxx(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x687C10
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> fxj();  // RVA: 0x6869B0
    static void whd(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x68E730
    static ObscuredDouble cxq(Il2CppString* a, ObscuredDouble b);  // RVA: 0x683EE0
    static ObscuredDateTime gvt(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x687340
    static void dkd(Il2CppString* a, ObscuredBool b);  // RVA: 0x6843F0
    static void weu(Action* a);  // RVA: 0x68B8F0
    static void oia(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x68AF10
    static void knr(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x688CA0
    static void gcy(Il2CppString* a, bool b);  // RVA: 0x686FE0
    static ObscuredVector2 obu(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x68AB10
    static ObscuredDouble whm(Il2CppString* a, ObscuredDouble b);  // RVA: 0x68EE40
    static void wgs(Il2CppString* a, ObscuredInt b);  // RVA: 0x68E110
    static ObscuredVector3 ikq(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x688290
    static dbg* wfz(Il2CppString* a, dbq* b);  // RVA: 0x68CF00
    static void ccr(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x683C20
    static void hfk(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x687400
    static void ddo(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x6840C0
    static ObscuredShort wht(Il2CppString* a, ObscuredShort b);  // RVA: 0x68F3D0
    static void wgf(Il2CppString* a, d b);  // RVA: 0x5640F0
    static void lih(Il2CppString* a, ObscuredUInt b);  // RVA: 0x688ED0
    static ObscuredULong whw(Il2CppString* a, ObscuredULong b);  // RVA: 0x68F5C0
    static ObscuredInt whp(Il2CppString* a, ObscuredInt b);  // RVA: 0x68F0E0
    static ObscuredVector2 why(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x68F740
    static void wgn(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x68DDC0
    static ObscuredDateTimeOffset fvc(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x686820
    static void wgv(Il2CppString* a, ObscuredSByte b);  // RVA: 0x68E2D0
    static ObscuredUInt oad(Il2CppString* a, ObscuredUInt b);  // RVA: 0x68AA60
    static void mxh(Il2CppString* a, ObscuredUInt b);  // RVA: 0x689ED0
    static void dwo(Il2CppString* a, bool b);  // RVA: 0x684C20
    static void ksw(Il2CppString* a, ObscuredString* b);  // RVA: 0x688DC0
    static void nog(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x68A4A0
    static void nor(Il2CppString* a, ObscuredUShort b);  // RVA: 0x68A550
    static ObscuredUShort whx(Il2CppString* a, ObscuredUShort b);  // RVA: 0x68F680
    static ObscuredBool whf(Il2CppString* a, ObscuredBool b);  // RVA: 0x68E890
    static void cbw();  // RVA: 0x683A60
    static void hxd(bool a);  // RVA: 0x687A50
    static ObscuredDateTime fnj(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x6864C0
    static ObscuredByte whg(Il2CppString* a, ObscuredByte b);  // RVA: 0x68E950
    static ObscuredFileWriteResult lky(Byte[][] a);  // RVA: 0x6890B0
    static ObscuredUInt kaq(Il2CppString* a, ObscuredUInt b);  // RVA: 0x6889D0
    static void hxm(bool a);  // RVA: 0x687B30
    static bool kjb(Il2CppString* a);  // RVA: 0x688A80
    static bool bab(Il2CppString* a);  // RVA: 0x683350
    static void lkp(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x689020
    static bool wfc();  // RVA: 0x68BC60
    static System.Collections.Generic.ICollection<System.String> ghn();  // RVA: 0x687070
    static ObscuredFileWriteResult lv();  // RVA: 0x6896D0
    static void wgj(Il2CppString* a, ObscuredByte b);  // RVA: 0x68DB70
    static ObscuredUShort nyr(Il2CppString* a, ObscuredUShort b);  // RVA: 0x68A9A0
    static void cgl(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x683D90
    static bool drj();  // RVA: 0x684480
    static bool hom();  // RVA: 0x687560
    static void be(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x6833D0
    static ObscuredString* bjn(Il2CppString* a, ObscuredString* b);  // RVA: 0x683500
    static ObscuredDouble nqd(Il2CppString* a, ObscuredDouble b);  // RVA: 0x68A5E0
    static ObscuredFileWriteResult wgh(Byte[][] a);  // RVA: 0x68D8C0
    static ObscuredFileWriteResult ndf(Byte[][] a);  // RVA: 0x689F50
    static ObscuredDateTime whi(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x68EA90
    static void dbn(Il2CppString* a, ObscuredSByte b);  // RVA: 0x683FC0
    static ObscuredFileReadResult fms();  // RVA: 0x6862E0
    static ObscuredFileWriteResult bkd(Byte[][] a);  // RVA: 0x683580
    static ObscuredBigInteger nlx(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x68A3A0
    static ObscuredFileWriteResult wfh();  // RVA: 0x68BE60
    static ObscuredVector2Int fta(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x6866D0
    static void wfm(bool a);  // RVA: 0x68C120
    static void wha(Il2CppString* a, ObscuredUShort b);  // RVA: 0x68E570
    static void ivb(Il2CppString* a);  // RVA: 0x688550
    static void wfw();  // RVA: 0x68CD10
    static ObscuredString* whu(Il2CppString* a, ObscuredString* b);  // RVA: 0x68F490
    static void wer(Action* a);  // RVA: 0x68B610
    static dbl* wfj();  // RVA: 0x68BF50
    static bool wey();  // RVA: 0x68BAF0
    static void enw(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x6854B0
    static ObscuredFileReadResult wgg();  // RVA: 0x68D6E0
    static void cpe(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x683E30
    static void hsy(Il2CppString* a, ObscuredULong b);  // RVA: 0x6879C0
    static void wgr(Il2CppString* a, ObscuredGuid b);  // RVA: 0x68E060
    static void cak(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x6839B0
    static void wgi(Il2CppString* a, ObscuredBool b);  // RVA: 0x68DAE0
    static void fkh(Il2CppString* a, ObscuredDouble b);  // RVA: 0x685D10
    static void fwm(Il2CppString* a, ObscuredDouble b);  // RVA: 0x686910
    static void ben(Il2CppString* a, ObscuredShort b);  // RVA: 0x683470
    static void wgo(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x68DE70
    static ObscuredVector2Int cfo(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x683CD0
    static void wex(bool a);  // RVA: 0x68BA90
    static void gmm(Il2CppString* a, ObscuredDouble b);  // RVA: 0x687180
    static ObscuredLong xw(Il2CppString* a, ObscuredLong b);  // RVA: 0x68FC00
    static ObscuredSByte mpa(Il2CppString* a, ObscuredSByte b);  // RVA: 0x689BA0
    static void msr(Il2CppString* a, ObscuredSByte b);  // RVA: 0x689DC0
    static void whe(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x68E7E0
    static void fcm(dbq* a, bool b);  // RVA: 0x685BB0
    static void wfv(Il2CppString* a);  // RVA: 0x68CC20
    static void egq(Il2CppString* a, dbq* b, bool c);  // RVA: 0x685070
    static void frn(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x686640
    static void wfp(Il2CppString* a, dbq* b, bool c);  // RVA: 0x68C310
    static void wgw(Il2CppString* a, ObscuredShort b);  // RVA: 0x68E350
    static void kkm(bool a);  // RVA: 0x688BC0
    static ObscuredVector3 wia(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x68F8D0
    static void wfd(bool a);  // RVA: 0x68BCB0
    static void iez(Il2CppString* a, ObscuredULong b);  // RVA: 0x687F10
    static Il2CppString* wfe();  // RVA: 0x68BD10
    static ObscuredLong iqs(Il2CppString* a, ObscuredLong b);  // RVA: 0x688390
    static void jwq(Il2CppString* a, ObscuredBool b);  // RVA: 0x688940
    static bool wfa();  // RVA: 0x68BBB0
    static void dyx();  // RVA: 0x684CB0
    static bool wez();  // RVA: 0x68BB50
    static ObscuredQuaternion iub(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x688450
    static ObscuredLong oig(Il2CppString* a, ObscuredLong b);  // RVA: 0x68AFA0
    static void ww(Il2CppString* a, ObscuredString* b);  // RVA: 0x68FAD0
    static void lx(Il2CppString* a, bool b);  // RVA: 0x6898B0
    static void gmq(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x687220
    static ObscuredUShort kk(Il2CppString* a, ObscuredUShort b);  // RVA: 0x688B00
    static ObscuredSByte gub(Il2CppString* a, ObscuredSByte b);  // RVA: 0x6872C0
    static ObscuredDateTime bwv(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x6838F0
    static bool Save();  // RVA: 0x682F30
    static void emk(Il2CppString* a, ObscuredUShort b);  // RVA: 0x685420
    static ObscuredDateTime oua(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x68B220
    static void idd(Il2CppString* a);  // RVA: 0x687D00
    static void whb(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x68E600
    static void gjc(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x6870F0
    static void lbx(Il2CppString* a, ObscuredLong b);  // RVA: 0x688E40
    static ObscuredDateTimeOffset eib(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x6852B0
    static ObscuredVector2 ey(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x6855E0
    static ObscuredDecimal ois(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x68B060
    static void wfb(bool a);  // RVA: 0x68BC00
    static ObscuredLong whq(Il2CppString* a, ObscuredLong b);  // RVA: 0x68F190
    static ObscuredFloat hrq(Il2CppString* a, ObscuredFloat b);  // RVA: 0x687900
    static ObscuredDouble mqt(Il2CppString* a, ObscuredDouble b);  // RVA: 0x689CE0
    static ObscuredDouble vc(Il2CppString* a, ObscuredDouble b);  // RVA: 0x68B530
    static void dzs(Il2CppString* a, ObscuredShort b);  // RVA: 0x684FE0
    static ObscuredUInt xn(Il2CppString* a, ObscuredUInt b);  // RVA: 0x68FB50
    static void nrh(Il2CppString* a, ObscuredSByte b);  // RVA: 0x68A6C0
    static c wge(Il2CppString* a, c b);  // RVA: 0x5640F0
    static dbg* wfl();  // RVA: 0x68C010
    static void ewa(Il2CppString* a, ObscuredByte b);  // RVA: 0x685560
    static void det(bool a);  // RVA: 0x684230
    static ObscuredVector2 iiu(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x6881C0
    static ObscuredULong fph(Il2CppString* a, ObscuredULong b);  // RVA: 0x686580
    static void wga();  // RVA: 0x68D020
    static void wgk(Il2CppString* a, ObscuredChar b);  // RVA: 0x68DBF0
    static void lyp(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x689940
    static void wfk(dbl* a);  // RVA: 0x68BFA0
    static ObscuredSByte ner(Il2CppString* a, ObscuredSByte b);  // RVA: 0x68A210
    static void eiu(Il2CppString* a, ObscuredSByte b);  // RVA: 0x6853A0
    static ObscuredQuaternion rp(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x68B370
    static void wgy(Il2CppString* a, ObscuredUInt b);  // RVA: 0x68E460
    static ObscuredFileReadResult wff();  // RVA: 0x68BD60
    static void gaq(Il2CppString* a, ObscuredGuid b);  // RVA: 0x686E30
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> lnv();  // RVA: 0x6892D0
    static ObscuredULong opl(Il2CppString* a, ObscuredULong b);  // RVA: 0x68B160
    static void wfg(ObscuredFileReadResult a);  // RVA: 0x68BDD0
    static ObscuredULong jnd(Il2CppString* a, ObscuredULong b);  // RVA: 0x688880
    static ObscuredUShort mqo(Il2CppString* a, ObscuredUShort b);  // RVA: 0x689C20
    static ObscuredUShort iir(Il2CppString* a, ObscuredUShort b);  // RVA: 0x688040
    static ObscuredVector2 ljj(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x688F50
    static void blj(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x6837A0
    static System.Collections.Generic.ICollection<System.String> dcw();  // RVA: 0x684040
    static void whc(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x68E6A0
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wgc();  // RVA: 0x68D100
    static void koy();  // RVA: 0x688D50
    static bool wew();  // RVA: 0x68BA40
    static ObscuredDecimal whk(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x68EC40
    static ObscuredVector3 iwg(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x688640
    static ObscuredVector3 flo(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x685DB0
    static ObscuredDateTimeOffset mhe(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x689AB0
};

// Namespace: <global>
class dbj
{
public:
    // Static fields
    // static bool bmpy;


    // Methods
    static bool cer();  // RVA: 0x68FCD0
    static void u();  // RVA: 0x68FDF0
    static void cup(bool a);  // RVA: 0x68FCF0
    static void wif(bool a);  // RVA: 0x68FDE0
    static bool oqn();  // RVA: 0x68FCD0
    static void wie(bool a);  // RVA: 0x68FCC0
    static void wih();  // RVA: 0x6903C0
    static void wig(bool a);  // RVA: 0x6902D0
    static bool wid();  // RVA: 0x68FCD0
    static void wic();  // RVA: 0x690060
    static void dpm(bool a);  // RVA: 0x68FDE0
    static void bdc(bool a);  // RVA: 0x68FCC0
};

// Namespace: <global>
class dbk
{
public:

    // Methods
    static Byte[][] bqy(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a, dbl* b);  // RVA: 0x690520
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wil(Byte[][] a, dbl* b);  // RVA: 0x690750
    static Byte[][] frm(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a, dbl* b);  // RVA: 0x690600
    static Byte[][] wik(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a, dbl* b);  // RVA: 0x6906E0
    static Byte[][] ney(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a, dbl* b);  // RVA: 0x690670
    static dbn* wim(dbl* a);  // RVA: 0x690820
    static ObscuredPrefsData wii(a a, dbl* b);  // RVA: 0x5640F0
    static Byte[][] dil(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a, dbl* b);  // RVA: 0x690590
    static b wij(ObscuredPrefsData a, dbl* b);  // RVA: 0x5640F0
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct ACTkSerializationKind
    {
    public:
        // Static fields
        // static ACTkSerializationKind Binary;
    
        uint8_t pad_0000[0x10]; // 0x0000
        int32_t value__; // 0x0010
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbl
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    ACTkSerializationKind <bmpz>k__BackingField; // 0x0010

    // Methods
    ACTkSerializationKind win();  // RVA: 0x66F7C0
    void .ctor(ACTkSerializationKind a);  // RVA: 0x67D2D0
};

// Namespace: <global>
class dbm
{
public:
    // Static fields
    // static uint8_t bmqa;
    // static dbm* bmqb;


    // Methods
    void wit(BinaryWriter* a, Il2CppString* b, ObscuredPrefsData c);  // RVA: 0x690930
    void fje(BinaryWriter* a, Il2CppString* b, ObscuredPrefsData c);  // RVA: 0x690930
    b wiq(ObscuredPrefsData a);  // RVA: 0x5640F0
    void fts(BinaryWriter* a, Il2CppString* b, ObscuredPrefsData c);  // RVA: 0x690930
    System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wis(Byte[][] a);  // RVA: 0x691070
    ObscuredPrefsData wip(a a);  // RVA: 0x5640F0
    System.ValueTuple<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> iok(BinaryReader* a);  // RVA: 0x6909D0
    Byte[][] wir(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a);  // RVA: 0x690C80
    void .ctor();  // RVA: 0x629380
    static dbn* wio();  // RVA: 0x690BF0
    System.ValueTuple<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wiu(BinaryReader* a);  // RVA: 0x691480
    System.ValueTuple<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> kfe(BinaryReader* a);  // RVA: 0x690AE0
};

// Namespace: <global>
class dbn
{
public:

    // Methods
    ObscuredPrefsData wip(a a);  // RVA: 0x5640F0
    b wiq(ObscuredPrefsData a);  // RVA: 0x5640F0
    Byte[][] wir(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a);  // RVA: 0x41BD90
    System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wis(Byte[][] a);  // RVA: 0x41BD90
};

// Namespace: <global>
class dbo
{
public:
    // Static fields
    // static dbo* bmqc;


    // Methods
    ObscuredPrefsData wip(a a);  // RVA: 0x5640F0
    static dbn* wiv();  // RVA: 0x6917C0
    b wiq(ObscuredPrefsData a);  // RVA: 0x5640F0
    void .ctor();  // RVA: 0x629380
    static dbn* mzb();  // RVA: 0x691620
    System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wis(Byte[][] a);  // RVA: 0x691780
    static dbn* nfo();  // RVA: 0x6916B0
    static dbn* hvu();  // RVA: 0x691590
