// ============================================================
// Image: ACTk.Runtime.dll
// ============================================================

namespace Microsoft.CodeAnalysis
{

    // Namespace: Microsoft.CodeAnalysis
    class EmbeddedAttribute : public Attribute
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x666560
    };

} // namespace Microsoft.CodeAnalysis

namespace System.Runtime.CompilerServices
{

    // Namespace: System.Runtime.CompilerServices
    class IsUnmanagedAttribute : public Attribute
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x666560
    };

} // namespace System.Runtime.CompilerServices

// Namespace: <global>
struct MonoScriptData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Byte[][] FilePathsData; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Byte[][] TypesData; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    int32_t TotalTypes; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    int32_t TotalFiles; // 0x0024
    uint8_t pad_0025[0x3]; // 0x0025
    bool IsEditorOnly; // 0x0028
};

// Namespace: <global>
class dan
{
public:

    // Methods
    static MonoScriptData vza();  // RVA: 0x667590
    static MonoScriptData djy();  // RVA: 0x6672F0
    static MonoScriptData byk();  // RVA: 0x667210
    static MonoScriptData hqb();  // RVA: 0x6673D0
    static MonoScriptData hxw();  // RVA: 0x6674B0
    void .ctor();  // RVA: 0x6284D0
};

// Namespace: <global>
class dao
{
public:

    // Methods
    static void vzc();  // RVA: 0x635AE0
    static void vzb();  // RVA: 0x635AE0
};

// Namespace: <global>
class ApplicationFocusEventHandler : public MulticastDelegate
{
public:

    // Methods
    void .ctor(Il2CppObject* object, intptr_t method);  // RVA: 0x666450
    void Invoke(bool hasFocus);  // RVA: 0x666440
    IAsyncResult* BeginInvoke(bool hasFocus, AsyncCallback* callback, Il2CppObject* object);  // RVA: 0x6663D0
    void EndInvoke(IAsyncResult* result);  // RVA: 0x666430
};

// Namespace: <global>
class ApplicationPauseEventHandler : public MulticastDelegate
{
public:

    // Methods
    void .ctor(Il2CppObject* object, intptr_t method);  // RVA: 0x666450
    void Invoke(bool pauseStatus);  // RVA: 0x666440
    IAsyncResult* BeginInvoke(bool pauseStatus, AsyncCallback* callback, Il2CppObject* object);  // RVA: 0x6663D0
    void EndInvoke(IAsyncResult* result);  // RVA: 0x666430
};

// Namespace: <global>
class dap : public MonoBehaviour
{
public:
    // Static fields
    // static dap* bmoa;

    uint8_t pad_0000[0x20]; // 0x0000
    ApplicationFocusEventHandler* bmny; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    ApplicationPauseEventHandler* bmnz; // 0x0028

    // Methods
    void OnApplicationFocus(bool hasFocus);  // RVA: 0x667710
    void il(bool hasFocus);  // RVA: 0x667710
    void gle(bool pauseStatus);  // RVA: 0x667730
    void vzg(ApplicationPauseEventHandler* a);  // RVA: 0x667930
    static dap* vzh();  // RVA: 0x6679D0
    void .ctor();  // RVA: 0x6287A0
    void cwd(bool pauseStatus);  // RVA: 0x667730
    void vzd(ApplicationFocusEventHandler* a);  // RVA: 0x667750
    void j(bool pauseStatus);  // RVA: 0x667730
    void Awake();  // RVA: 0x667670
    void vzf(ApplicationPauseEventHandler* a);  // RVA: 0x667890
    void OnApplicationPause(bool pauseStatus);  // RVA: 0x667730
    void vze(ApplicationFocusEventHandler* a);  // RVA: 0x6677F0
};

// Namespace: <global>
class daq
{
public:

    // Methods
    static Char[][] vzj(Il2CppString* a);  // RVA: 0x667FA0
    static Il2CppString* vzi(Il2CppString* a);  // RVA: 0x667F00
    static Char[][] lll(Il2CppString* a);  // RVA: 0x667D50
    static Char[][] her(Il2CppString* a);  // RVA: 0x667BA0
    static Il2CppString* vzk(Il2CppString* a);  // RVA: 0x668040
    static Il2CppString* msu(Char[][] a);  // RVA: 0x667DF0
    static Il2CppString* vzl(Char[][] a);  // RVA: 0x668160
    static Char[][] cma(Il2CppString* a);  // RVA: 0x667B00
    static Il2CppString* jfq(Char[][] a);  // RVA: 0x667C40
};

// Namespace: <global>
class dar
{
public:
    // Static fields
    // static int32_t bmob;
    // static uint8_t bmoc;
    // static uint8_t bmod;
    // static uint8_t bmoe;
    // static uint8_t bmof;
    // static uint8_t bmog;


    // Methods
    static void vzm(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x668580
    static void vzr(Stream* a, Stream* b, Byte[][] c, uint8_t d, uint8_t e);  // RVA: 0x436950
    static void vzn(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x6685F0
    static void omr(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x668510
    static void vzq(Stream* a, Stream* b, Byte[][] c, uint8_t d);  // RVA: 0x563F30
    static void ezh(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x6682E0
    static void nda(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x6684A0
    static void evn(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x668270
    static void vzo(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x668660
    static void vzp(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x6686D0
    static void ltq(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x668430
    static void jqm(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x6683C0
    static void iuo(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x668350
};

// Namespace: <global>
class das
{
public:
    // Static fields
    // static int32_t bmoh;


    // Methods
    static int32_t bbc(BigInteger a);  // RVA: 0x668740
    static bool fff(int64_t a, int32_t b);  // RVA: 0x6695D0
    static int32_t huh(DateTimeOffset a);  // RVA: 0x66A050
    static int32_t idi(Decimal a);  // RVA: 0x66A130
    static bool vzw(int64_t a, int32_t b);  // RVA: 0x6695D0
    static int32_t waj(a a);  // RVA: 0x563F30
    static bool wai(Guid a, int32_t b);  // RVA: 0x66A300
    static int32_t wat(uint64_t a);  // RVA: 0x66B810
    static bool wad(Vector3Int a, int32_t b);  // RVA: 0x66AD50
    static bool wab(Vector2Int a, int32_t b);  // RVA: 0x66A330
    static bool dra(BigInteger a, int32_t b);  // RVA: 0x6696F0
    static bool img(double a, int32_t b);  // RVA: 0x669820
    static int32_t eue(Guid a);  // RVA: 0x669850
    static bool lht(Char[][] a, int32_t b);  // RVA: 0x66AA80
    static bool npc(Vector2Int a, int32_t b);  // RVA: 0x66A330
    static int32_t zn(float a);  // RVA: 0x668D10
    static bool nzr(Vector2Int a, int32_t b);  // RVA: 0x66A330
    static bool wae(float a, int32_t b);  // RVA: 0x66AAE0
    static int32_t wak(BigInteger a);  // RVA: 0x66AE70
    static int32_t ljr(uint32_t a);  // RVA: 0x669AD0
    static int32_t lap(DateTimeOffset a);  // RVA: 0x66A9A0
    static bool egb(double a, int32_t b);  // RVA: 0x669820
    static int32_t wbc(Il2CppString* a);  // RVA: 0x66BA20
    static bool iza(Guid a, int32_t b);  // RVA: 0x66A300
    static int32_t jky(Decimal a);  // RVA: 0x66A5B0
    static bool jzn(Quaternion a, int32_t b);  // RVA: 0x669CE0
    static int32_t wbb(Char[][] a);  // RVA: 0x66B9D0
    static bool obs(Vector2 a, int32_t b);  // RVA: 0x669190
    static int32_t wau(float a);  // RVA: 0x668D10
    static int32_t mqm(Vector2Int a);  // RVA: 0x668B70
    static int32_t waw(Quaternion a);  // RVA: 0x66A820
    static int32_t bld(Vector2Int a);  // RVA: 0x668B70
    static int32_t glj(DateTime a);  // RVA: 0x669D30
    static bool gux(int32_t a, int32_t b);  // RVA: 0x668B20
    static int32_t efm(Vector2Int a);  // RVA: 0x668B70
    static int32_t wax(Vector2 a);  // RVA: 0x669240
    static int32_t joj(int64_t a);  // RVA: 0x669B20
    static int32_t esi(Vector2Int a);  // RVA: 0x668B70
    static int32_t war(int64_t a);  // RVA: 0x66B770
    static int32_t kaa(Char[][] a);  // RVA: 0x66A7D0
    static bool wah(DateTimeOffset a, int32_t b);  // RVA: 0x669740
    static bool gcl(Quaternion a, int32_t b);  // RVA: 0x669CE0
    static bool iyy(double a, int32_t b);  // RVA: 0x669820
    static bool dvr(BigInteger a, int32_t b);  // RVA: 0x6696F0
    static bool wac(Vector3 a, int32_t b);  // RVA: 0x669080
    static int32_t gpt(DateTime a);  // RVA: 0x669E20
    static bool waf(double a, int32_t b);  // RVA: 0x669820
    static int32_t llr(Vector3 a);  // RVA: 0x669BB0
    static int32_t crx(BigInteger a);  // RVA: 0x6692E0
    static bool fit(uint32_t a, int32_t b);  // RVA: 0x668B20
    static bool iyg(Vector3 a, int32_t b);  // RVA: 0x669080
    static int32_t was(uint32_t a);  // RVA: 0x669AD0
    static bool hjn(uint64_t a, int32_t b);  // RVA: 0x669770
    static bool cpo(Vector2 a, int32_t b);  // RVA: 0x669190
    static int32_t lul(DateTimeOffset a);  // RVA: 0x66AB90
    static bool mkq(int32_t a, int32_t b);  // RVA: 0x668B20
    static int32_t loj(Char[][] a);  // RVA: 0x66AB40
    static bool ggx(Vector3 a, int32_t b);  // RVA: 0x669080
    static bool lta(Quaternion a, int32_t b);  // RVA: 0x669CE0
    static int32_t kxv(Quaternion a);  // RVA: 0x66A820
    static bool vzu(Decimal a, int32_t b);  // RVA: 0x668D60
    static bool bzw(Decimal a, int32_t b);  // RVA: 0x668D60
    static bool dcs(int64_t a, int32_t b);  // RVA: 0x6695D0
    static bool wag(Char[][] a, int32_t b);  // RVA: 0x66AA80
    static bool jjp(int64_t a, int32_t b);  // RVA: 0x6695D0
    static bool mef(int32_t a, int32_t b);  // RVA: 0x668B20
    static int32_t wan(int32_t a);  // RVA: 0x669AD0
    static int32_t fgu(int64_t a);  // RVA: 0x669B20
    static int32_t dmj(double a);  // RVA: 0x669680
    static int32_t wam(Decimal a);  // RVA: 0x66B170
    static int32_t jrj(DateTime a);  // RVA: 0x66A6E0
    static int32_t lea(uint32_t a);  // RVA: 0x669AD0
    static bool vzt(bool a, int32_t b);  // RVA: 0x66AD30
    static bool ooi(DateTimeOffset a, int32_t b);  // RVA: 0x669740
    static int32_t wal(bool a);  // RVA: 0x66B160
    static int32_t gdc(double a);  // RVA: 0x669D10
    static bool feu(uint64_t a, int32_t b);  // RVA: 0x669770
    static bool lcc(DateTimeOffset a, int32_t b);  // RVA: 0x669740
    static bool dyg(DateTimeOffset a, int32_t b);  // RVA: 0x669740
    static int32_t hbb(uint64_t a);  // RVA: 0x669FB0
    static bool nss(int64_t a, int32_t b);  // RVA: 0x6695D0
    static int32_t ccw(BigInteger a);  // RVA: 0x668D90
    static bool lo(float a, int32_t b);  // RVA: 0x66AAE0
    static int32_t wav(double a);  // RVA: 0x66B8B0
    static int32_t wao(DateTime a);  // RVA: 0x66B340
    static bool gcj(Vector2 a, int32_t b);  // RVA: 0x669190
    static int32_t omc(Quaternion a);  // RVA: 0x66A820
    static int32_t fxc(int32_t a);  // RVA: 0x669CA0
    static bool vzy(uint64_t a, int32_t b);  // RVA: 0x669770
    static int32_t mib(int32_t a);  // RVA: 0x66AC70
    static bool jda(BigInteger a, int32_t b);  // RVA: 0x6696F0
    static int32_t bbu(DateTime a);  // RVA: 0x668A30
    static int32_t way(Vector2Int a);  // RVA: 0x668B70
    static bool los(uint64_t a, int32_t b);  // RVA: 0x669770
    static bool guw(double a, int32_t b);  // RVA: 0x669820
    static bool fqe(Vector2 a, int32_t b);  // RVA: 0x669190
    static bool cif(Vector3 a, int32_t b);  // RVA: 0x669080
    static int32_t waz(Vector3 a);  // RVA: 0x669BB0
    static int32_t mdg(Vector3 a);  // RVA: 0x669BB0
    static bool sq(uint32_t a, int32_t b);  // RVA: 0x668B20
    static int32_t oqw(float a);  // RVA: 0x668D10
    static bool vzv(int32_t a, int32_t b);  // RVA: 0x668B20
    static int32_t kyu(int32_t a);  // RVA: 0x66A960
    static int32_t waq(Guid a);  // RVA: 0x66B510
    static bool ebh(int32_t a, int32_t b);  // RVA: 0x668B20
    static int32_t jga(Decimal a);  // RVA: 0x66A3E0
    static int32_t ojm(uint64_t a);  // RVA: 0x66ACB0
    static int32_t bsz(float a);  // RVA: 0x668D10
    static int32_t duc(double a);  // RVA: 0x669720
    static bool vzx(uint32_t a, int32_t b);  // RVA: 0x668B20
    static int32_t wap(DateTimeOffset a);  // RVA: 0x66B430
    static bool ebx(uint64_t a, int32_t b);  // RVA: 0x669770
    static int32_t fah(uint32_t a);  // RVA: 0x669AD0
    static bool hfx(Vector3 a, int32_t b);  // RVA: 0x669080
    static bool beu(uint32_t a, int32_t b);  // RVA: 0x668B20
    static int32_t koh(uint32_t a);  // RVA: 0x669AD0
    static int32_t crn(Vector2 a);  // RVA: 0x669240
    static bool waa(Vector2 a, int32_t b);  // RVA: 0x669190
    static int32_t wba(Vector3Int a);  // RVA: 0x66B8D0
    static bool vzz(Quaternion a, int32_t b);  // RVA: 0x669CE0
    static bool vzs(BigInteger a, int32_t b);  // RVA: 0x6696F0
    static bool jcu(Vector2Int a, int32_t b);  // RVA: 0x66A330
    static int32_t gwz(int64_t a);  // RVA: 0x669F10
    static int32_t fwz(Vector3 a);  // RVA: 0x669BB0
    static int32_t bsm(Vector3Int a);  // RVA: 0x668C10
    static bool kzy(DateTimeOffset a, int32_t b);  // RVA: 0x669740
    static int32_t obu(float a);  // RVA: 0x668D10
    static int32_t dmt(Char[][] a);  // RVA: 0x6696A0
    static int32_t isd(Char[][] a);  // RVA: 0x66A2B0
};

// Namespace: <global>
class dat : public CertificateHandler
{
public:

    // Methods
    bool ValidateCertificate(Byte[][] certificateData);  // RVA: 0x66BAA0
    void .ctor();  // RVA: 0x66BAB0
};

// Namespace: <global>
class dau
{
public:

    // Methods
    static bool gha(double a, double b, double c);  // RVA: 0x66BC20
    static bool wbe(double a, double b, double c);  // RVA: 0x66BF30
    static bool fsj(float a, float b, float c);  // RVA: 0x66BB70
    static bool jnf(double a, double b, double c);  // RVA: 0x66BD50
    static bool dcs(float a, float b, float c);  // RVA: 0x66BAC0
    static bool wbd(float a, float b, float c);  // RVA: 0x66BE80
};

// Namespace: <global>
class dav
{
public:

    // Methods
    static void wbf(System.IProgress<CodeStage.AntiCheat.Genuine.CodeHash.FilesProgress> a, int32_t b, int32_t c, int64_t d, Il2CppString* e);  // RVA: 0x66C060
};

// Namespace: <global>
class daw
{
public:

    // Methods
    static int32_t gja();  // RVA: 0x66C6D0
    static int64_t fvm();  // RVA: 0x66C680
    static int64_t wbo();  // RVA: 0x66C370
    static int32_t wbm();  // RVA: 0x66C230
    static int16_t wbk();  // RVA: 0x66CC00
    static uint32_t wbn();  // RVA: 0x66C230
    static void ewo(Char[][] a);  // RVA: 0x66C550
    static wchar_t kdi();  // RVA: 0x66C8F0
    static wchar_t fkf();  // RVA: 0x66C630
    static uint64_t wbp();  // RVA: 0x66C370
    static uint8_t kma();  // RVA: 0x66C940
    static int64_t bzo();  // RVA: 0x66C2D0
    static uint32_t brw();  // RVA: 0x66C230
    static int8_t nvu();  // RVA: 0x66C9E0
    static int16_t bbb();  // RVA: 0x66C190
    static uint8_t jpp();  // RVA: 0x66C8A0
    static uint32_t kyh();  // RVA: 0x66C230
    static void wbq(Char[][] a);  // RVA: 0x66CCA0
    static int16_t fcv();  // RVA: 0x66C5E0
    static wchar_t byd();  // RVA: 0x66C280
    static int8_t cmn();  // RVA: 0x66C320
    static int16_t bmr();  // RVA: 0x66C1E0
    static uint8_t hlz();  // RVA: 0x66C720
    static Il2CppString* dsv(int32_t a);  // RVA: 0x66C3D0
    static int32_t ewf();  // RVA: 0x66C500
    static wchar_t wbj();  // RVA: 0x66CBB0
    static uint16_t eby();  // RVA: 0x66C4B0
    static uint64_t dfo();  // RVA: 0x66C370
    static uint8_t mig();  // RVA: 0x66C990
    static uint16_t wbl();  // RVA: 0x66CC50
    static Il2CppString* jcq(int32_t a);  // RVA: 0x66C7C0
    static Il2CppString* wbg(int32_t a);  // RVA: 0x66CA30
    static uint8_t wbh();  // RVA: 0x66CB10
    static int8_t wbi();  // RVA: 0x66CB60
    static uint64_t lhg();  // RVA: 0x66C370
    static int16_t izq();  // RVA: 0x66C770
};

// Namespace: <global>
class dax
{
public:
    // Static fields
    // static Char[][] bmoi;


    // Methods
    static Char[][] fl(Byte[][] a);  // RVA: 0x66D0C0
    static Byte[][] jsu(Char[][] a);  // RVA: 0x66D100
    static Il2CppString* bdi(Byte[][] a);  // RVA: 0x66CF40
    static Il2CppString* bct(Byte[][] a);  // RVA: 0x66CDC0
    static Byte[][] gez(Char[][] a);  // RVA: 0x66D100
    static Il2CppString* wbu(Byte[][] a);  // RVA: 0x66D2C0
    static void .cctor();  // RVA: 0x66CD30
    static Char[][] iez(Byte[][] a);  // RVA: 0x66D0C0
    static Il2CppString* nxp(Byte[][] a, int32_t b, int32_t c);  // RVA: 0x66D480
    static Char[][] icy(Byte[][] a);  // RVA: 0x66D0C0
    static Byte[][] hmi(Char[][] a);  // RVA: 0x66D100
    static Il2CppString* igu(Byte[][] a);  // RVA: 0x66D140
    static Il2CppString* msq(Byte[][] a);  // RVA: 0x66D300
    static Byte[][] wbr(Char[][] a);  // RVA: 0x66D100
    static Il2CppString* kja(Byte[][] a);  // RVA: 0x66D2C0
    static Il2CppString* wbw(Byte[][] a);  // RVA: 0x66D530
    static Char[][] ch(Byte[][] a);  // RVA: 0x66D0C0
    static Byte[][] wbs(Il2CppString* a);  // RVA: 0x66D4E0
    static Byte[][] ofw(Char[][] a);  // RVA: 0x66D100
    static Char[][] wbt(Byte[][] a);  // RVA: 0x66D0C0
    static Il2CppString* wbv(Byte[][] a, int32_t b, int32_t c);  // RVA: 0x66D480
};

// Namespace: <global>
class day`1
{
public:
    System.Collections.Concurrent.ConcurrentBag<a> bmoj; // 0x0000
    System.Func<a> bmok; // 0x0000

    // Methods
    void wbz();  // RVA: 0x42E0A0
    void .ctor(System.Func<a> a);  // RVA: 0x418860
    void wby(a a);  // RVA: 0x563F30
    a wbx();  // RVA: 0x563F30
};

// Namespace: <global>
class daz
{
public:
    // Static fields
    // static Random* bmol;
    // static Random* bmom;


    // Methods
    static void myu(Char[][] a);  // RVA: 0x66F070
    static void deh(Char[][] a);  // RVA: 0x66D730
    static void wcd(Char[][] a);  // RVA: 0x66FAA0
    static int64_t glp(Random* a, int64_t b, int64_t c);  // RVA: 0x66E200
    static int32_t wca(int32_t a, int32_t b);  // RVA: 0x66F380
    static int64_t lon(int64_t a, int64_t b);  // RVA: 0x66EAF0
    static int64_t fot(Random* a, int64_t b, int64_t c);  // RVA: 0x66DE80
    static void ebq(Random* a, Char[][] b);  // RVA: 0x66DD40
    static int64_t iov(int64_t a, int64_t b);  // RVA: 0x66E580
    static void .cctor();  // RVA: 0x66D6B0
    static void lip(Byte[][] a);  // RVA: 0x66E860
    static void lxb(Char[][] a);  // RVA: 0x66ED60
    static void wcf(Random* a, Char[][] b);  // RVA: 0x66FE30
    static void hbq(Char[][] a);  // RVA: 0x66E270
    static int64_t wce(Random* a, int64_t b, int64_t c);  // RVA: 0x66FDB0
    static void wcc(Byte[][] a);  // RVA: 0x66F810
    static int64_t dpp(Random* a, int64_t b, int64_t c);  // RVA: 0x66DA40
    static void gdc(Random* a, Char[][] b);  // RVA: 0x66E160
    static void enu(Random* a, Char[][] b);  // RVA: 0x66DDE0
    static int64_t wcb(int64_t a, int64_t b);  // RVA: 0x66F5A0
    static int64_t jvv(Random* a, int64_t b, int64_t c);  // RVA: 0x66E7F0
    static void dum(Byte[][] a);  // RVA: 0x66DAB0
    static int64_t fps(int64_t a, int64_t b);  // RVA: 0x66DEF0
};

// Namespace: <global>
class dba
{
public:
    // Static fields
    // static int64_t bmon;


    // Methods
    static int64_t wcg();  // RVA: 0x6701F0
    static double wch();  // RVA: 0x670250
    static int64_t wci();  // RVA: 0x6702C0
    static double dym();  // RVA: 0x66FF40
    static int64_t cj();  // RVA: 0x66FF20
    static int64_t bcc();  // RVA: 0x66FEC0
    static int64_t jfc();  // RVA: 0x670030
    static int64_t ggj();  // RVA: 0x66FFD0
    static int64_t obq();  // RVA: 0x6701D0
    static double kvf();  // RVA: 0x670120
    static int64_t kvm();  // RVA: 0x670190
    static double jnz();  // RVA: 0x670090
    static int64_t nzy();  // RVA: 0x6701B0
    static int64_t wcj();  // RVA: 0x6702E0
    static int64_t wck();  // RVA: 0x670300
    static int64_t hgn();  // RVA: 0x670010
    static int64_t gkv();  // RVA: 0x66FFF0
    static int64_t jtu();  // RVA: 0x670100
    static int64_t ffl();  // RVA: 0x66FFB0
};

// Namespace: <global>
class dbb
{
public:
    // Static fields
    // static uint32_t bmoo;
    // static uint32_t bmop;
    // static uint32_t bmoq;
    // static uint32_t bmor;
    // static uint32_t bmos;


    // Methods
    static uint32_t izr(Stream* a, int64_t b, uint32_t c);  // RVA: 0x670620
    static uint32_t wcl(Byte[][] a, int32_t b, uint32_t c);  // RVA: 0x670930
    static uint32_t wcm(Stream* a, int64_t b, uint32_t c);  // RVA: 0x670D60
    static uint32_t fo(Stream* a, int64_t b, uint32_t c);  // RVA: 0x670320
};

// Namespace: <global>
class dbc : public dcy`1
{
public:
    // Static fields
    // static bool bmot;
    // static bool bmou;
    // static float bmov;
    // static float bmow;
    // static float bmox;
    // static float bmoy;
    // static float bmoz;
    // static float bmpa;
    // static bool bmpb;

    uint8_t pad_0000[0x30]; // 0x0000
    int64_t bmpc; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    int64_t bmpd; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    int64_t bmpe; // 0x0040

    // Methods
    void Update();  // RVA: 0x6711C0
    void wcy();  // RVA: 0x672AC0
    static void ffv();  // RVA: 0x671690
    static float wcp();  // RVA: 0x672410
    static float wcu();  // RVA: 0x6727D0
    static float wcs();  // RVA: 0x672650
    static void eez();  // RVA: 0x671460
    static void wcw(float a);  // RVA: 0x6728A0
    static void wcn();  // RVA: 0x672170
    bool uo();  // RVA: 0x671F60
    static void hey();  // RVA: 0x671930
    bool wcx();  // RVA: 0x6728B0
    static float wcv();  // RVA: 0x672890
    static float wct();  // RVA: 0x672710
    void yd();  // RVA: 0x672DC0
    void lht();  // RVA: 0x671D80
    static float wcq();  // RVA: 0x6724D0
    void wda();  // RVA: 0x672CA0
    static void liy();  // RVA: 0x671E50
    void wcz();  // RVA: 0x672B90
    void oao();  // RVA: 0x671EC0
    void .ctor();  // RVA: 0x671420
    static void wco();  // RVA: 0x6721E0
    static void frs();  // RVA: 0x671700
    void iri();  // RVA: 0x671B60
    void wdb(Scene a, LoadSceneMode b);  // RVA: 0x672D40
    void jyb();  // RVA: 0x671C70
    static float wcr();  // RVA: 0x672590
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct StorageDataType
    {
    public:
        // Static fields
        // static StorageDataType Unknown;
        // static StorageDataType SByte;
        // static StorageDataType Byte;
        // static StorageDataType Int16;
        // static StorageDataType UInt16;
        // static StorageDataType Int32;
        // static StorageDataType UInt32;
        // static StorageDataType Int64;
        // static StorageDataType UInt64;
        // static StorageDataType Char;
        // static StorageDataType Single;
        // static StorageDataType Double;
        // static StorageDataType Decimal;
        // static StorageDataType BigInteger;
        // static StorageDataType Boolean;
        // static StorageDataType String;
        // static StorageDataType DateTime;
        // static StorageDataType ByteArray;
        // static StorageDataType Vector2;
        // static StorageDataType Vector2Int;
        // static StorageDataType Vector3;
        // static StorageDataType Vector3Int;
        // static StorageDataType Vector4;
        // static StorageDataType Quaternion;
        // static StorageDataType Color;
        // static StorageDataType Color32;
        // static StorageDataType Rect;
        // static StorageDataType RectInt;
        // static StorageDataType RangeInt;
        // static StorageDataType Matrix4x4;
        // static StorageDataType Ray;
        // static StorageDataType Ray2D;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredPrefsData
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        StorageDataType type; // 0x0010
        uint8_t pad_0011[0x7]; // 0x0011
        Byte[][] data; // 0x0018
    
        // Methods
        void .ctor(StorageDataType type, Byte[][] data);  // RVA: 0x6670F0
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbd
{
public:

    // Methods
    static ObscuredPrefsData wdd(a a);  // RVA: 0x563F30
    static Byte[][] wdj(T a);  // RVA: 0x563F30
    static Byte[][] wdh(StorageDataType a, e b);  // RVA: 0x563F30
    static Color32 pp(Byte[][] a);  // RVA: 0x672EC0
    static c wdf(Byte[][] a);  // RVA: 0x563F30
    static Color32 wdc(Byte[][] a);  // RVA: 0x672EF0
    static Color32 edt(Byte[][] a);  // RVA: 0x672E90
    static f wdi(StorageDataType a, Byte[][] b);  // RVA: 0x563F30
    static d wdg(StorageDataType a, Byte[][] b);  // RVA: 0x563F30
    static b wde(ObscuredPrefsData a);  // RVA: 0x563F30
    static T wdk(Byte[][] a);  // RVA: 0x563F30
    static Color32 mlf(Byte[][] a);  // RVA: 0x672EC0
};

// Namespace: <global>
class dbe
{
public:
    // Static fields
    // static Type* bmpf;
    // static Type* bmpg;
    // static Type* bmph;
    // static Type* bmpi;
    // static Type* bmpj;
    // static Type* bmpk;
    // static Type* bmpl;
    // static Type* bmpm;
    // static Type* bmpn;
    // static Type* bmpo;
    // static Type* bmpp;
    // static Type* bmpq;
    // static Type* bmpr;
    // static Type* bmps;
    // static Type* bmpt;
    // static Type* bmpu;
    // static Type* bmpv;
    // static Type* bmpw;
    // static Type* bmpx;
    // static Type* bmpy;
    // static Type* bmpz;
    // static Type* bmqa;
    // static Type* bmqb;
    // static Type* bmqc;
    // static Type* bmqd;
    // static Type* bmqe;
    // static Type* bmqf;
    // static Type* bmqg;
    // static Type* bmqh;
    // static Type* bmqi;
    // static Type* bmqj;


    // Methods
    static StorageDataType wdl();  // RVA: 0x421580
    static void .cctor();  // RVA: 0x672F30
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    class UnsupportedDataTypeException : public Exception
    {
    public:
    
        // Methods
        void .ctor(Type* type);  // RVA: 0x667170
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class HashCheckSumModifierDelegate : public MulticastDelegate
{
public:

    // Methods
    void .ctor(Il2CppObject* object, intptr_t method);  // RVA: 0x6665A0
    Byte[][] Invoke(Il2CppString* input);  // RVA: 0x666440
    IAsyncResult* BeginInvoke(Il2CppString* input, AsyncCallback* callback, Il2CppObject* object);  // RVA: 0x666570
    Byte[][] EndInvoke(IAsyncResult* result);  // RVA: 0x666430
};

// Namespace: <global>
class dbf
{
public:
    // Static fields
    // static Il2CppString* bmqk;

    uint8_t pad_0000[0x10]; // 0x0000
    uint32_t bmql; // 0x0010
    uint8_t pad_0011[0x3]; // 0x0011
    uint32_t bmqm; // 0x0014
    uint8_t pad_0015[0x3]; // 0x0015
    HashCheckSumModifierDelegate* bmqn; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bool <bmqo>k__BackingField; // 0x0020

    // Methods
    void iiz(HashCheckSumModifierDelegate* a);  // RVA: 0x673930
    void nvz();  // RVA: 0x673810
    void eje(bool a);  // RVA: 0x673820
    void wdu(bool a);  // RVA: 0x673820
    void .ctor(uint32_t a);  // RVA: 0x6737E0
    void wdt(HashCheckSumModifierDelegate* a);  // RVA: 0x673930
    void ert(bool a);  // RVA: 0x673820
    uint32_t wdw(Il2CppString* a);  // RVA: 0x673F50
    void fdz(bool a);  // RVA: 0x673820
    static Il2CppString* wdp();  // RVA: 0x673DB0
    uint32_t kty(Il2CppString* a);  // RVA: 0x673940
    static void ffx();  // RVA: 0x673830
    uint32_t wds();  // RVA: 0x673E00
    void wdv();  // RVA: 0x673810
    static void wdn(Il2CppString* a);  // RVA: 0x673C50
    static Il2CppString* wdm();  // RVA: 0x673BA0
    static void wdo();  // RVA: 0x673CB0
    void wdr(bool a);  // RVA: 0x673DF0
    void dfn();  // RVA: 0x673810
    uint32_t mgs(Il2CppString* a);  // RVA: 0x673A70
    bool wdq();  // RVA: 0x666D40
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct DeviceLockLevel
    {
    public:
        // Static fields
        // static DeviceLockLevel None;
        // static DeviceLockLevel Soft;
        // static DeviceLockLevel Strict;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbg
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    DeviceLockLevel <bmqp>k__BackingField; // 0x0010
    DeviceLockTamperingSensitivity <bmqq>k__BackingField; // 0x0011

    // Methods
    DeviceLockLevel wdx();  // RVA: 0x667020
    void wdy(DeviceLockLevel a);  // RVA: 0x6740C0
    DeviceLockTamperingSensitivity wdz();  // RVA: 0x6740D0
    void wea(DeviceLockTamperingSensitivity a);  // RVA: 0x6740E0
    void .ctor(DeviceLockLevel a, DeviceLockTamperingSensitivity b);  // RVA: 0x674080
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct DeviceLockTamperingSensitivity
    {
    public:
        // Static fields
        // static DeviceLockTamperingSensitivity Disabled;
        // static DeviceLockTamperingSensitivity Low;
        // static DeviceLockTamperingSensitivity Normal;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

    // Namespace: CodeStage.AntiCheat.Storage
    class DeviceUniqueIdentifierException : public BackgroundThreadAccessException
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x666500
    };

    // Namespace: CodeStage.AntiCheat.Storage
    class PersistentDataPathException : public BackgroundThreadAccessException
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x667110
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbh
{
public:
    // Static fields
    // static Il2CppString* bmqr;
    // static Il2CppString* bmqs;
    // static dbf* bmqt;

    uint8_t pad_0000[0x10]; // 0x0000
    Action* bmqu; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Action* bmqv; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    dbr* <bmqw>k__BackingField; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Il2CppString* <bmqx>k__BackingField; // 0x0028

    // Methods
    void hdg();  // RVA: 0x674470
    void wec(Action* a);  // RVA: 0x6780A0
    static void .cctor();  // RVA: 0x6740F0
    ObscuredFileReadResult lia();  // RVA: 0x676720
    void jvi();  // RVA: 0x674470
    bool weg();  // RVA: 0x678280
    ObscuredFileReadResult cae();  // RVA: 0x6743D0
    Il2CppString* gvm(Il2CppString* a);  // RVA: 0x676250
    ObscuredFileHeader heu(Stream* a);  // RVA: 0x674410
    void .ctor(Il2CppString* a);  // RVA: 0x674210
    ObscuredFileWriteResult weo(Byte[][] a);  // RVA: 0x678FA0
    void .ctor(Il2CppString* a, dbr* b);  // RVA: 0x674370
    ObscuredFileWriteResult xn(Byte[][] a);  // RVA: 0x675110
    ObscuredFileHeader wen(Stream* a);  // RVA: 0x674410
    ObscuredFileReadResult wel();  // RVA: 0x6743D0
    ObscuredFileWriteResult wek(Byte[][] a);  // RVA: 0x675110
    void weq(Stream* a, DeviceLockLevel b);  // RVA: 0x6796C0
    void .ctor(dbs* a);  // RVA: 0x674170
    ObscuredFileReadResult kni();  // RVA: 0x6743D0
    void wej();  // RVA: 0x674470
    ObscuredFileHeader csd(Stream* a);  // RVA: 0x674410
    Il2CppString* hge(Il2CppString* a);  // RVA: 0x6764D0
    ObscuredFileReadResult gul();  // RVA: 0x6755E0
    void wep(Stream* a);  // RVA: 0x6795B0
    ObscuredFileReadResult lwu();  // RVA: 0x677390
    Il2CppString* wer(Il2CppString* a);  // RVA: 0x679750
    dbr* wef();  // RVA: 0x63EBD0
    void .ctor();  // RVA: 0x6742B0
    void cxh();  // RVA: 0x674470
    void web(Action* a);  // RVA: 0x678000
    ObscuredFileHeader ciw(Stream* a);  // RVA: 0x674410
    Il2CppString* fmi(Il2CppString* a);  // RVA: 0x675140
    Il2CppString* weh();  // RVA: 0x678290
    static void wei(Il2CppString* a);  // RVA: 0x6782A0
    ObscuredFileReadResult wem();  // RVA: 0x678330
    ObscuredFileWriteResult lcm(Byte[][] a);  // RVA: 0x675110
    Il2CppString* fye(Il2CppString* a);  // RVA: 0x675390
    void wee(Action* a);  // RVA: 0x6781E0
    void mef();  // RVA: 0x674470
    void wed(Action* a);  // RVA: 0x678140
    ObscuredFileReadResult dvd();  // RVA: 0x6744A0
    ObscuredFileWriteResult efu(Byte[][] a);  // RVA: 0x675110
    ObscuredFileHeader mca(Stream* a);  // RVA: 0x674410
};

// Namespace: <global>
class dbi
{
public:
    // Static fields
    // static int32_t bmqy;
    // static int32_t bmqz;
    // static Byte[][] bmra;


    // Methods
    static uint32_t nmj(Stream* a);  // RVA: 0x679F30
    static uint32_t weu(Stream* a);  // RVA: 0x679BC0
    static uint32_t wez(Byte[][] a);  // RVA: 0x67A3E0
    static void wes(Stream* a, Stream* b, dbq* c);  // RVA: 0x67A1B0
    static void wew(Stream* a, uint32_t b);  // RVA: 0x67A300
    static void pm(Stream* a, Stream* b, dbq* c);  // RVA: 0x67A1B0
    static void kqw(Stream* a, Stream* b, dbq* c);  // RVA: 0x679C40
    static void eps(Stream* a, uint32_t b);  // RVA: 0x679A30
    static void wfa(Stream* a, Stream* b, dbq* c);  // RVA: 0x67A400
    static void ojo(Stream* a, Stream* b, dbq* c);  // RVA: 0x67A1B0
    static uint32_t dlk(Byte[][] a);  // RVA: 0x679A10
    static uint32_t ijs(Stream* a);  // RVA: 0x679BC0
    static void nzh(Stream* a, uint32_t b);  // RVA: 0x679F70
    static uint32_t nij(Stream* a);  // RVA: 0x679BC0
    static void kvi(Stream* a, Stream* b, dbq* c);  // RVA: 0x679D40
    static void grx(Stream* a, Stream* b, dbq* c);  // RVA: 0x679B10
    static void wet(Stream* a, Stream* b, dbq* c);  // RVA: 0x67A260
    static uint32_t mit(Byte[][] a);  // RVA: 0x679F10
    static uint32_t wex(Stream* a);  // RVA: 0x679BC0
    static uint32_t lar(Byte[][] a);  // RVA: 0x679DF0
    static uint32_t ixc(Stream* a);  // RVA: 0x679C00
    static void odq(Stream* a, Stream* b, dbq* c);  // RVA: 0x67A050
    static void wey(Stream* a, Stream* b, dbq* c);  // RVA: 0x67A1B0
    static uint32_t wev(Stream* a);  // RVA: 0x67A270
    static void oip(Stream* a, Stream* b, dbq* c);  // RVA: 0x67A100
    static void mfl(Stream* a, Stream* b, dbq* c);  // RVA: 0x679E10
    static uint32_t djd(Stream* a);  // RVA: 0x6799D0
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileHeader
    {
    public:
        // Static fields
        // static uint8_t HeaderByte1;
        // static uint8_t HeaderByte2;
        // static uint8_t HeaderByte3;
        // static uint8_t HeaderByte4;
        // static uint8_t HeaderVersion;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t <Byte1>k__BackingField; // 0x0010
        uint8_t <Byte2>k__BackingField; // 0x0011
        uint8_t <Byte3>k__BackingField; // 0x0012
        uint8_t <Byte4>k__BackingField; // 0x0013
        uint8_t <Version>k__BackingField; // 0x0014
        ObscurationMode <ObscurationMode>k__BackingField; // 0x0015
    
        // Methods
        uint8_t get_Byte1();  // RVA: 0x666770
        void set_Byte1(uint8_t value);  // RVA: 0x666810
        uint8_t get_Byte2();  // RVA: 0x6667C0
        void set_Byte2(uint8_t value);  // RVA: 0x666820
        uint8_t get_Byte3();  // RVA: 0x6667D0
        void set_Byte3(uint8_t value);  // RVA: 0x666830
        uint8_t get_Byte4();  // RVA: 0x6667E0
        void set_Byte4(uint8_t value);  // RVA: 0x666840
        uint8_t get_Version();  // RVA: 0x666800
        void set_Version(uint8_t value);  // RVA: 0x666860
        ObscurationMode get_ObscurationMode();  // RVA: 0x6667F0
        void set_ObscurationMode(ObscurationMode value);  // RVA: 0x666850
        bool IsValid();  // RVA: 0x666790
        void wfb(Stream* a);  // RVA: 0x666870
        static void wfc(Stream* a, ObscurationMode b);  // RVA: 0x666930
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileErrorCode
    {
    public:
        // Static fields
        // static ObscuredFileErrorCode NoError;
        // static ObscuredFileErrorCode FileNotFound;
        // static ObscuredFileErrorCode FileDamaged;
        // static ObscuredFileErrorCode DataIsNotLocked;
        // static ObscuredFileErrorCode NotInitialized;
        // static ObscuredFileErrorCode OtherException;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileError
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        ObscuredFileErrorCode <ErrorCode>k__BackingField; // 0x0010
        uint8_t pad_0011[0x7]; // 0x0011
        Exception* <Exception>k__BackingField; // 0x0018
    
        // Methods
        ObscuredFileErrorCode get_ErrorCode();  // RVA: 0x666770
        Exception* get_Exception();  // RVA: 0x666780
        void .ctor(ObscuredFileErrorCode code);  // RVA: 0x666750
        void .ctor(Exception* exception);  // RVA: 0x666740
        Il2CppString* ToString();  // RVA: 0x666660
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileReadResult
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        Byte[][] <Data>k__BackingField; // 0x0010
        uint8_t pad_0011[0x7]; // 0x0011
        bool <DataIsNotGenuine>k__BackingField; // 0x0018
        bool <DataFromAnotherDevice>k__BackingField; // 0x0019
        uint8_t pad_001A[0x6]; // 0x001A
        ObscuredFileError <Error>k__BackingField; // 0x0020
        uint8_t pad_0021[0xF]; // 0x0021
        bool <IsValid>k__BackingField; // 0x0030
    
        // Methods
        bool wfd();  // RVA: 0x666D50
        Byte[][] get_Data();  // RVA: 0x666D20
        bool wfe();  // RVA: 0x666D80
        bool get_DataIsNotGenuine();  // RVA: 0x666D10
        bool get_DataFromAnotherDevice();  // RVA: 0x666D00
        ObscuredFileError get_Error();  // RVA: 0x666D30
        bool get_IsValid();  // RVA: 0x666D40
        void .ctor(Byte[][] data, bool dataIsNotGenuine, bool dataFromAnotherDevice);  // RVA: 0x666CB0
        void .ctor(ObscuredFileError error);  // RVA: 0x666C60
        static ObscuredFileReadResult wff(Exception* a);  // RVA: 0x666D90
        static ObscuredFileReadResult wfg(ObscuredFileErrorCode a);  // RVA: 0x666E10
        Il2CppString* ToString();  // RVA: 0x6669F0
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileWriteResult
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        ObscuredFileError <Error>k__BackingField; // 0x0010
        uint8_t pad_0011[0xF]; // 0x0011
        bool <IsValid>k__BackingField; // 0x0020
    
        // Methods
        bool wfh();  // RVA: 0x667030
        ObscuredFileError get_Error();  // RVA: 0x667010
        bool get_IsValid();  // RVA: 0x667020
        void .ctor(ObscuredFileErrorCode result);  // RVA: 0x666FC0
        void .ctor(ObscuredFileError error);  // RVA: 0x666F90
        static ObscuredFileWriteResult wfi(Exception* a);  // RVA: 0x667040
        static ObscuredFileWriteResult wfj(ObscuredFileErrorCode a);  // RVA: 0x667090
        Il2CppString* ToString();  // RVA: 0x666E90
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbj
{
public:
    // Static fields
    // static Il2CppString* bmrb;
    // static Il2CppString* bmrc;
    // static Action* bmrd;
    // static Action* bmre;
    // static dbh* bmrf;
    // static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> bmrg;
    // static Il2CppObject* bmrh;
    // static bool <bmri>k__BackingField;
    // static bool <bmrj>k__BackingField;
    // static bool <bmrk>k__BackingField;
    // static ObscuredFileReadResult <bmrl>k__BackingField;
    // static ObscuredFileWriteResult <bmrm>k__BackingField;
    // static dbm* <bmrn>k__BackingField;


    // Methods
    static ObscuredVector2 bay(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x67AB60
    static void whx(dbm* a);  // RVA: 0x6855E0
    static void bav(Il2CppString* a, dbr* b, bool c);  // RVA: 0x67A920
    static ObscuredDouble cdh(Il2CppString* a, ObscuredDouble b);  // RVA: 0x67B560
    static bool wig(Il2CppString* a);  // RVA: 0x686160
    static ObscuredVector2Int whb(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x684990
    static ObscuredDateTime wgk(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x683C10
    static ObscuredShort cvm(Il2CppString* a, ObscuredShort b);  // RVA: 0x67BBD0
    static void bxm(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x67B2F0
    static void wft(Il2CppString* a, ObscuredGuid b);  // RVA: 0x6831E0
    static ObscuredInt myu(Il2CppString* a, ObscuredInt b);  // RVA: 0x681B20
    static void oce(Il2CppString* a, ObscuredUShort b);  // RVA: 0x6824D0
    static ObscuredFloat oph(Il2CppString* a, ObscuredFloat b);  // RVA: 0x6825E0
    static void wia(Il2CppString* a, bool b);  // RVA: 0x685820
    static void wfp(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x682F40
    static void wfs(Il2CppString* a, ObscuredFloat b);  // RVA: 0x683140
    static dbh* wim(Il2CppString* a, dbr* b);  // RVA: 0x686540
    static ObscuredULong hkg(Il2CppString* a, ObscuredULong b);  // RVA: 0x67EE70
    static void wgc(Il2CppString* a, ObscuredUShort b);  // RVA: 0x6836F0
    static void whq(bool a);  // RVA: 0x6852F0
    static void .cctor();  // RVA: 0x67A8A0
    static void whv(ObscuredFileWriteResult a);  // RVA: 0x685510
    static void nwq(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x682150
    static ObscuredBool wgh(Il2CppString* a, ObscuredBool b);  // RVA: 0x683A10
    static void kba(Il2CppString* a, ObscuredBool b);  // RVA: 0x680480
    static ObscuredChar wgj(Il2CppString* a, ObscuredChar b);  // RVA: 0x683B50
    static void wfu(Il2CppString* a, ObscuredInt b);  // RVA: 0x683290
    static void czk();  // RVA: 0x67BD90
    static ObscuredDateTimeOffset hrj(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x67F0E0
    static ObscuredUInt mzs(Il2CppString* a, ObscuredUInt b);  // RVA: 0x681BD0
    static ObscuredString* ieq(Il2CppString* a, ObscuredString* b);  // RVA: 0x67F7B0
    static ObscuredFloat wgp(Il2CppString* a, ObscuredFloat b);  // RVA: 0x6840A0
    static void bff(Il2CppString* a, bool b);  // RVA: 0x67AC30
    static bool bup(Il2CppString* a);  // RVA: 0x67B270
    static ObscuredFileReadResult whs();  // RVA: 0x6853A0
    static void gyp(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x67E8A0
    static c wir(Il2CppString* a, c b);  // RVA: 0x563F30
    static void erf();  // RVA: 0x67CE30
    static ObscuredString* wgw(Il2CppString* a, ObscuredString* b);  // RVA: 0x684610
    static void iha();  // RVA: 0x67F830
    static void ja(Il2CppString* a, ObscuredByte b);  // RVA: 0x67FCA0
    static ObscuredDouble wgo(Il2CppString* a, ObscuredDouble b);  // RVA: 0x683FC0
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> cnb();  // RVA: 0x67B700
    static ObscuredVector3 eoi(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x67CD30
    static ObscuredVector3 whc(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x684A50
    static ObscuredVector3Int whd(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x684B50
    static void wga(Il2CppString* a, ObscuredUInt b);  // RVA: 0x6835E0
    static void win();  // RVA: 0x686660
    static void wgf(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x6838B0
    static void wge(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x683820
    static dbr* whi();  // RVA: 0x685030
    static bool whj();  // RVA: 0x685080
    static void fwn(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x67D8E0
    static ObscuredDecimal gkz(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x67DE10
    static bool whm();  // RVA: 0x685190
    static ObscuredString* env(Il2CppString* a, ObscuredString* b);  // RVA: 0x67CBC0
    static void who(bool a);  // RVA: 0x685240
    static bool hyw();  // RVA: 0x67F290
    static void gtq(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x67E350
    static ObscuredSByte wgu(Il2CppString* a, ObscuredSByte b);  // RVA: 0x6844D0
    static void wht(ObscuredFileReadResult a);  // RVA: 0x685410
    static ObscuredDecimal mky(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x6815A0
    static void jsb(Il2CppString* a, ObscuredFloat b);  // RVA: 0x6801F0
    static ObscuredVector2 haa(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x67E950
    static ObscuredDecimal iak(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x67F630
    static bool gvu();  // RVA: 0x67E400
    static void lou(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x680CA0
    static void lrh();  // RVA: 0x680E60
    static void wfw(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x6833A0
    static bool nvr(Il2CppString* a);  // RVA: 0x682050
    static void wic(Il2CppString* a, dbr* b, bool c);  // RVA: 0x685950
    static void gso(Il2CppString* a, ObscuredGuid b);  // RVA: 0x67E2A0
    static ObscuredDecimal wgm(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x683DC0
    static void p(Il2CppString* a, dbr* b, bool c);  // RVA: 0x6828C0
    static ObscuredQuaternion wgt(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x6843D0
    static System.Collections.Generic.ICollection<System.String> wih();  // RVA: 0x6861E0
    static void lqm(Il2CppString* a, ObscuredByte b);  // RVA: 0x680DE0
    static ObscuredULong hrv(Il2CppString* a, ObscuredULong b);  // RVA: 0x67F1D0
    static void eev(Il2CppString* a, ObscuredByte b);  // RVA: 0x67C680
    static void gqp(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x67E010
    static void wfm(Il2CppString* a, ObscuredChar b);  // RVA: 0x682D70
    static void dpi(Il2CppString* a, ObscuredDouble b);  // RVA: 0x67C4B0
    static ObscuredBigInteger bt(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x67AF90
    static ObscuredUInt wgx(Il2CppString* a, ObscuredUInt b);  // RVA: 0x684690
    static void hex(Il2CppString* a, ObscuredGuid b);  // RVA: 0x67EAE0
    static void lpe(Il2CppString* a, ObscuredShort b);  // RVA: 0x680D50
    static void mwt(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x681970
    static void ftz(Il2CppString* a, ObscuredGuid b);  // RVA: 0x67D7C0
    static bool whl();  // RVA: 0x685130
    static void dxs(Il2CppString* a, ObscuredBool b);  // RVA: 0x67C5F0
    static void emz(Il2CppString* a, dbr* b, bool c);  // RVA: 0x67C980
    static void nga(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x681D20
    static bool myc(Il2CppString* a);  // RVA: 0x681AA0
    static void whf(Action* a);  // RVA: 0x684D40
    static void wif(bool a);  // RVA: 0x686080
    static bool Save();  // RVA: 0x67A500
    static ObscuredFileReadResult wit();  // RVA: 0x686D70
    static void whe(Action* a);  // RVA: 0x684C50
    static void npt(Il2CppString* a, ObscuredUInt b);  // RVA: 0x681E90
    static void lts(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x681140
    static void whk(bool a);  // RVA: 0x6850D0
    static void qp(Il2CppString* a, ObscuredDouble b);  // RVA: 0x682BC0
    static void wij();  // RVA: 0x686350
    static ObscuredByte fbl(Il2CppString* a, ObscuredByte b);  // RVA: 0x67D1A0
    static dbh* why();  // RVA: 0x685650
    static void lue();  // RVA: 0x6811F0
    static ObscuredFileReadResult bte();  // RVA: 0x67B090
    static void nrs(Il2CppString* a, ObscuredUShort b);  // RVA: 0x681F10
    static ObscuredVector3 lfc(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x680AB0
    static void wie();  // RVA: 0x685D50
    static ObscuredChar bzz(Il2CppString* a, ObscuredChar b);  // RVA: 0x67B4A0
    static ObscuredULong wgy(Il2CppString* a, ObscuredULong b);  // RVA: 0x684740
    static ObscuredUShort fev(Il2CppString* a, ObscuredUShort b);  // RVA: 0x67D220
    static bool fqu();  // RVA: 0x67D3A0
    static void wfy(Il2CppString* a, ObscuredShort b);  // RVA: 0x6834D0
    static bool whp();  // RVA: 0x6852A0
    static ObscuredChar hkp(Il2CppString* a, ObscuredChar b);  // RVA: 0x67EF30
    static void lyu(Il2CppString* a);  // RVA: 0x6813B0
    static void mnh(bool a);  // RVA: 0x6816A0
    static void elw();  // RVA: 0x67C700
    static ObscuredInt wgr(Il2CppString* a, ObscuredInt b);  // RVA: 0x684260
    static ObscuredByte wgi(Il2CppString* a, ObscuredByte b);  // RVA: 0x683AD0
    static ObscuredFileWriteResult gky();  // RVA: 0x67DC20
    static void ndc(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x681C80
    static void wfk(Il2CppString* a, ObscuredBool b);  // RVA: 0x682C60
    static ObscuredQuaternion fz(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x67DA60
    static ObscuredFileWriteResult wiu(Byte[][] a);  // RVA: 0x686F50
    static bool whn();  // RVA: 0x6851F0
    static void dvx(Il2CppString* a, ObscuredDouble b);  // RVA: 0x67C550
    static void lum(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x681260
    static ObscuredDateTime ngn(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x681DD0
    static void whz(bool a);  // RVA: 0x685760
    static ObscuredVector2 fyy(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x67D990
    static void kpo(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x680A00
    static void wgb(Il2CppString* a, ObscuredULong b);  // RVA: 0x683660
    static void bgr(Il2CppString* a, dbr* b, bool c);  // RVA: 0x67ACC0
    static void wid();  // RVA: 0x685B90
    static ObscuredByte icf(Il2CppString* a, ObscuredByte b);  // RVA: 0x67F730
    static ObscuredByte msb(Il2CppString* a, ObscuredByte b);  // RVA: 0x681840
    static void wfn(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x682E00
    static ObscuredFileWriteResult wiq();  // RVA: 0x686B80
    static ObscuredFileWriteResult otk(Byte[][] a);  // RVA: 0x6826A0
    static ObscuredDateTime grj(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x67E0A0
    static void wfl(Il2CppString* a, ObscuredByte b);  // RVA: 0x682CF0
    static void mpg(bool a);  // RVA: 0x681780
    static ObscuredBigInteger wgn(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x683EC0
    static void ctc(Il2CppString* a, ObscuredShort b);  // RVA: 0x67BB40
    static void wii(Il2CppString* a);  // RVA: 0x686260
    static ObscuredBigInteger byg(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x67B3A0
    static ObscuredBigInteger hgc(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x67EB90
    static void wfx(Il2CppString* a, ObscuredSByte b);  // RVA: 0x683450
    static void eoh(Il2CppString* a);  // RVA: 0x67CC40
    static void ijw(Il2CppString* a, bool b);  // RVA: 0x67FB60
    static void dnp();  // RVA: 0x67C180
    static Il2CppString* whr();  // RVA: 0x685350
    static void fsp(Il2CppString* a, ObscuredInt b);  // RVA: 0x67D740
    static void wfq(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x682FF0
    static void wis(Il2CppString* a, d b);  // RVA: 0x563F30
    static ObscuredInt kgw(Il2CppString* a, ObscuredInt b);  // RVA: 0x680950
    static ObscuredQuaternion md(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x6814A0
    static ObscuredFileWriteResult nys();  // RVA: 0x6822E0
    static void nvf(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x681FA0
    static ObscuredUShort qb(Il2CppString* a, ObscuredUShort b);  // RVA: 0x682B00
    static void nxz(bool a);  // RVA: 0x682200
    static void wgd(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x683780
    static void gsi(Il2CppString* a, ObscuredSByte b);  // RVA: 0x67E220
    static bool lgx(Il2CppString* a);  // RVA: 0x680BB0
    static void wik(Il2CppString* a, a b);  // RVA: 0x563F30
    static ObscuredFileWriteResult whu();  // RVA: 0x6854A0
    static void oez(Il2CppString* a, ObscuredSByte b);  // RVA: 0x682560
    static dbm* whw();  // RVA: 0x685590
    static ObscuredGuid wgq(Il2CppString* a, ObscuredGuid b);  // RVA: 0x684160
    static void etf(Il2CppString* a, ObscuredChar b);  // RVA: 0x67CEA0
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> kfn();  // RVA: 0x680510
    static ObscuredULong gen(Il2CppString* a, ObscuredULong b);  // RVA: 0x67DB60
    static void xr(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x687170
    static void wfv(Il2CppString* a, ObscuredLong b);  // RVA: 0x683310
    static ObscuredVector3 gpk(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x67DF10
    static ObscuredFloat grz(Il2CppString* a, ObscuredFloat b);  // RVA: 0x67E160
    static ObscuredVector3 gyd(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x67E7A0
    static System.Collections.Generic.ICollection<System.String> jdo();  // RVA: 0x67FD20
    static void ila(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x67FBF0
    static ObscuredVector2 wha(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x6848C0
    static void mxe(Il2CppString* a, ObscuredULong b);  // RVA: 0x681A10
    static void whg(Action* a);  // RVA: 0x684E30
    static void whh(Action* a);  // RVA: 0x684F30
    static void evk(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x67CF30
    static ObscuredFileWriteResult jwm();  // RVA: 0x680290
    static ObscuredDateTimeOffset wgl(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x683CD0
    static void wfr(Il2CppString* a, ObscuredDouble b);  // RVA: 0x6830A0
    static void lxk(Il2CppString* a, ObscuredDouble b);  // RVA: 0x681310
    static void jdz();  // RVA: 0x67FDA0
    static ObscuredUShort fqi(Il2CppString* a, ObscuredUShort b);  // RVA: 0x67D2E0
    static b wil(Il2CppString* a, b b);  // RVA: 0x563F30
    static ObscuredLong joc(Il2CppString* a, ObscuredLong b);  // RVA: 0x6800C0
    static ObscuredUShort ezs(Il2CppString* a, ObscuredUShort b);  // RVA: 0x67D0E0
    static void wio();  // RVA: 0x6866D0
    static void ltp(Il2CppString* a);  // RVA: 0x681050
    static void hqf(Il2CppString* a);  // RVA: 0x67EFF0
    static ObscuredByte nwg(Il2CppString* a, ObscuredByte b);  // RVA: 0x6820D0
    static void mte(Il2CppString* a, ObscuredGuid b);  // RVA: 0x6818C0
    static ObscuredBool hdb(Il2CppString* a, ObscuredBool b);  // RVA: 0x67EA20
    static void lhx();  // RVA: 0x680C30
    static void wfz(Il2CppString* a, ObscuredString* b);  // RVA: 0x683560
    static ObscuredLong wgs(Il2CppString* a, ObscuredLong b);  // RVA: 0x684310
    static ObscuredBigInteger cwa(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x67BC90
    static void wib(dbr* a, bool b);  // RVA: 0x6858B0
    static dbh* ezc(Il2CppString* a, dbr* b);  // RVA: 0x67CFC0
    static ObscuredShort wgv(Il2CppString* a, ObscuredShort b);  // RVA: 0x684550
    static void jji();  // RVA: 0x680050
    static ObscuredShort czl(Il2CppString* a, ObscuredShort b);  // RVA: 0x67C0C0
    static void wgg(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x683960
    static ObscuredFloat cek(Il2CppString* a, ObscuredFloat b);  // RVA: 0x67B640
    static void emw(Il2CppString* a, ObscuredShort b);  // RVA: 0x67C8F0
    static ObscuredUShort wgz(Il2CppString* a, ObscuredUShort b);  // RVA: 0x684800
    static ObscuredULong jig(Il2CppString* a, ObscuredULong b);  // RVA: 0x67FF90
    static void fvz();  // RVA: 0x67D870
    static void bqg(Il2CppString* a, ObscuredULong b);  // RVA: 0x67AF00
    static void jqh();  // RVA: 0x680180
    static void wfo(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x682E90
    static ObscuredFileReadResult hja();  // RVA: 0x67EC90
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wip();  // RVA: 0x686740
};

// Namespace: <global>
class dbk
{
public:
    // Static fields
    // static bool bmro;


    // Methods
    static void wix(bool a);  // RVA: 0x687220
    static void wiy(bool a);  // RVA: 0x687230
    static void eso(bool a);  // RVA: 0x687230
    static void wja();  // RVA: 0x6878E0
    static void wiz(bool a);  // RVA: 0x6876A0
    static void wiv();  // RVA: 0x687240
    static void dti(bool a);  // RVA: 0x687220
    static void mxy(bool a);  // RVA: 0x687220
    static void eum(bool a);  // RVA: 0x687230
    static void ifz(bool a);  // RVA: 0x687230
    static bool wiw();  // RVA: 0x687680
    static void jtc(bool a);  // RVA: 0x687220
};

// Namespace: <global>
class dbl
{
public:

    // Methods
    static Byte[][] ns(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a, dbm* b);  // RVA: 0x687B50
    static dbo* fky(dbm* a);  // RVA: 0x687A40
    static dbo* wjf(dbm* a);  // RVA: 0x687A40
    static dbo* bmr(dbm* a);  // RVA: 0x687A40
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> mma(Byte[][] a, dbm* b);  // RVA: 0x687AE0
    static Byte[][] nud(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a, dbm* b);  // RVA: 0x687BC0
    static b wjc(ObscuredPrefsData a, dbm* b);  // RVA: 0x563F30
    static Byte[][] wjd(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a, dbm* b);  // RVA: 0x687C30
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> dik(Byte[][] a, dbm* b);  // RVA: 0x687A70
    static dbo* lro(dbm* a);  // RVA: 0x687A40
    static ObscuredPrefsData wjb(a a, dbm* b);  // RVA: 0x563F30
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wje(Byte[][] a, dbm* b);  // RVA: 0x687CA0
    static dbo* iey(dbm* a);  // RVA: 0x687A40
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct ACTkSerializationKind
    {
    public:
        // Static fields
        // static ACTkSerializationKind Binary;
    
        uint8_t pad_0000[0x10]; // 0x0000
        int32_t value__; // 0x0010
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbm
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    ACTkSerializationKind <bmrp>k__BackingField; // 0x0010

    // Methods
    ACTkSerializationKind wjg();  // RVA: 0x666240
    void .ctor(ACTkSerializationKind a);  // RVA: 0x6737E0
};

// Namespace: <global>
class dbn
{
public:
    // Static fields
    // static uint8_t bmrq;
    // static dbn* bmrr;


    // Methods
    static dbo* hmj();  // RVA: 0x687FD0
    static dbo* wjh();  // RVA: 0x688210
    System.ValueTuple<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wjn(BinaryReader* a);  // RVA: 0x688AA0
    static dbo* hcc();  // RVA: 0x687F40
    System.ValueTuple<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> ljf(BinaryReader* a);  // RVA: 0x688060
    void wjm(BinaryWriter* a, Il2CppString* b, ObscuredPrefsData c);  // RVA: 0x688170
    b wjj(ObscuredPrefsData a);  // RVA: 0x563F30
    void .ctor();  // RVA: 0x6284D0
    static dbo* dku();  // RVA: 0x687D10
    System.ValueTuple<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> fyz(BinaryReader* a);  // RVA: 0x687E30
    void loe(BinaryWriter* a, Il2CppString* b, ObscuredPrefsData c);  // RVA: 0x688170
    Byte[][] wjk(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a);  // RVA: 0x6882A0
    ObscuredPrefsData wji(a a);  // RVA: 0x563F30
    static dbo* dzg();  // RVA: 0x687DA0
    System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wjl(Byte[][] a);  // RVA: 0x688690
};

// Namespace: <global>
class dbo
{
public:

    // Methods
    ObscuredPrefsData wji(a a);  // RVA: 0x563F30
    b wjj(ObscuredPrefsData a);  // RVA: 0x563F30
    Byte[][] wjk(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a);  // RVA: 0x4196F0
    System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wjl(Byte[][] a);  // RVA: 0x4196F0
};

// Namespace: <global>
class dbp
{
public:
    // Static fields
    // static dbp* bmrs;


    // Methods
    static dbo* wjo();  // RVA: 0x688C30
    void .ctor();  // RVA: 0x6284D0
    Byte[][] wjk(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a);  // RVA: 0x688BB0
    System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wjl(Byte[][] a);  // RVA: 0x688BF0
    b wjj(ObscuredPrefsData a);  // RVA: 0x563F30
    ObscuredPrefsData wji(a a);  // RVA: 0x563F30
};

