// ============================================================
// Image: Assembly-CSharp.dll
// ============================================================

// Namespace: <global>
class b : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Unit* OwnerUnit; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Animator* Animatior; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    EUNITSTATE bawk; // 0x0030

    // Methods
    void Update();  // RVA: 0x635AE0
    void kjg(Il2CppString* a);  // RVA: 0x7FBF30
    void nlu(float a);  // RVA: 0x7FC010
    void Awake();  // RVA: 0x7FBE70
    void .ctor();  // RVA: 0x6287A0
    void dtn(float a);  // RVA: 0x7FC010
    void hsb(Il2CppString* a);  // RVA: 0x7FBF30
    void kgo(Il2CppString* a);  // RVA: 0x7FBF30
    void dtm(EUNITSTATE a);  // RVA: 0x417970
    void cdv();  // RVA: 0x7FBF50
    void dto(Il2CppString* a);  // RVA: 0x7FBF30
    void bgy(Il2CppString* a);  // RVA: 0x7FBF30
};

// Namespace: <global>
class c : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Action* OnACTIVE; // 0x0020

    // Methods
    void dtq();  // RVA: 0x803950
    void mpn();  // RVA: 0x803950
    void bro();  // RVA: 0x803950
    void bqj(Action* a);  // RVA: 0x8038B0
    void ejw(Action* a);  // RVA: 0x803A10
    void mfl(Action* a);  // RVA: 0x803B50
    void isa(Action* a);  // RVA: 0x803AB0
    void dtp(Action* a);  // RVA: 0x803970
    void .ctor();  // RVA: 0x6287A0
};

// Namespace: <global>
class g
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bawl; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* bawm; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    FlickerController* bawn; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float bawo; // 0x0028

    // Methods
    void .ctor(int32_t a);  // RVA: 0x6737E0
    void dtr();  // RVA: 0x635AE0
    bool MoveNext();  // RVA: 0x803BF0
    Il2CppObject* dts();  // RVA: 0x688DE0
    void dtt();  // RVA: 0x803D30
    Il2CppObject* dtu();  // RVA: 0x688DE0
};

// Namespace: <global>
class FlickerController : public MonoBehaviour
{
public:
    // Static fields
    // static MaterialPropertyBlock* bawp;
    // static int32_t bawq;

    uint8_t pad_0000[0x20]; // 0x0000
    SpriteRenderer* m_spriteRenderer; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float m_targetValue; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    float m_flickTime; // 0x002C
    uint8_t pad_002D[0x3]; // 0x002D
    Coroutine* bawr; // 0x0030

    // Methods
    void Awake();  // RVA: 0x7F13E0
    void dtv();  // RVA: 0x7F1520
    void dtw();  // RVA: 0x7F15C0
    IEnumerator* dtx();  // RVA: 0x7F1610
    void dty(float a);  // RVA: 0x7F1680
    void .ctor();  // RVA: 0x6287A0
    static void .cctor();  // RVA: 0x7F14B0
};

// Namespace: <global>
class h : public MonoBehaviour
{
public:

    // Methods
    void Start();  // RVA: 0x635AE0
    void kaw();  // RVA: 0x635AE0
    void bck();  // RVA: 0x635AE0
    void cnm();  // RVA: 0x635AE0
    void Update();  // RVA: 0x635AE0
    void iuw();  // RVA: 0x635AE0
    void .ctor();  // RVA: 0x6287A0
};

// Namespace: <global>
class k : public b
{
public:

    // Methods
    void Update();  // RVA: 0x803D70
    void dtm(EUNITSTATE a);  // RVA: 0x803E40
    void .ctor();  // RVA: 0x6287A0
};

// Namespace: <global>
class m : public MonoBehaviour
{
public:

    // Methods
    void .ctor();  // RVA: 0x6287A0
    void Update();  // RVA: 0x635AE0
    void Start();  // RVA: 0x635AE0
    void xc();  // RVA: 0x635AE0
};

// Namespace: <global>
class HpBar : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    RectTransform* rect_m; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Slider* slider; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Image* image_Fillarea; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Unit* unit_Attach; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Vector3 monsterOffset; // 0x0040
    uint8_t pad_0041[0xB]; // 0x0041
    Vector3 heroOffset; // 0x004C
    uint8_t pad_004D[0xB]; // 0x004D
    Color color_Monster; // 0x0058
    uint8_t pad_0059[0xF]; // 0x0059
    Color color_Hero; // 0x0068

    // Methods
    void dtz(Unit* a);  // RVA: 0x7F2C20
    void Update();  // RVA: 0x7F2B20
    void dua();  // RVA: 0x7F2D50
    void dub(float a);  // RVA: 0x7F2E80
    void duc();  // RVA: 0x7F2ED0
    void .ctor();  // RVA: 0x7F2B70
};

// Namespace: <global>
class n : public b
{
public:

    // Methods
    void dtm(EUNITSTATE a);  // RVA: 0x804000
    void .ctor();  // RVA: 0x6287A0
};

// Namespace: <global>
struct EUNITSTATE
{
public:
    // Static fields
    // static EUNITSTATE NONE;
    // static EUNITSTATE IDLE;
    // static EUNITSTATE MOVE;
    // static EUNITSTATE RETURN_TO_POSITION;
    // static EUNITSTATE ATTACK;
    // static EUNITSTATE REVIVE;
    // static EUNITSTATE DIE;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
struct EATTACKSTATE
{
public:
    // Static fields
    // static EATTACKSTATE PREDELAY;
    // static EATTACKSTATE ACTIONTIME;
    // static EATTACKSTATE POSTDELAY;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
struct TextDisplayPosition
{
public:
    // Static fields
    // static TextDisplayPosition Center;
    // static TextDisplayPosition Top;
    // static TextDisplayPosition Bottom;
    // static TextDisplayPosition TopOffset;
    // static TextDisplayPosition CenterUp;
    // static TextDisplayPosition CenterDown;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
class o
{
public:
    // Static fields
    // static intptr_t baws;
    // static int32_t bawt;
    // static int32_t bawu;


    // Methods
    static void .cctor();  // RVA: 0x8044F0
    static int32_t RegDeleteValue(intptr_t hKey, Il2CppString* lpValueName);  // RVA: 0x804290
    static int32_t RegCloseKey(intptr_t hKey);  // RVA: 0x804210
    void .ctor();  // RVA: 0x6284D0
    static uint32_t GetModuleFileName(intptr_t hModule, StringBuilder* lpFilename, int32_t nSize);  // RVA: 0x804140
    static int32_t RegOpenKeyEx(intptr_t hKey, Il2CppString* lpSubKey, int32_t ulOptions, int32_t samDesired, intptr_t phkResult);  // RVA: 0x804330
    static void dud(Il2CppString* a, bool b);  // RVA: 0x804550
    static int32_t RegSetValueEx(intptr_t hKey, Il2CppString* lpValueName, int32_t Reserved, int32_t dwType, Il2CppString* lpData, int32_t cbData);  // RVA: 0x804400
};

// Namespace: <global>
class MonitorEnumDelegate : public MulticastDelegate
{
public:

    // Methods
    void .ctor(Il2CppObject* object, intptr_t method);  // RVA: 0x7F3900
    bool Invoke(intptr_t hMonitor, intptr_t hdcMonitor, intptr_t lprcMonitor, intptr_t dwData);  // RVA: 0x7F38E0
    IAsyncResult* BeginInvoke(intptr_t hMonitor, intptr_t hdcMonitor, intptr_t lprcMonitor, intptr_t dwData, AsyncCallback* callback, Il2CppObject* object);  // RVA: 0x7F3800
    bool EndInvoke(IAsyncResult* result);  // RVA: 0x7F38B0
};

// Namespace: <global>
class p : public MonoBehaviour
{
public:
    // Static fields
    // static uint32_t bawv;
    // static int32_t baww;
    // static int32_t bawx;
    // static RECT bawy;


    // Methods
    static bool GetMonitorInfo(intptr_t hMonitor, MONITORINFO lpmi);  // RVA: 0x804AD0
    static bool GetWindowRect(intptr_t hwnd, RECT rect);  // RVA: 0x804B60
    static intptr_t MonitorFromWindow(intptr_t hwnd, uint32_t dwFlags);  // RVA: 0x804BF0
    void OnApplicationFocus(bool hasFocus);  // RVA: 0x804C80
    static bool EnumDisplayMonitors(intptr_t hdc, intptr_t lprcClip, MonitorEnumDelegate* lpfnEnum, intptr_t dwData);  // RVA: 0x804A10
    void due();  // RVA: 0x804D60
    void blk();  // RVA: 0x804C90
    static bool duf(intptr_t a, intptr_t b, intptr_t c, intptr_t d);  // RVA: 0x804F40
    void ghz(bool hasFocus);  // RVA: 0x804C80
    void mmk();  // RVA: 0x805400
    void .ctor();  // RVA: 0x6287A0
    void dug();  // RVA: 0x805150
    void fzi();  // RVA: 0x805220
    void ops();  // RVA: 0x8056B0
    void nnt();  // RVA: 0x8055E0
};

// Namespace: <global>
class BoxEffectController : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    System.Collections.Generic.List<SpriteAnimation_Image> animationLists; // 0x0020

    // Methods
    void duh(int32_t a);  // RVA: 0x7F0940
    bool dui();  // RVA: 0x7F0B40
    void OnDisable();  // RVA: 0x7F0850
    void .ctor();  // RVA: 0x6287A0
};

// Namespace: <global>
class q : public MonoBehaviour
{
public:

    // Methods
    void OnPointerDown(PointerEventData* eventData);  // RVA: 0x635AE0
    void OnPointerUp(PointerEventData* eventData);  // RVA: 0x635AE0
    void .ctor();  // RVA: 0x6287A0
};

// Namespace: <global>
class ItemSlotDirectMovePreview : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    RectTransform* RectTransform; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Image* m_hoverTargetImage; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Sprite* m_moveToTradingStashIcon; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Sprite* m_moveToCubeIcon; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Sprite* m_moveToInventoryIcon; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    Sprite* m_moveToStashIcon; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Sprite* m_moveToGearIcon; // 0x0050

    // Methods
    void duj(ESlotType a, ESlotType b);  // RVA: 0x7F2EF0
    void .ctor();  // RVA: 0x6287A0
};

// Namespace: <global>
struct <DelayedAnimation>d__7
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    SelectHeroEffectController* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x7F85F0
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7F85E0
};

// Namespace: <global>
class SelectHeroEffectController : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    SpriteAnimation_Image* spriteAnimationImage; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    SpriteAnimation_Image[][] effectObjects; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    int32_t targetFrame; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float delay; // 0x0034

    // Methods
    void Awake();  // RVA: 0x7F3A90
    void OnDestroy();  // RVA: 0x7F3B90
    void duk(int32_t a);  // RVA: 0x7F3CD0
    UniTaskVoid dul();  // RVA: 0x7F3D90
    void dum();  // RVA: 0x7F3E20
    void .ctor();  // RVA: 0x6287A0
};

// Namespace: <global>
struct <DelayedAnimation>d__9
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    SelectHeroShakeFlashController* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x7F8850
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7F85E0
};

// Namespace: <global>
class SelectHeroShakeFlashController : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    SpriteAnimation_Image* spriteAnimationImage; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    int32_t targetFrame; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    SelectHeroOption* selectHeroOption; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    bool hasFlash; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Il2CppString* otherAnimKey; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    bool hasShake; // 0x0048
    uint8_t pad_0049[0x3]; // 0x0049
    float delay; // 0x004C

    // Methods
    void Awake();  // RVA: 0x7F4060
    void OnDestroy();  // RVA: 0x7F4160
    UniTaskVoid dun();  // RVA: 0x7F4400
    void Play(int32_t frame);  // RVA: 0x7F42A0
    void Play();  // RVA: 0x7F4360
    void .ctor();  // RVA: 0x6287A0
};

// Namespace: <global>
class r
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    SkillPointAnimationController* bawz; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    RectTransform* baxa; // 0x0018

    // Methods
    void .ctor();  // RVA: 0x6284D0
    void duo();  // RVA: 0x805890
    void ggj();  // RVA: 0x805890
    void kbc();  // RVA: 0x805890
};

// Namespace: <global>
class SkillPointAnimationController : public MonoBehaviour
{
public:
    // Static fields
    // static Color baxb;
    // static Color baxc;

    uint8_t pad_0000[0x20]; // 0x0000
    Image* m_sliderBarCover; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    GameObject* prefab; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Transform* poolHolder; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Transform[][] m_iconTargetPos; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    float m_animDurationTime; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    System.Collections.Generic.Queue<UnityEngine.RectTransform> baxd; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    System.Collections.Generic.List<UnityEngine.RectTransform> baxe; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    Tweener* baxf; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    ActiveSkillSlotDetail* baxg; // 0x0060

    // Methods
    void Awake();  // RVA: 0x7F4490
    void dup();  // RVA: 0x7F4840
    void duq();  // RVA: 0x7F4930
    void dur(bool a);  // RVA: 0x7F4B50
    void dus();  // RVA: 0x7F4DB0
    void dut();  // RVA: 0x7F4EF0
    void duu(Color a);  // RVA: 0x7F5030
    void duv(int32_t a, int32_t b);  // RVA: 0x7F5110
    RectTransform* duw();  // RVA: 0x7F5640
    void dux(RectTransform* a);  // RVA: 0x7F5780
    void OnDisable();  // RVA: 0x7F45C0
    void .ctor();  // RVA: 0x7F4770
    static void .cctor();  // RVA: 0x7F4710
};

// Namespace: <global>
class ActSlot : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    int32_t act; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* text_ActName; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Button* btn; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    ToggleButton* button_toggle; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    float m_selectedCorrectionY; // 0x0040
    uint8_t pad_0041[0x3]; // 0x0041
    float m_unSelectedCorrectionY; // 0x0044
    uint8_t pad_0045[0x3]; // 0x0045
    Color m_selectedColor; // 0x0048
    uint8_t pad_0049[0xF]; // 0x0049
    Color m_unSelectedColor; // 0x0058
    uint8_t pad_0059[0xF]; // 0x0059
    System.Action<System.Int32> baxh; // 0x0068

    // Methods
    void duy(int32_t a, System.Action<System.Int32> b);  // RVA: 0x7EDC70
    void duz();  // RVA: 0x7EDDD0
    void dva(bool a);  // RVA: 0x7EDEB0
    void dvb();  // RVA: 0x7EDF90
    void .ctor();  // RVA: 0x6287A0
};

// Namespace: <global>
class u : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    System.Collections.Generic.List<TaskbarHero.UI.AttributeSlot> attributeSlots; // 0x0020

    // Methods
    void .ctor();  // RVA: 0x805940
};

// Namespace: <global>
class LogSlot : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    RectTransform* rt; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* Text_LogText; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Animator* animator; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    car* feedback1; // 0x0038

    // Methods
    void dvc(Il2CppString* a, Vector2 b, GradeSO* c);  // RVA: 0x7F3630
    void offObject();  // RVA: 0x635AE0
    void dvd();  // RVA: 0x7F37A0
    void .ctor();  // RVA: 0x6287A0
};

// Namespace: <global>
class ba : public MonoBehaviour
{
public:

    // Methods
    void .ctor();  // RVA: 0x6287A0
    void mxh();  // RVA: 0x635AE0
    void cun();  // RVA: 0x635AE0
    void Start();  // RVA: 0x635AE0
    void byh();  // RVA: 0x635AE0
    void fhw();  // RVA: 0x635AE0
    void dth();  // RVA: 0x635AE0
    void cxy();  // RVA: 0x635AE0
    void dsk();  // RVA: 0x635AE0
    void Update();  // RVA: 0x635AE0
};

// Namespace: <global>
class bb
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t baxi; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* baxj; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BlinkAnimation* baxk; // 0x0020

    // Methods
    void .ctor(int32_t a);  // RVA: 0x6737E0
    void dve();  // RVA: 0x635AE0
    bool MoveNext();  // RVA: 0x7FC030
    Il2CppObject* dvf();  // RVA: 0x688DE0
    void dvg();  // RVA: 0x7FC250
    Il2CppObject* dvh();  // RVA: 0x688DE0
};

// Namespace: <global>
class bc
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t baxl; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* baxm; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BlinkAnimation* baxn; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float baxo; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    float baxp; // 0x002C
    uint8_t pad_002D[0x3]; // 0x002D
    float baxq; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float baxr; // 0x0034

    // Methods
    void .ctor(int32_t a);  // RVA: 0x6737E0
    void dvi();  // RVA: 0x635AE0
    bool MoveNext();  // RVA: 0x7FC290
    Il2CppObject* dvj();  // RVA: 0x688DE0
    void dvk();  // RVA: 0x7FC3D0
    Il2CppObject* dvl();  // RVA: 0x688DE0
};

// Namespace: <global>
class bd
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t baxs; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* baxt; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BlinkAnimation* baxu; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float baxv; // 0x0028

    // Methods
    void .ctor(int32_t a);  // RVA: 0x6737E0
    void dvm();  // RVA: 0x635AE0
    bool MoveNext();  // RVA: 0x7FC410
    Il2CppObject* dvn();  // RVA: 0x688DE0
    void dvo();  // RVA: 0x7FC520
    Il2CppObject* dvp();  // RVA: 0x688DE0
};

// Namespace: <global>
class BlinkAnimation : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    float blinkSpeed; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    float minAlpha; // 0x0024
    uint8_t pad_0025[0x3]; // 0x0025
    float maxAlpha; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    bool smoothBlink; // 0x002C
    bool playOnStart; // 0x002D
    bool loop; // 0x002E
    bool unscaledTime; // 0x002F
    SpriteRenderer* baxw; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Image* baxx; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    CanvasGroup* baxy; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    TextMesh* baxz; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    MeshRenderer* baya; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    TextMeshProUGUI* bayb; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    TextMeshPro* bayc; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    bool bayd; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    Coroutine* baye; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    float bayf; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    Action* OnBlinkStart; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    Action* OnBlinkEnd; // 0x0088
    uint8_t pad_0089[0x7]; // 0x0089
    Action* OnBlinkCycle; // 0x0090

    // Methods
    bool dvq();  // RVA: 0x7EE070
    float dvr();  // RVA: 0x7EE080
    void dvs(float a);  // RVA: 0x7EE090
    float dvt();  // RVA: 0x7EE0B0
    float dvu();  // RVA: 0x7EE0C0
    void Awake();  // RVA: 0x7EDFB0
    void Start();  // RVA: 0x7EE040
    void OnValidate();  // RVA: 0x7EDFD0
    void dvv();  // RVA: 0x7EE0D0
    void dvw();  // RVA: 0x7EE3A0
    void dvx();  // RVA: 0x7EE610
    void dvy();  // RVA: 0x7EE6C0
    void dvz();  // RVA: 0x7EE710
    void dwa();  // RVA: 0x7EE800
    void dwb(float a);  // RVA: 0x7EE810
    float dwc();  // RVA: 0x7EEC20
    void dwd(float a, float b, float c, bool d);  // RVA: 0x7EEE90
    IEnumerator* dwe();  // RVA: 0x7EF000
    IEnumerator* dwf(float a);  // RVA: 0x7EF070
    IEnumerator* dwg(float a);  // RVA: 0x7EF0F0
    void dwh();  // RVA: 0x7EF170
    void .ctor();  // RVA: 0x7EE050
};

// Namespace: <global>
struct SpriteAnimClip
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Il2CppString* ClipName; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Sprite[][] Sprites; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bool Loop; // 0x0020
};

// Namespace: <global>
class be
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bayg; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* bayh; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    SpriteAnimation_Image* bayi; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float bayj; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    int32_t bayk; // 0x002C

    // Methods
    void .ctor(int32_t a);  // RVA: 0x6737E0
    void dwi();  // RVA: 0x635AE0
    bool MoveNext();  // RVA: 0x7FC560
    Il2CppObject* dwj();  // RVA: 0x688DE0
    void dwk();  // RVA: 0x7FC7A0
    Il2CppObject* dwl();  // RVA: 0x688DE0
};

// Namespace: <global>
class SpriteAnimation_Image : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Image* image; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    System.Collections.Generic.List<UnityEngine.Sprite> sprites; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float duration; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float speed; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    bool playOnStart; // 0x0038
    bool PlayOnEnable; // 0x0039
    bool loop; // 0x003A
    bool unscaledTime; // 0x003B
    bool m_deactivateOnComplete; // 0x003C
    uint8_t pad_003D[0x3]; // 0x003D
    Coroutine* bayl; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    bool baym; // 0x0048
    uint8_t pad_0049[0x3]; // 0x0049
    int32_t bayn; // 0x004C
    uint8_t pad_004D[0x3]; // 0x004D
    Action* OnAnimationStart; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    Action* OnAnimationComplete; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    System.Action<System.Int32> OnFrameChanged; // 0x0060

    // Methods
    Image* dwm();  // RVA: 0x63EBD0
    System.Collections.Generic.List<UnityEngine.Sprite> dwn();  // RVA: 0x678290
    float dwo();  // RVA: 0x7F5AA0
    float dwp();  // RVA: 0x7F5AB0
    bool dwq();  // RVA: 0x7F5AC0
    bool dwr();  // RVA: 0x7F5AD0
    int32_t dws();  // RVA: 0x7F5AE0
    int32_t dwt();  // RVA: 0x7F5AF0
    float dwu();  // RVA: 0x7F5B30
    void Start();  // RVA: 0x7F59B0
    void OnEnable();  // RVA: 0x7F58A0
    void OnValidate();  // RVA: 0x7F5900
    void dwv();  // RVA: 0x7F5B80
    void dww();  // RVA: 0x7F5D60
    void dwx();  // RVA: 0x7F5DB0
    void dwy(int32_t a);  // RVA: 0x7F5E40
    void dwz();  // RVA: 0x7F5F40
    void dxa();  // RVA: 0x7F5F90
    IEnumerator* dxb();  // RVA: 0x7F5FF0
    void dxc(float a, float b, bool c);  // RVA: 0x7F6060
    void dxd(System.Collections.Generic.List<UnityEngine.Sprite> a);  // RVA: 0x7F6100
    void dxe(Sprite* a);  // RVA: 0x7F6280
    void dxf(int32_t a);  // RVA: 0x7F6310
    void dxg();  // RVA: 0x7F63A0
    void dxh();  // RVA: 0x635AE0
    void .ctor();  // RVA: 0x7F5A10
};

// Namespace: <global>
class bf
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bayo; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* bayp; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    SpriteAnimation_SpriteRenderer* bayq; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float bayr; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    int32_t bays; // 0x002C

    // Methods
    void .ctor(int32_t a);  // RVA: 0x6737E0
    void dxi();  // RVA: 0x635AE0
    bool MoveNext();  // RVA: 0x7FC7E0
    Il2CppObject* dxj();  // RVA: 0x688DE0
    void dxk();  // RVA: 0x7FCCC0
    Il2CppObject* dxl();  // RVA: 0x688DE0
};

// Namespace: <global>
class SpriteAnimation_SpriteRenderer : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    SpriteRenderer* spriteRenderer; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    System.Collections.Generic.List<UnityEngine.Sprite> sprites; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float duration; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float delay; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    bool playOnStart; // 0x0038
    bool PlayOnEnable; // 0x0039
    bool DisableObjectWhenPlayEnd; // 0x003A
    bool m_disableRendererWhenPlayEnd; // 0x003B
    bool loop; // 0x003C
    bool unscaledTime; // 0x003D
    bool randomZRotation; // 0x003E
    uint8_t pad_003F[0x1]; // 0x003F
    Coroutine* bayt; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    bool bayu; // 0x0048
    uint8_t pad_0049[0x3]; // 0x0049
    int32_t bayv; // 0x004C
    uint8_t pad_004D[0x3]; // 0x004D
    Color bayw; // 0x0050
    uint8_t pad_0051[0xF]; // 0x0051
    bool bayx; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    WaitForSeconds* bayy; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    WaitForSecondsRealtime* bayz; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    float baza; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    Action* OnAnimationStart; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    Action* OnAnimationComplete; // 0x0088
    uint8_t pad_0089[0x7]; // 0x0089
    System.Action<System.Int32> OnFrameChanged; // 0x0090
    uint8_t pad_0091[0x7]; // 0x0091
    Action* OnDelayStart; // 0x0098
    uint8_t pad_0099[0x7]; // 0x0099
    Action* OnDelayComplete; // 0x00A0

    // Methods
    SpriteRenderer* dxm();  // RVA: 0x63EBD0
    System.Collections.Generic.List<UnityEngine.Sprite> dxn();  // RVA: 0x678290
    float dxo();  // RVA: 0x7F5AA0
    float dxp();  // RVA: 0x7F5AB0
    bool dxq();  // RVA: 0x7F6710
    bool dxr();  // RVA: 0x7F5AD0
    int32_t dxs();  // RVA: 0x7F5AE0
    int32_t dxt();  // RVA: 0x7F6720
    float dxu();  // RVA: 0x7F6760
    void Start();  // RVA: 0x7F65F0
    void OnEnable();  // RVA: 0x7F64D0
    void OnDisable();  // RVA: 0x7F6430
    void dxv();  // RVA: 0x7F67B0
    void dxw();  // RVA: 0x7F6840
    void OnValidate();  // RVA: 0x7F6540
    void dxx();  // RVA: 0x7F6940
    void dxy();  // RVA: 0x7F6A40
    void dxz();  // RVA: 0x7F6AF0
    void dya(int32_t a);  // RVA: 0x7F6B60
    void dyb();  // RVA: 0x7F6C60
    void dyc();  // RVA: 0x7F6CB0
    WaitForSeconds* dyd(float a);  // RVA: 0x7F6D10
    WaitForSecondsRealtime* dye(float a);  // RVA: 0x7F6DE0
    IEnumerator* dyf();  // RVA: 0x7F6EB0
    void dyg(float a, float b, bool c);  // RVA: 0x7F6F20
    void dyh(System.Collections.Generic.List<UnityEngine.Sprite> a);  // RVA: 0x7F6FA0
    void dyi(Sprite* a);  // RVA: 0x7F70F0
    void dyj(int32_t a);  // RVA: 0x7F7180
    void dyk();  // RVA: 0x7F7210
    void dyl();  // RVA: 0x635AE0
    void .ctor();  // RVA: 0x7F6680
};

// Namespace: <global>
class <>c
{
public:
    // Static fields
    // static <>c* <>9;
    // static UnityAction* <>9__15_0;


    // Methods
    static void .cctor();  // RVA: 0x7F8E60
    void .ctor();  // RVA: 0x6284D0
    void dym();  // RVA: 0x7F8ED0
};

// Namespace: <global>
class BottomStageQuickMenu : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    bool bazb; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    RectTransform* m_quickMenu; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    ScreenBoundsCorrector* m_screenBoundsCorrector; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    float m_bottomOnTopPos; // 0x0038
    uint8_t pad_0039[0x3]; // 0x0039
    float m_bottomOnBottomPos; // 0x003C
    uint8_t pad_003D[0x3]; // 0x003D
    oj* m_quickMenuHoverCheck; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    Button* m_nonPresetButton; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Button* m_pinBattleScreenButton; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    TextMeshProUGUI* m_pinBattleScreenText; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    Button* m_muteButton; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    TextMeshProUGUI* m_muteText; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    Button* m_alwaysOnTopButton; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    TextMeshProUGUI* m_alwaysOnTopText; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    System.Collections.Generic.List<TaskbarHero.UI.LayoutPresetButton> m_layoutPresetButtons; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    bool bazc; // 0x0088

    // Methods
    void dyn();  // RVA: 0x7EF830
    void dyo(bool a);  // RVA: 0x7F04B0
    void dyp(bool a);  // RVA: 0x7F0530
    void dyq(bool a);  // RVA: 0x7F0610
    void dyr(ESoundType a, float b);  // RVA: 0x7F06F0
    void Update();  // RVA: 0x7EF7D0
    void OnDisable();  // RVA: 0x628790
    void OnPointerClick(PointerEventData* eventData);  // RVA: 0x7EF600
    void OnPointerEnter(PointerEventData* eventData);  // RVA: 0x7EF7C0
    void OnPointerExit(PointerEventData* eventData);  // RVA: 0x628790
    void .ctor();  // RVA: 0x6287A0
    void dys();  // RVA: 0x7F0820
};

// Namespace: <global>
class StageTooltip : public MonoBehaviour
{
public:
    // Static fields
    // static int32_t bazd;
    // static int32_t baze;

    uint8_t pad_0000[0x20]; // 0x0000
    TextMeshProUGUI* m_titleText; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* m_stageTypeText; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    TextMeshProUGUI* m_stageLevelText; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Image* m_BG; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Sprite[][] m_bgSprites; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    GameObject* m_soulStoneBG; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Image* m_soulStoneIcon; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    TextMeshProUGUI* m_soulStoneAmountText; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    SpriteAnimation_Image* m_bluePortalAnim; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    SpriteAnimation_Image* m_redPortalAnim; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    GameObject* m_lockIcon; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    GameObject* m_bottomText; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    TextMeshProUGUI* m_bottomTextLabel; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    GameObject* m_mouseIcon; // 0x0088
    uint8_t pad_0089[0x7]; // 0x0089
    TextMeshProUGUI* m_enterText; // 0x0090
    uint8_t pad_0091[0x7]; // 0x0091
    Color m_normalColor; // 0x0098
    uint8_t pad_0099[0xF]; // 0x0099
    Color m_actBossColor; // 0x00A8

    // Methods
    void Show(StageCache* cache);  // RVA: 0x7F7280
    void Hide();  // RVA: 0x736FB0
    void dyt();  // RVA: 0x7F7740
    void dyu(StageCache* a, int32_t b);  // RVA: 0x7F78A0
    void dyv(bool a, bool b);  // RVA: 0x7F7B50
    void dyw(SpriteAnimation_Image* a, SpriteAnimation_Image* b, bool c);  // RVA: 0x7F7B80
    void dyx(StageCache* a, bool b, bool c, bool d, int32_t e);  // RVA: 0x7F7CA0
    void dyy(bool a, Il2CppString* b, Color c);  // RVA: 0x7F7FE0
    void .ctor();  // RVA: 0x6287A0
};

// Namespace: <global>
class OfflineHeroSlot
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    GameObject* slotObject; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    TextMeshProUGUI* nameText; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    TextMeshProUGUI* levelText; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* expText; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Image* baseExp; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Image* addedExp; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    GameObject* levelUpFX; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    System.Collections.Generic.List<UnityEngine.GameObject> heroList; // 0x0048

    // Methods
    void .ctor();  // RVA: 0x7F39B0
};

// Namespace: <global>
struct <ShowLevelUpFX>d__21
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    UI_OfflineReward* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    System.Collections.Generic.List<UI_OfflineReward.OfflineHeroSlot> list; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Awaiter <>u__1; // 0x0030

    // Methods
    void MoveNext();  // RVA: 0x7F8AB0
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7F85E0
};

// Namespace: <global>
class UI_OfflineReward : public MonoBehaviour
{
public:
    // Static fields
    // static float bazf;
    // static float bazg;
    // static EEquipClassType[][] bazh;

    uint8_t pad_0000[0x20]; // 0x0000
    TextMeshProUGUI* m_lastLoginText; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* m_offlineTimeText; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Slider* m_timeSlider; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    TextMeshProUGUI* m_goldText; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    GameObject* m_blockBG; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    OfflineHeroSlot[][] heroSlots; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    CanvasGroup* m_parentCanvasGroup; // 0x0050

    // Methods
    void dyz(OfflineRewardResult a);  // RVA: 0x7FAAF0
    void dza(bool a);  // RVA: 0x7FADD0
    void dzb(OfflineRewardResult a);  // RVA: 0x7FADF0
    void dzc(OfflineRewardResult a);  // RVA: 0x7FB070
    void dzd(OfflineRewardResult a);  // RVA: 0x7FB130
    void dze(OfflineHeroSlot* a, OfflineRewardHeroResult b);  // RVA: 0x7FB4B0
    void dzf(OfflineHeroSlot* a, HeroInfoData* b);  // RVA: 0x7FB9D0
    int32_t dzg(HeroInfoData* a);  // RVA: 0x7FBB90
    HeroInfoData* dzh(int32_t a);  // RVA: 0x7FBC70
    float dzi(float a, float b);  // RVA: 0x7FBD60
    UniTaskVoid dzj(System.Collections.Generic.List<UI_OfflineReward.OfflineHeroSlot> a);  // RVA: 0x7FBD90
    void OnDisable();  // RVA: 0x7FA8B0
    void .ctor();  // RVA: 0x6287A0
    static void .cctor();  // RVA: 0x7FAA60
    bool dzk();  // RVA: 0x7FBE40
};

// Namespace: <global>
struct EStatusUIState
{
public:
    // Static fields
    // static EStatusUIState Default;
    // static EStatusUIState StatDetail;
    // static EStatusUIState AttributeDetail;
    // static EStatusUIState SkillEquip;
    // static EStatusUIState SkillSlot;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
struct EWorldUILocation
{
public:
    // Static fields
    // static EWorldUILocation Left;
    // static EWorldUILocation Center;
    // static EWorldUILocation Right;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
class UI_Main : public MonoBehaviour
{
public:
    // Static fields
    // static float bazj;
    // static float bazk;
    // static float bazl;
    // static float bazm;

    uint8_t pad_0000[0x20]; // 0x0000
    UIManager* bazi; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    UiStateMachineBehaviour* _usm; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    RectTransform* panel_left; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    RectTransform* panel_right; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    RectTransform* panel_center; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    xs* button_Stash; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    xs* button_Stat; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    xs* button_Cube; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    xs* button_Rune; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    xs* button_Portal; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    System.Collections.Generic.List<xs> ContentButtons; // 0x0070

    // Methods
    void Awake();  // RVA: 0x7F97A0
    void dzl();  // RVA: 0x7F9B70
    void Start();  // RVA: 0x7F9A40
    void OnEnable();  // RVA: 0x7F9A40
    void dzm();  // RVA: 0x7F9C80
    EWorldUILocation dzn(float a);  // RVA: 0x7F9EF0
    bool dzo();  // RVA: 0x7F9F10
    bool dzp();  // RVA: 0x7F9F90
    void dzq();  // RVA: 0x7FA010
    void dzr(float a);  // RVA: 0x7FA050
    void dzs(float a);  // RVA: 0x7FA100
    void dzt(float a);  // RVA: 0x7FA1B0
    void dzu();  // RVA: 0x7FA260
    void dzv();  // RVA: 0x7FA260
    void dzw();  // RVA: 0x7FA3C0
    void dzx();  // RVA: 0x7FA4A0
    void dzy();  // RVA: 0x7FA4B0
    void dzz();  // RVA: 0x7FA700
    void eaa();  // RVA: 0x7FA880
    void eab();  // RVA: 0x7FA880
    void .ctor();  // RVA: 0x7F9AF0
};

// Namespace: <global>
class bg : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Vector2 bazn; // 0x0020

    // Methods
    void eac(Vector2 a);  // RVA: 0x7FCD00
    void fpw(Vector2 a);  // RVA: 0x7FCD10
    void ead(Vector2 a);  // RVA: 0x7FCD10
    void .ctor();  // RVA: 0x6287A0
    void cbw(Vector2 a);  // RVA: 0x7FCD00
    void gjb(Vector2 a);  // RVA: 0x7FCD00
    void eae(float a);  // RVA: 0x7FCD10
    void ndm(float a);  // RVA: 0x7FCD10
    void rp(float a);  // RVA: 0x7FCD10
    void luc(float a);  // RVA: 0x7FCD10
    void fmt(Vector2 a);  // RVA: 0x7FCD00
};

// Namespace: <global>
struct <UpdateCoolTimeAsync>d__11
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bh* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x7F9360
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7F85E0
};

// Namespace: <global>
class bh
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    float bazo; // 0x0010
    uint8_t pad_0011[0x3]; // 0x0011
    int32_t bazp; // 0x0014
    uint8_t pad_0015[0x3]; // 0x0015
    System.Action<System.Int32> bazq; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    CancellationTokenSource* bazr; // 0x0020

    // Methods
    void .ctor(int32_t a);  // RVA: 0x7FCD20
    bool eag();  // RVA: 0x7FCDB0
    float eaf();  // RVA: 0x7FCDA0
    void eah();  // RVA: 0x7FCDC0
    void eai();  // RVA: 0x7FCD50
    void oko();  // RVA: 0x7FCD50
    void bcw();  // RVA: 0x7FCD50
    UniTaskVoid eaj();  // RVA: 0x7FCF30
};

// Namespace: <global>
class bi
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bazs; // 0x0010

    // Methods
    void .ctor();  // RVA: 0x6284D0
};

// Namespace: <global>
class bj
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bazt; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* bazu; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    DeadUnitData* bazv; // 0x0020

    // Methods
    void .ctor(int32_t a);  // RVA: 0x6737E0
    void eak();  // RVA: 0x635AE0
    bool MoveNext();  // RVA: 0x7FCFC0
    Il2CppObject* eal();  // RVA: 0x688DE0
    void eam();  // RVA: 0x7FD150
    Il2CppObject* ean();  // RVA: 0x688DE0
};

// Namespace: <global>
class DeadUnitData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    ug* cache; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    float currentResurrectionTime; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    System.Action<System.Single> OnProcessChange; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Coroutine* resurrectionCoroutine; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    int32_t bazw; // 0x0030

    // Methods
    int32_t eao();  // RVA: 0x7F1210
    void .ctor(ug* cache, int32_t dieOrder);  // RVA: 0x7F10C0
    void eap();  // RVA: 0x7F1220
    void eaq();  // RVA: 0x7F12F0
    IEnumerator* ear();  // RVA: 0x7F1370
};

// Namespace: <global>
class ObstacleScriptableObject : public ScriptableObject
{
public:
    uint8_t pad_0000[0x18]; // 0x0000
    System.Collections.Generic.List<System.Single> ObstacleMoveSpeeds; // 0x0018

    // Methods
    void .ctor();  // RVA: 0x6B81B0
};

// Namespace: <global>
class SkillSO : public ScriptableObject
{
public:
    uint8_t pad_0000[0x18]; // 0x0000
    SKILLTYPE skillTYPE; // 0x0018
    uint8_t pad_0019[0x3]; // 0x0019
    float preTime; // 0x001C
    uint8_t pad_001D[0x3]; // 0x001D
    float actionTime; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    float postTime; // 0x0024
    uint8_t pad_0025[0x3]; // 0x0025
    bool KeepActivateOnRecast; // 0x0028
    bool CanMultiCastSkill; // 0x0029
    uint8_t pad_002A[0x6]; // 0x002A
    PrefabAndOffSetEffect* SkillEf_StartEf_Me; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    PrefabAndOffSetEffect* SkillEf_Direct_Other; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    PrefabAndOffSetEffect* AreaOfEffect_Other_Hitted; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    PrefabAndOffSetProjecTile* SkillProjecTile; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    AreaOfEffectData AreaOfEffectObject; // 0x0050
    uint8_t pad_0051[0x17]; // 0x0051
    bcp* WillSpawnTurret; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    bl* WillSpawnTrap; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    float WillSpawnTrapFixedY; // 0x0078
    uint8_t pad_0079[0x3]; // 0x0079
    float WillSpawnTrapSpeed; // 0x007C
    uint8_t pad_007D[0x3]; // 0x007D
    float WillSpawnTrapRandPosOffsetDividedRange; // 0x0080
    uint8_t pad_0081[0x3]; // 0x0081
    float WillSpawnTrapRandPosOffsetIncrementDividedRange; // 0x0084
    uint8_t pad_0085[0x3]; // 0x0085
    float WillSpawnTrapRandPosMaxOffsetDividedRange; // 0x0088
    uint8_t pad_0089[0x3]; // 0x0089
    float WillFinalOffsetXDividedRange_Move; // 0x008C
    uint8_t pad_008D[0x3]; // 0x008D
    float WillFinalOffsetXDividedRange_NotMove; // 0x0090
    uint8_t pad_0091[0x7]; // 0x0091
    SpawnSomethingData SpawnSomethingData; // 0x0098
    uint8_t pad_0099[0x17]; // 0x0099
    MonsterRandomSpawnData RandomMonsterSpawnData; // 0x00B0
    uint8_t pad_00B1[0x17]; // 0x00B1
    Sprite* SkillSprite; // 0x00C8
    uint8_t pad_00C9[0x7]; // 0x00C9
    AnimationClip* SkillClip1; // 0x00D0
    uint8_t pad_00D1[0x7]; // 0x00D1
    AnimationClip* SkillClip2; // 0x00D8
    uint8_t pad_00D9[0x7]; // 0x00D9
    AnimationClip* SkillClip3; // 0x00E0

    // Methods
    bool eas();  // RVA: 0x7F5830
    bool eat();  // RVA: 0x7F5840
    bool eau();  // RVA: 0x7F5850
    bool eav();  // RVA: 0x7F5860
    bool eaw();  // RVA: 0x7F5870
    bool eax();  // RVA: 0x7F5880
    bool eay();  // RVA: 0x7F5890
    void .ctor();  // RVA: 0x7F5820
};

// Namespace: <global>
struct SpawnSomethingData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    GameObject* SpawnPrefab; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector3 Offset; // 0x0018
};

// Namespace: <global>
struct MonsterRandomSpawnData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    System.Collections.Generic.List<System.Int32> RandomSpawnMonsterKey; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    int32_t SpawnCount; // 0x0018
    uint8_t pad_0019[0x3]; // 0x0019
    float RandomSpawnPosOffsetMin; // 0x001C
    uint8_t pad_001D[0x3]; // 0x001D
    float RandomSpawnPosOffsetMax; // 0x0020
};

// Namespace: <global>
struct AreaOfEffectData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    GameObject* Prefab; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector3 OffSet; // 0x0018
};

// Namespace: <global>
class PrefabAndOffSetEffect
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    GameObject* Go_Prefab; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector3 OffSet; // 0x0018

    // Methods
    void .ctor();  // RVA: 0x7F3A30
};

// Namespace: <global>
class PrefabAndOffSetProjecTile
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    bdc* Go_Prefab; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector3 OffSet; // 0x0018

    // Methods
    void .ctor();  // RVA: 0x7F3A30
};

// Namespace: <global>
class TrapExplosionData : public ScriptableObject
{
public:
    uint8_t pad_0000[0x18]; // 0x0000
    EDamageAttribute ReactDamageType; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bbj* AreaOfEffect; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Il2CppString* ExplosionTriggerName; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float DividedExplosionDelayTime; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    int32_t DamageIncreaseValue; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    StatusEffectType StatusEffectType; // 0x0038
    uint8_t pad_0039[0x3]; // 0x0039
    float StatusEffectChance; // 0x003C

    // Methods
    void .ctor();  // RVA: 0x6B81B0
};

// Namespace: <global>
struct <ActivatingExplosion>d__31
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bk* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TrapExplosionData* data; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Awaiter <>u__1; // 0x0030

    // Methods
    void MoveNext();  // RVA: 0x7F8110
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7F85E0
};

// Namespace: <global>
class bk : public bl
{
public:
    uint8_t pad_0000[0x48]; // 0x0000
    TrapExplosionData[][] ExplosionData; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Unit* bazx; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    System.Collections.Generic.Dictionary<TaskbarHero.Data.EDamageAttribute,TrapExplosionData> bazy; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    float bazz; // 0x0060
    uint8_t pad_0061[0x3]; // 0x0061
    EDamageAttribute bbaa; // 0x0064
    uint8_t pad_0065[0x3]; // 0x0065
    EDamageType bbab; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    TrapExplosionData* bbac; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    bool bbad; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    CancellationTokenSource* bbae; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    Action* bbaf; // 0x0088
    uint8_t pad_0089[0x7]; // 0x0089
    int32_t bbag; // 0x0090
    uint8_t pad_0091[0x3]; // 0x0091
    int32_t bbah; // 0x0094
    uint8_t pad_0095[0x3]; // 0x0095
    int32_t bbai; // 0x0098

    // Methods
    void cnp(EDamageAttribute a);  // RVA: 0x7FD210
    void gdf(EDamageAttribute a);  // RVA: 0x7FDC30
    void ebj(DamageInfo a, bool b);  // RVA: 0x7FD620
    void lnr(float a);  // RVA: 0x7FD450
    void ggr(EDamageAttribute a);  // RVA: 0x7FDCE0
    DamageInfo ebn();  // RVA: 0x7FD970
    void ebf(int32_t a, int32_t b, int32_t c);  // RVA: 0x7FD2C0
    void ebe(float a, Unit* b, EDamageType c, Action* d);  // RVA: 0x7FD350
    void ebk();  // RVA: 0x7FD7D0
    Unit* ebc();  // RVA: 0x632950
    DamageableType ebb();  // RVA: 0x7FD330
    void ebl();  // RVA: 0x7FD860
    Transform* ebd();  // RVA: 0x7FD340
    DamageInfo iuo();  // RVA: 0x7FDE40
    float ebo();  // RVA: 0x7FDB30
    UniTaskVoid ebm(TrapExplosionData* a);  // RVA: 0x7FD8C0
    void .ctor();  // RVA: 0x7FD190
    Vector3 ebq();  // RVA: 0x62F260
    Bounds ebp();  // RVA: 0x7FDB60
    int32_t ebr();  // RVA: 0x7FDC20
    void dis(int32_t a, int32_t b, int32_t c);  // RVA: 0x7FD2C0
    bool eba();  // RVA: 0x66BAA0
    void ebi(Vector3 a, Vector3 b, float c, float d);  // RVA: 0x7FD4A0
    void kso(float a, Unit* b, EDamageType c, Action* d);  // RVA: 0x7FD350
    Vector3 eaz();  // RVA: 0x7FD2E0
    void ebg(EDamageAttribute a);  // RVA: 0x7FD3A0
    void ebh(float a);  // RVA: 0x7FD450
    void hqg(EDamageAttribute a);  // RVA: 0x7FDD90
    void fvi(float a, Unit* b, EDamageType c, Action* d);  // RVA: 0x7FD350
};

// Namespace: <global>
struct <UpdateTrapLifeTime>d__11
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bl* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x7F9560
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7F85E0
};

// Namespace: <global>
class bl : public bci
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Animator* TrapAnimator; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    bdh* TrapMover; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float LifeTime; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float TrapMoveSpeed; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    float TrapMoveHeight; // 0x0038
    uint8_t pad_0039[0x3]; // 0x0039
    bool bbaj; // 0x003C
    uint8_t pad_003D[0x3]; // 0x003D
    CancellationTokenSource* bbak; // 0x0040

    // Methods
    void jxk();  // RVA: 0x7FE730
    void OnDisable();  // RVA: 0x7FE000
    void ebs();  // RVA: 0x7FE460
    void ebu();  // RVA: 0x7FE570
    void dlq();  // RVA: 0x7FE030
    void ebi(Vector3 a, Vector3 b, float c, float d);  // RVA: 0x7FE0B0
    void fph();  // RVA: 0x7FE6B0
    UniTaskVoid ebt();  // RVA: 0x7FE4E0
    void kuy();  // RVA: 0x7FE7B0
    void .ctor();  // RVA: 0x7FE020
    void ebk();  // RVA: 0x7FE410
    void ebv();  // RVA: 0x7FE5F0
    void eof();  // RVA: 0x7FE630
};

// Namespace: <global>
struct <UpdateAsync>d__15
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    LineController* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x7F8F00
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7F85E0
};

// Namespace: <global>
class LineController : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    bool OnlyOneLoop; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    LineRenderer* LineRenderer; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Texture[][] lineTextures; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    float Fps; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    SpriteRenderer* m_headCap; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    SpriteRenderer* m_tailCap; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    float bbal; // 0x0050
    uint8_t pad_0051[0x3]; // 0x0051
    int32_t bbam; // 0x0054
    uint8_t pad_0055[0x3]; // 0x0055
    bool bban; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    Transform* bbao; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    Transform* bbap; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    Vector3 bbaq; // 0x0070
    uint8_t pad_0071[0xB]; // 0x0071
    Vector3 bbar; // 0x007C

    // Methods
    void ebw();  // RVA: 0x7F3040
    void ebx(Transform* a, Transform* b, Vector3 c, Vector3 d);  // RVA: 0x7F30A0
    UniTaskVoid eby();  // RVA: 0x7F3350
    void ebz(Vector3 a, Vector3 b);  // RVA: 0x7F33D0
    void .ctor();  // RVA: 0x6287A0
};

// Namespace: <global>
class bm : public bz
{
public:
    uint8_t pad_0000[0x38]; // 0x0000
    float FloorHalfSize; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    System.Collections.Generic.List<UnityEngine.GameObject> Presets; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    FollowCamera* FollowCamera; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    float ObstacleMoveSpeed; // 0x0050
    uint8_t pad_0051[0x3]; // 0x0051
    float TimeCorrectionValue; // 0x0054
    uint8_t pad_0055[0x3]; // 0x0055
    float bbas; // 0x0058
    uint8_t pad_0059[0x3]; // 0x0059
    int32_t bbat; // 0x005C
    uint8_t pad_005D[0x3]; // 0x005D
    System.Collections.Generic.List<bo> ChildLayers; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    int32_t bbau; // 0x0068
    uint8_t pad_0069[0x3]; // 0x0069
    float bbav; // 0x006C
    uint8_t pad_006D[0x3]; // 0x006D
    Transform* bbaw; // 0x0070

    // Methods
    void ljs();  // RVA: 0x801490
    void cfb();  // RVA: 0x7FF0A0
    void eca(Vector3 a, float b, int32_t c);  // RVA: 0x7FF4B0
    void neo(Vector3 a, float b, int32_t c);  // RVA: 0x801620
    void jfg(Vector3 a, float b, int32_t c);  // RVA: 0x800B30
    void gmw(Transform* a);  // RVA: 0x800120
    void orm();  // RVA: 0x801980
    void jtb();  // RVA: 0x801110
    void dsb(Transform* a);  // RVA: 0x7FF230
    void Show();  // RVA: 0x7FEA50
    void knj();  // RVA: 0x801300
    void ecc(Transform* a);  // RVA: 0x7FF9A0
    void Update();  // RVA: 0x7FEA80
    void ilf();  // RVA: 0x800620
    void izo();  // RVA: 0x800810
    void .ctor();  // RVA: 0x7FEDA0
    void End();  // RVA: 0x7FE830
    void ecd(Transform* a);  // RVA: 0x7FFC20
    void bai(Transform* a);  // RVA: 0x7FEE20
    void kry();  // RVA: 0x7FEA50
    void mkb();  // RVA: 0x7FEA50
    void gkx(Transform* a);  // RVA: 0x7FFEA0
    void jry(Transform* a);  // RVA: 0x800E90
    void Hide();  // RVA: 0x7FEA20
    void had(Transform* a);  // RVA: 0x8003A0
    void ecb();  // RVA: 0x7FF810
};

// Namespace: <global>
class bn : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Camera* bbax; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    UI_Stage* bbay; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    bool OnHover; // 0x0030

    // Methods
    void Start();  // RVA: 0x801B70
    void .ctor();  // RVA: 0x6287A0
    void Update();  // RVA: 0x801C00
    void mii();  // RVA: 0x801D50
    void brz();  // RVA: 0x801C30
    void bvo();  // RVA: 0x801C00
    void cez();  // RVA: 0x801CC0
    void jri();  // RVA: 0x801C00
    void gtk();  // RVA: 0x801C00
    void dpo();  // RVA: 0x801C00
};

// Namespace: <global>
class bo : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    System.Collections.Generic.List<SpriteAnimation_SpriteRenderer> SpriteAnimationList; // 0x0020

    // Methods
    void ece();  // RVA: 0x801DE0
    void ecf();  // RVA: 0x801F20
    void ivj();  // RVA: 0x802030
    void mru();  // RVA: 0x802170
    void .ctor();  // RVA: 0x6287A0
};

// Namespace: <global>
class bp : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    System.Collections.Generic.List<UnityEngine.GameObject> BackGroundPresets; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    FollowCamera* FollowCamera; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float ObstacleMoveSpeed; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    System.Collections.Generic.List<SpriteAnimation_SpriteRenderer> SpriteAnimationList; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Vector3 bbaz; // 0x0040

    // Methods
    void kle();  // RVA: 0x8022B0
    void Awake();  // RVA: 0x8022B0
    void Update();  // RVA: 0x802440
    void its();  // RVA: 0x8034A0
    void cis();  // RVA: 0x8028A0
    void bzl();  // RVA: 0x802670
    void .ctor();  // RVA: 0x6287A0
    void dpg();  // RVA: 0x802AD0
    void End();  // RVA: 0x8022F0
    void ftr(Vector3 a);  // RVA: 0x8030D0
    void ecg(Vector3 a);  // RVA: 0x802D00
};

// Namespace: <global>
class bq
{
public:
    // Static fields
    // static Il2CppString* bbba;
    // static Il2CppString* bbbb;
    // static Il2CppString* bbbc;
    // static Il2CppString* bbbd;
    // static Il2CppString* bbbe;
    // static Il2CppString* bbbf;
    // static Il2CppString* bbbg;


    // Methods
    static void .cctor();  // RVA: 0x8036D0
};

// Namespace: <global>
class br
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Il2CppString* bbbh; // 0x0010

    // Methods
    void .ctor();  // RVA: 0x6284D0
    bool ech(Il2CppString* a);  // RVA: 0x803880
};

// Namespace: <global>
class CsvManager : public MonoBehaviour
{
public:
    // Static fields
    // static CsvManager* bbbi;

    uint8_t pad_0000[0x20]; // 0x0000
    Il2CppString* m_csvFolderPath; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    System.Collections.Generic.List<UnityEngine.TextAsset> m_csvTextAssets; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    System.Collections.Generic.Dictionary<System.String,UnityEngine.TextAsset> bbbj; // 0x0030

    // Methods
    static CsvManager* eci();  // RVA: 0x7F0D80
    void Awake();  // RVA: 0x7F0C20
    void ecj();  // RVA: 0x7F0DC0
    System.Collections.Generic.List<a> eck(Il2CppString* a);  // RVA: 0x4196F0
    TextAsset* ecl(Il2CppString* a);  // RVA: 0x7F0F50
    String[][] ecm(Il2CppString* a);  // RVA: 0x7F0FB0
    void .ctor();  // RVA: 0x7F0C80
};

// Namespace: <global>
class FollowCamera : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    StageManager* _stageController; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Unit[][] _targets; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Vector3 _battleModeOffset; // 0x0030
    uint8_t pad_0031[0xF]; // 0x0031
    RectTransform* m_stageUIRect; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    BoxCollider2D* m_collider2D; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Vector3 windowFrameOffset; // 0x0050
    uint8_t pad_0051[0xB]; // 0x0051
    Vector3 bbbk; // 0x005C
    uint8_t pad_005D[0xB]; // 0x005D
    float bbbl; // 0x0068
    uint8_t pad_0069[0x3]; // 0x0069
    float bbbm; // 0x006C
    uint8_t pad_006D[0x3]; // 0x006D
    float m_monsterTargetOffsetValue; // 0x0070
    uint8_t pad_0071[0x3]; // 0x0071
    float m_monsterFollowCameraCenterOffset; // 0x0074
    uint8_t pad_0075[0x3]; // 0x0075
    Vector3 m_windowFrameMonsterBattleFollowOffset; // 0x0078
    uint8_t pad_0079[0xB]; // 0x0079
    Vector3 m_windowFrameCorrectionOffset; // 0x0084
    uint8_t pad_0085[0xB]; // 0x0085
    float m_heroSpreadMaxDistance; // 0x0090
    uint8_t pad_0091[0x3]; // 0x0091
    float m_heroSpreadTargetOffsetX; // 0x0094
    uint8_t pad_0095[0x3]; // 0x0095
    float m_maxFollowDistance; // 0x0098
    uint8_t pad_0099[0x3]; // 0x0099
    float m_catchUpSpeedMultiplier; // 0x009C
    uint8_t pad_009D[0x3]; // 0x009D
    float bbbn; // 0x00A0
    uint8_t pad_00A1[0x7]; // 0x00A1
    TMP_InputField* m_debugCorrectionOffsetXInput; // 0x00A8
    uint8_t pad_00A9[0x7]; // 0x00A9
    TMP_InputField* m_debugCorrectionOffsetYInput; // 0x00B0
    uint8_t pad_00B1[0x7]; // 0x00B1
    TMP_InputField* m_debugCorrectionOffsetZInput; // 0x00B8

    // Methods
    Transform* ecn();  // RVA: 0x7F1810
    Vector3 eco();  // RVA: 0x7F1840
    float ecp();  // RVA: 0x7F1880
    void Start();  // RVA: 0x7F1750
    void ecq();  // RVA: 0x7F1890
    void ecr(Il2CppString* a);  // RVA: 0x7F1B90
    void ecs(Il2CppString* a);  // RVA: 0x7F1BD0
    void ect(Il2CppString* a);  // RVA: 0x7F1C10
    void Update();  // RVA: 0x7F1760
    void ecu();  // RVA: 0x7F1C50
    void ecv(float a);  // RVA: 0x7F1F20
    void ecw(Unit[][] a);  // RVA: 0x7F1F30
    Vector3 ecx();  // RVA: 0x7F21F0
    Vector3 ecy();  // RVA: 0x7F2300
    Vector3 ecz();  // RVA: 0x7F2410
    void eda(Vector3 a);  // RVA: 0x7F2910
    void .ctor();  // RVA: 0x7F1770
};

// Namespace: <global>
class TestFollowScript : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Transform* m_stageUIRect; // 0x0020

    // Methods
    void Update();  // RVA: 0x80AB80
    void .ctor();  // RVA: 0x6287A0
};

// Namespace: <global>
class AnimationEf : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    SpriteRenderer* spr; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    SpriteAnimation_SpriteRenderer* sprite_Animation; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    System.Collections.Generic.List<SpriteAnimation_SpriteRenderer> additionalAnimations; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Action* bbbo; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    bool EndDestroy; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    SpriteAnimation_SpriteRenderer* bbbp; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    SpriteRenderer* bbbq; // 0x0050

    // Methods
    void edb(Action* a);  // RVA: 0x806240
    void Awake();  // RVA: 0x805BD0
    void edc();  // RVA: 0x8062E0
    void edd();  // RVA: 0x806710
    void ede(int32_t a);  // RVA: 0x635AE0
    void edf();  // RVA: 0x806730
    void .ctor();  // RVA: 0x806230
};

// Namespace: <global>
class bs`1 : public bw
{
public:
