// ============================================================
// Image: ACTk.Runtime.dll
// ============================================================

namespace Microsoft.CodeAnalysis
{

    // Namespace: Microsoft.CodeAnalysis
    class EmbeddedAttribute : public Attribute
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x674A40
    };

} // namespace Microsoft.CodeAnalysis

namespace System.Runtime.CompilerServices
{

    // Namespace: System.Runtime.CompilerServices
    class IsUnmanagedAttribute : public Attribute
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x674A40
    };

} // namespace System.Runtime.CompilerServices

// Namespace: <global>
struct MonoScriptData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Byte[][] FilePathsData; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Byte[][] TypesData; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    int32_t TotalTypes; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    int32_t TotalFiles; // 0x0024
    uint8_t pad_0025[0x3]; // 0x0025
    bool IsEditorOnly; // 0x0028
};

// Namespace: <global>
class dan
{
public:

    // Methods
    void .ctor();  // RVA: 0x628380
    static MonoScriptData fnf();  // RVA: 0x6756F0
    static MonoScriptData vyz();  // RVA: 0x6757D0
};

// Namespace: <global>
class dao
{
public:

    // Methods
    static void vzb();  // RVA: 0x63D9D0
    static void vza();  // RVA: 0x63D9D0
    static void oea();  // RVA: 0x63D9D0
    static void kdp();  // RVA: 0x63D9D0
};

// Namespace: <global>
class ApplicationFocusEventHandler : public MulticastDelegate
{
public:

    // Methods
    void .ctor(Il2CppObject* object, intptr_t method);  // RVA: 0x674930
    void Invoke(bool hasFocus);  // RVA: 0x674920
    IAsyncResult* BeginInvoke(bool hasFocus, AsyncCallback* callback, Il2CppObject* object);  // RVA: 0x6748B0
    void EndInvoke(IAsyncResult* result);  // RVA: 0x674910
};

// Namespace: <global>
class ApplicationPauseEventHandler : public MulticastDelegate
{
public:

    // Methods
    void .ctor(Il2CppObject* object, intptr_t method);  // RVA: 0x674930
    void Invoke(bool pauseStatus);  // RVA: 0x674920
    IAsyncResult* BeginInvoke(bool pauseStatus, AsyncCallback* callback, Il2CppObject* object);  // RVA: 0x6748B0
    void EndInvoke(IAsyncResult* result);  // RVA: 0x674910
};

// Namespace: <global>
class dap : public MonoBehaviour
{
public:
    // Static fields
    // static dap* bmnz;

    uint8_t pad_0000[0x20]; // 0x0000
    ApplicationFocusEventHandler* bmnx; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    ApplicationPauseEventHandler* bmny; // 0x0028

    // Methods
    static dap* vzg();  // RVA: 0x675C10
    void vzd(ApplicationFocusEventHandler* a);  // RVA: 0x675A30
    void Awake();  // RVA: 0x6758B0
    void .ctor();  // RVA: 0x628730
    void vzc(ApplicationFocusEventHandler* a);  // RVA: 0x675990
    void OnApplicationFocus(bool hasFocus);  // RVA: 0x675950
    void vzf(ApplicationPauseEventHandler* a);  // RVA: 0x675B70
    void enk(bool pauseStatus);  // RVA: 0x675970
    void vze(ApplicationPauseEventHandler* a);  // RVA: 0x675AD0
    void OnApplicationPause(bool pauseStatus);  // RVA: 0x675970
};

// Namespace: <global>
class daq
{
public:

    // Methods
    static Char[][] jla(Il2CppString* a);  // RVA: 0x6761C0
    static Char[][] vzi(Il2CppString* a);  // RVA: 0x6768C0
    static Il2CppString* vzj(Il2CppString* a);  // RVA: 0x676960
    static Char[][] lmv(Il2CppString* a);  // RVA: 0x6764B0
    static Il2CppString* vzk(Char[][] a);  // RVA: 0x676A80
    static Il2CppString* juk(Il2CppString* a);  // RVA: 0x676300
    static Il2CppString* jul(Char[][] a);  // RVA: 0x6763A0
    static Il2CppString* jqz(Il2CppString* a);  // RVA: 0x676260
    static Il2CppString* lts(Il2CppString* a);  // RVA: 0x676550
    static Il2CppString* lvi(Il2CppString* a);  // RVA: 0x6765F0
    static Char[][] bnc(Il2CppString* a);  // RVA: 0x675D40
    static Il2CppString* hti(Il2CppString* a);  // RVA: 0x675F90
    static Il2CppString* vzh(Il2CppString* a);  // RVA: 0x676820
    static Il2CppString* gkf(Char[][] a);  // RVA: 0x675E80
    static Il2CppString* miy(Char[][] a);  // RVA: 0x676710
    static Il2CppString* ihk(Char[][] a);  // RVA: 0x6760B0
    static Il2CppString* elh(Il2CppString* a);  // RVA: 0x675DE0
};

// Namespace: <global>
class dar
{
public:
    // Static fields
    // static int32_t bmoa;
    // static uint8_t bmob;
    // static uint8_t bmoc;
    // static uint8_t bmod;
    // static uint8_t bmoe;
    // static uint8_t bmof;


    // Methods
    static void vzl(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x676DC0
    static void vzm(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x676E30
    static void dji(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x676C00
    static void vzo(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x676F10
    static void cxm(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x676B90
    static void z(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x676F80
    static void vzp(Stream* a, Stream* b, Byte[][] c, uint8_t d);  // RVA: 0x564160
    static void vzq(Stream* a, Stream* b, Byte[][] c, uint8_t d, uint8_t e);  // RVA: 0x436AF0
    static void zg(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x676FF0
    static void iyl(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x676D50
    static void vzn(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x676EA0
    static void eoc(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x676C70
    static void igg(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x676CE0
};

// Namespace: <global>
class das
{
public:
    // Static fields
    // static int32_t bmog;


    // Methods
    static int32_t was(uint64_t a);  // RVA: 0x67A150
    static bool vzs(bool a, int32_t b);  // RVA: 0x679010
    static int32_t dmz(Vector3 a);  // RVA: 0x6779E0
    static bool myb(Quaternion a, int32_t b);  // RVA: 0x677400
    static bool dqi(BigInteger a, int32_t b);  // RVA: 0x677AD0
    static bool sn(BigInteger a, int32_t b);  // RVA: 0x677AD0
    static int32_t enh(Decimal a);  // RVA: 0x677CB0
    static bool vzy(Quaternion a, int32_t b);  // RVA: 0x677400
    static int32_t ffz(Vector3Int a);  // RVA: 0x677F80
    static bool waa(Vector2Int a, int32_t b);  // RVA: 0x677060
    static int32_t ffo(Char[][] a);  // RVA: 0x677F30
    static bool wae(double a, int32_t b);  // RVA: 0x678AA0
    static int32_t bqp(Char[][] a);  // RVA: 0x677430
    static int32_t bsz(Char[][] a);  // RVA: 0x677480
    static bool vzu(int32_t a, int32_t b);  // RVA: 0x6786A0
    static bool wag(DateTimeOffset a, int32_t b);  // RVA: 0x6793A0
    static bool ohb(DateTimeOffset a, int32_t b);  // RVA: 0x6793A0
    static int32_t cdf(Guid a);  // RVA: 0x6775E0
    static int32_t waj(BigInteger a);  // RVA: 0x6797B0
    static int32_t men(Vector3 a);  // RVA: 0x6779E0
    static int32_t lut(int64_t a);  // RVA: 0x679030
    static bool nrw(Guid a, int32_t b);  // RVA: 0x6787B0
    static bool lxk(Guid a, int32_t b);  // RVA: 0x6787B0
    static int32_t wao(DateTimeOffset a);  // RVA: 0x679D70
    static int32_t wba(Char[][] a);  // RVA: 0x67A400
    static bool mea(Vector3Int a, int32_t b);  // RVA: 0x677870
    static bool vzx(uint64_t a, int32_t b);  // RVA: 0x678370
    static bool kvz(double a, int32_t b);  // RVA: 0x678AA0
    static bool edb(Quaternion a, int32_t b);  // RVA: 0x677400
    static bool vzt(Decimal a, int32_t b);  // RVA: 0x677C00
    static int32_t lni(uint32_t a);  // RVA: 0x678C20
    static bool wah(Guid a, int32_t b);  // RVA: 0x6787B0
    static bool lif(BigInteger a, int32_t b);  // RVA: 0x677AD0
    static int32_t way(Vector3 a);  // RVA: 0x6779E0
    static bool mpi(Vector2Int a, int32_t b);  // RVA: 0x677060
    static bool jwp(double a, int32_t b);  // RVA: 0x678AA0
    static int32_t wap(Guid a);  // RVA: 0x679E50
    static int32_t ghp(Guid a);  // RVA: 0x678420
    static bool ibv(Decimal a, int32_t b);  // RVA: 0x677C00
    static bool cbq(Vector3 a, int32_t b);  // RVA: 0x6774D0
    static int32_t llc(bool a);  // RVA: 0x678D10
    static int32_t gbp(Quaternion a);  // RVA: 0x6778A0
    static int32_t wau(double a);  // RVA: 0x67A240
    static int32_t lfw(int64_t a);  // RVA: 0x678C70
    static bool gjy(uint32_t a, int32_t b);  // RVA: 0x6786A0
    static bool njm(int32_t a, int32_t b);  // RVA: 0x6786A0
    static int32_t jie(Decimal a);  // RVA: 0x678840
    static bool kcg(uint32_t a, int32_t b);  // RVA: 0x6786A0
    static int32_t ksn(Vector2 a);  // RVA: 0x678AD0
    static bool of(uint64_t a, int32_t b);  // RVA: 0x678370
    static int32_t jmt(Decimal a);  // RVA: 0x678970
    static bool lup(Quaternion a, int32_t b);  // RVA: 0x677400
    static bool bn(Quaternion a, int32_t b);  // RVA: 0x677400
    static int32_t hbo(Vector3 a);  // RVA: 0x6779E0
    static bool kkz(Vector2 a, int32_t b);  // RVA: 0x678B70
    static int32_t wat(float a);  // RVA: 0x67A1F0
    static bool wac(Vector3Int a, int32_t b);  // RVA: 0x677870
    static int32_t mee(int32_t a);  // RVA: 0x6791C0
    static int32_t olv(Guid a);  // RVA: 0x6793D0
    static bool fyt(Vector3 a, int32_t b);  // RVA: 0x6774D0
    static int32_t wbb(Il2CppString* a);  // RVA: 0x67A450
    static int32_t icq(double a);  // RVA: 0x678790
    static bool eff(Vector3Int a, int32_t b);  // RVA: 0x677870
    static int32_t fb(uint64_t a);  // RVA: 0x677E90
    static int32_t irz(bool a);  // RVA: 0x6787E0
    static int32_t ced(bool a);  // RVA: 0x677850
    static int32_t wax(Vector2Int a);  // RVA: 0x67A260
    static bool gp(Vector2Int a, int32_t b);  // RVA: 0x677060
    static int32_t key(Vector2 a);  // RVA: 0x678AD0
    static int32_t gwi(int64_t a);  // RVA: 0x6786F0
    static int32_t waz(Vector3Int a);  // RVA: 0x67A300
    static int32_t war(uint32_t a);  // RVA: 0x678C20
    static bool irc(Guid a, int32_t b);  // RVA: 0x6787B0
    static int32_t fxx(BigInteger a);  // RVA: 0x678080
    static int32_t wan(DateTime a);  // RVA: 0x679C80
    static int32_t wam(int32_t a);  // RVA: 0x678C20
    static bool vzw(uint32_t a, int32_t b);  // RVA: 0x6786A0
    static int32_t cqb(bool a);  // RVA: 0x677860
    static bool rj(DateTimeOffset a, int32_t b);  // RVA: 0x6793A0
    static int32_t rt(Vector3 a);  // RVA: 0x6779E0
    static bool msw(int32_t a, int32_t b);  // RVA: 0x6786A0
    static bool vzv(int64_t a, int32_t b);  // RVA: 0x679640
    static int32_t waw(Vector2 a);  // RVA: 0x678AD0
    static int32_t jjy(Quaternion a);  // RVA: 0x6778A0
    static bool dxj(Decimal a, int32_t b);  // RVA: 0x677C00
    static bool lti(bool a, int32_t b);  // RVA: 0x679010
    static int32_t wal(Decimal a);  // RVA: 0x679AB0
    static int32_t wak(bool a);  // RVA: 0x679AA0
    static int32_t mre(int64_t a);  // RVA: 0x679200
    static int32_t waq(int64_t a);  // RVA: 0x67A0B0
    static bool waf(Char[][] a, int32_t b);  // RVA: 0x679750
    static int32_t jcq(Char[][] a);  // RVA: 0x6787F0
    static bool dje(Vector3Int a, int32_t b);  // RVA: 0x677870
    static int32_t oca(uint64_t a);  // RVA: 0x679320
    static bool bbj(Vector2Int a, int32_t b);  // RVA: 0x677060
    static bool wad(float a, int32_t b);  // RVA: 0x6796F0
    static int32_t lpo(BigInteger a);  // RVA: 0x678D20
    static bool ndr(Vector2 a, int32_t b);  // RVA: 0x678B70
    static int32_t ko(uint32_t a);  // RVA: 0x678C20
    static int32_t mrj(Il2CppString* a);  // RVA: 0x6792A0
    static int32_t wai(a a);  // RVA: 0x564160
    static int32_t sv(Quaternion a);  // RVA: 0x6778A0
    static int32_t wav(Quaternion a);  // RVA: 0x6778A0
    static bool vzr(BigInteger a, int32_t b);  // RVA: 0x677AD0
    static bool gft(uint64_t a, int32_t b);  // RVA: 0x678370
    static int32_t mcx(DateTime a);  // RVA: 0x6790D0
    static bool vzz(Vector2 a, int32_t b);  // RVA: 0x678B70
    static int32_t dst(Vector3Int a);  // RVA: 0x677B00
    static bool wab(Vector3 a, int32_t b);  // RVA: 0x6774D0
    static int32_t dkt(Quaternion a);  // RVA: 0x6778A0
    static bool lxf(double a, int32_t b);  // RVA: 0x678AA0
    static int32_t ehm(Il2CppString* a);  // RVA: 0x677C30
    static int32_t blh(BigInteger a);  // RVA: 0x677110
};

// Namespace: <global>
class dat : public CertificateHandler
{
public:

    // Methods
    bool ValidateCertificate(Byte[][] certificateData);  // RVA: 0x67A4D0
    void .ctor();  // RVA: 0x67A4E0
};

// Namespace: <global>
class dau
{
public:

    // Methods
    static bool fux(float a, float b, float c);  // RVA: 0x67A620
    static bool lwq(float a, float b, float c);  // RVA: 0x67A6D0
    static bool wbd(double a, double b, double c);  // RVA: 0x67A8E0
    static bool mut(float a, float b, float c);  // RVA: 0x67A780
    static bool dkb(double a, double b, double c);  // RVA: 0x67A4F0
    static bool wbc(float a, float b, float c);  // RVA: 0x67A830
};

// Namespace: <global>
class dav
{
public:

    // Methods
    static void wbe(System.IProgress<CodeStage.AntiCheat.Genuine.CodeHash.FilesProgress> a, int32_t b, int32_t c, int64_t d, Il2CppString* e);  // RVA: 0x67AA10
};

// Namespace: <global>
class daw
{
public:

    // Methods
    static uint8_t gmr();  // RVA: 0x67ADD0
    static int8_t wbh();  // RVA: 0x67B300
    static uint8_t wbg();  // RVA: 0x67B2B0
    static int16_t wbj();  // RVA: 0x67B3A0
    static uint32_t bkv();  // RVA: 0x67AB40
    static uint32_t lkr();  // RVA: 0x67AB40
    static int32_t wbl();  // RVA: 0x67AB40
    static int64_t ona();  // RVA: 0x67B180
    static uint64_t eeg();  // RVA: 0x67AC30
    static uint32_t wbm();  // RVA: 0x67AB40
    static uint16_t gic();  // RVA: 0x67AD30
    static int16_t knf();  // RVA: 0x67AF60
    static uint16_t wbk();  // RVA: 0x67B3F0
    static uint32_t emo();  // RVA: 0x67AB40
    static uint8_t jmp();  // RVA: 0x67AEC0
    static int16_t gkh();  // RVA: 0x67AD80
    static Il2CppString* wbf(int32_t a);  // RVA: 0x67B1D0
    static wchar_t kky();  // RVA: 0x67AF10
    static wchar_t wbi();  // RVA: 0x67B350
    static Il2CppString* mzk(int32_t a);  // RVA: 0x67B050
    static int16_t en();  // RVA: 0x67AC90
    static int64_t hhp();  // RVA: 0x67AE70
    static wchar_t lc();  // RVA: 0x67AFB0
    static uint64_t wbo();  // RVA: 0x67AC30
    static int64_t wbn();  // RVA: 0x67AC30
    static int32_t fry();  // RVA: 0x67ACE0
    static wchar_t bsy();  // RVA: 0x67AB90
    static int64_t cbk();  // RVA: 0x67ABE0
    static uint32_t fjx();  // RVA: 0x67AB40
    static void wbp(Char[][] a);  // RVA: 0x67B440
    static wchar_t mjy();  // RVA: 0x67B000
    static int16_t hck();  // RVA: 0x67AE20
    static int32_t nvs();  // RVA: 0x67B130
    static uint64_t jc();  // RVA: 0x67AC30
};

// Namespace: <global>
class dax
{
public:
    // Static fields
    // static Char[][] bmoh;


    // Methods
    static Char[][] osk(Byte[][] a);  // RVA: 0x67B810
    static Il2CppString* grf(Byte[][] a, int32_t b, int32_t c);  // RVA: 0x67B7B0
    static Byte[][] lyp(Il2CppString* a);  // RVA: 0x67B6E0
    static Char[][] wbs(Byte[][] a);  // RVA: 0x67B810
    static Il2CppString* czc(Byte[][] a);  // RVA: 0x67B770
    static Byte[][] cte(Il2CppString* a);  // RVA: 0x67B6E0
    static Il2CppString* wbu(Byte[][] a, int32_t b, int32_t c);  // RVA: 0x67B7B0
    static Il2CppString* wbt(Byte[][] a);  // RVA: 0x67B770
    static Byte[][] yh(Char[][] a);  // RVA: 0x67B730
    static Il2CppString* dco(Byte[][] a, int32_t b, int32_t c);  // RVA: 0x67B7B0
    static Il2CppString* wbv(Byte[][] a);  // RVA: 0x67BB50
    static Il2CppString* bnt(Byte[][] a);  // RVA: 0x67B560
    static Il2CppString* hfa(Byte[][] a);  // RVA: 0x67B770
    static Byte[][] wbr(Il2CppString* a);  // RVA: 0x67B6E0
    static Char[][] gpc(Byte[][] a);  // RVA: 0x67B810
    static Char[][] ehr(Byte[][] a);  // RVA: 0x67B810
    static Byte[][] wbq(Char[][] a);  // RVA: 0x67B730
    static Byte[][] ctj(Char[][] a);  // RVA: 0x67B730
    static void .cctor();  // RVA: 0x67B4D0
    static Il2CppString* dtv(Byte[][] a);  // RVA: 0x67B770
    static Byte[][] flv(Il2CppString* a);  // RVA: 0x67B6E0
    static Byte[][] dsk(Il2CppString* a);  // RVA: 0x67B6E0
    static Char[][] lml(Byte[][] a);  // RVA: 0x67B810
    static Il2CppString* juv(Byte[][] a);  // RVA: 0x67B9D0
    static Il2CppString* izr(Byte[][] a);  // RVA: 0x67B850
    static Il2CppString* fet(Byte[][] a);  // RVA: 0x67B770
};

// Namespace: <global>
class day`1
{
public:
    System.Collections.Concurrent.ConcurrentBag<a> bmoi; // 0x0000
    System.Func<a> bmoj; // 0x0000

    // Methods
    void gkp();  // RVA: 0x42E240
    a wbw();  // RVA: 0x564160
    void wby();  // RVA: 0x42E240
    void .ctor(System.Func<a> a);  // RVA: 0x418A00
    void wbx(a a);  // RVA: 0x564160
    void lda();  // RVA: 0x42E240
    void bix();  // RVA: 0x42E240
};

// Namespace: <global>
class daz
{
public:
    // Static fields
    // static Random* bmok;
    // static Random* bmol;


    // Methods
    static void mzm(Byte[][] a);  // RVA: 0x67C640
    static void wcb(Byte[][] a);  // RVA: 0x67CFF0
    static void ux(Byte[][] a);  // RVA: 0x67C8D0
    static int32_t lec(int32_t a, int32_t b);  // RVA: 0x67C3A0
    static int64_t wcd(Random* a, int64_t b, int64_t c);  // RVA: 0x67D590
    static void wce(Random* a, Char[][] b);  // RVA: 0x67D610
    static void wcc(Char[][] a);  // RVA: 0x67D280
    static void .cctor();  // RVA: 0x67BCD0
    static int64_t ioq(Random* a, int64_t b, int64_t c);  // RVA: 0x67C320
    static int32_t wbz(int32_t a, int32_t b);  // RVA: 0x67CB60
    static int64_t ljs(Random* a, int64_t b, int64_t c);  // RVA: 0x67C5C0
    static void ilo(Byte[][] a);  // RVA: 0x67C090
    static int64_t wca(int64_t a, int64_t b);  // RVA: 0x67CD80
    static void bxt(Byte[][] a);  // RVA: 0x67BD50
    static void hbq(Random* a, Char[][] b);  // RVA: 0x67BFE0
};

// Namespace: <global>
class dba
{
public:
    // Static fields
    // static int64_t bmom;


    // Methods
    static int64_t goc();  // RVA: 0x67D8D0
    static int64_t wci();  // RVA: 0x67DBD0
    static int64_t wcf();  // RVA: 0x67DAE0
    static double wcg();  // RVA: 0x67DB40
    static int64_t wcj();  // RVA: 0x67DBF0
    static int64_t wch();  // RVA: 0x67DBB0
    static double lse();  // RVA: 0x67D9D0
    static int64_t izy();  // RVA: 0x67D950
    static int64_t gqm();  // RVA: 0x67D8F0
    static int64_t lap();  // RVA: 0x67D9B0
    static int64_t ow();  // RVA: 0x67DA80
    static int64_t cda();  // RVA: 0x67D730
    static int64_t oew();  // RVA: 0x67DA40
    static double doc();  // RVA: 0x67D770
    static int64_t fti();  // RVA: 0x67D800
    static double fuc();  // RVA: 0x67D860
    static int64_t bvl();  // RVA: 0x67D710
    static int64_t cgr();  // RVA: 0x67D750
    static int64_t ege();  // RVA: 0x67D7E0
    static double bcc();  // RVA: 0x67D6A0
    static int64_t orq();  // RVA: 0x67DA60
};

// Namespace: <global>
class dbb
{
public:
    // Static fields
    // static uint32_t bmon;
    // static uint32_t bmoo;
    // static uint32_t bmop;
    // static uint32_t bmoq;
    // static uint32_t bmor;


    // Methods
    static uint32_t wcl(Stream* a, int64_t b, uint32_t c);  // RVA: 0x67E4B0
    static uint32_t cdi(Byte[][] a, int32_t b, uint32_t c);  // RVA: 0x67DC10
    static uint32_t kef(Byte[][] a, int32_t b, uint32_t c);  // RVA: 0x67DE30
    static uint32_t wck(Byte[][] a, int32_t b, uint32_t c);  // RVA: 0x67E080
};

// Namespace: <global>
class dbc : public dcy`1
{
public:
    // Static fields
    // static bool bmos;
    // static bool bmot;
    // static float bmou;
    // static float bmov;
    // static float bmow;
    // static float bmox;
    // static float bmoy;
    // static float bmoz;
    // static bool bmpa;

    uint8_t pad_0000[0x30]; // 0x0000
    int64_t bmpb; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    int64_t bmpc; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    int64_t bmpd; // 0x0040

    // Methods
    void Update();  // RVA: 0x67E910
    void jog();  // RVA: 0x67F480
    static float wct();  // RVA: 0x6800C0
    static void wcv(float a);  // RVA: 0x680190
    static float wcs();  // RVA: 0x680000
    void kko();  // RVA: 0x67F550
    static void oeq();  // RVA: 0x67F830
    void wcy();  // RVA: 0x680480
    void esq();  // RVA: 0x67F1B0
    static float wcu();  // RVA: 0x680180
    static void wcm();  // RVA: 0x67FA60
    bool wcw();  // RVA: 0x6801A0
    void wcx();  // RVA: 0x6803B0
    void .ctor();  // RVA: 0x67E9D0
    void eqd();  // RVA: 0x67F0A0
    void wda(Scene a, LoadSceneMode b);  // RVA: 0x680630
    static void wcn();  // RVA: 0x67FAD0
    void dqu();  // RVA: 0x67EDB0
    void bau();  // RVA: 0x67EA10
    static void ece();  // RVA: 0x67EE70
    static float wcq();  // RVA: 0x67FE80
    static float wcp();  // RVA: 0x67FDC0
    bool jdv();  // RVA: 0x67F270
    bool bqr();  // RVA: 0x67EAD0
    void wcz();  // RVA: 0x680590
    static float wcr();  // RVA: 0x67FF40
    void cfp();  // RVA: 0x67ECE0
    bool oep();  // RVA: 0x67F620
    static float wco();  // RVA: 0x67FD00
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct StorageDataType
    {
    public:
        // Static fields
        // static StorageDataType Unknown;
        // static StorageDataType SByte;
        // static StorageDataType Byte;
        // static StorageDataType Int16;
        // static StorageDataType UInt16;
        // static StorageDataType Int32;
        // static StorageDataType UInt32;
        // static StorageDataType Int64;
        // static StorageDataType UInt64;
        // static StorageDataType Char;
        // static StorageDataType Single;
        // static StorageDataType Double;
        // static StorageDataType Decimal;
        // static StorageDataType BigInteger;
        // static StorageDataType Boolean;
        // static StorageDataType String;
        // static StorageDataType DateTime;
        // static StorageDataType ByteArray;
        // static StorageDataType Vector2;
        // static StorageDataType Vector2Int;
        // static StorageDataType Vector3;
        // static StorageDataType Vector3Int;
        // static StorageDataType Vector4;
        // static StorageDataType Quaternion;
        // static StorageDataType Color;
        // static StorageDataType Color32;
        // static StorageDataType Rect;
        // static StorageDataType RectInt;
        // static StorageDataType RangeInt;
        // static StorageDataType Matrix4x4;
        // static StorageDataType Ray;
        // static StorageDataType Ray2D;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredPrefsData
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        StorageDataType type; // 0x0010
        uint8_t pad_0011[0x7]; // 0x0011
        Byte[][] data; // 0x0018
    
        // Methods
        void .ctor(StorageDataType type, Byte[][] data);  // RVA: 0x6755D0
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbd
{
public:

    // Methods
    static Color32 hgt(Byte[][] a);  // RVA: 0x6806B0
    static ObscuredPrefsData wdc(a a);  // RVA: 0x564160
    static Color32 kkm(Byte[][] a);  // RVA: 0x680710
    static c wde(Byte[][] a);  // RVA: 0x564160
    static d wdf(StorageDataType a, Byte[][] b);  // RVA: 0x564160
    static Color32 hio(Byte[][] a);  // RVA: 0x6806E0
    static f wdh(StorageDataType a, Byte[][] b);  // RVA: 0x564160
    static Byte[][] wdi(T a);  // RVA: 0x564160
    static T wdj(Byte[][] a);  // RVA: 0x564160
    static b wdd(ObscuredPrefsData a);  // RVA: 0x564160
    static Byte[][] wdg(StorageDataType a, e b);  // RVA: 0x564160
    static Color32 wdb(Byte[][] a);  // RVA: 0x680740
};

// Namespace: <global>
class dbe
{
public:
    // Static fields
    // static Type* bmpe;
    // static Type* bmpf;
    // static Type* bmpg;
    // static Type* bmph;
    // static Type* bmpi;
    // static Type* bmpj;
    // static Type* bmpk;
    // static Type* bmpl;
    // static Type* bmpm;
    // static Type* bmpn;
    // static Type* bmpo;
    // static Type* bmpp;
    // static Type* bmpq;
    // static Type* bmpr;
    // static Type* bmps;
    // static Type* bmpt;
    // static Type* bmpu;
    // static Type* bmpv;
    // static Type* bmpw;
    // static Type* bmpx;
    // static Type* bmpy;
    // static Type* bmpz;
    // static Type* bmqa;
    // static Type* bmqb;
    // static Type* bmqc;
    // static Type* bmqd;
    // static Type* bmqe;
    // static Type* bmqf;
    // static Type* bmqg;
    // static Type* bmqh;
    // static Type* bmqi;


    // Methods
    static StorageDataType wdk();  // RVA: 0x421720
    static void .cctor();  // RVA: 0x680780
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    class UnsupportedDataTypeException : public Exception
    {
    public:
    
        // Methods
        void .ctor(Type* type);  // RVA: 0x675650
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class HashCheckSumModifierDelegate : public MulticastDelegate
{
public:

    // Methods
    void .ctor(Il2CppObject* object, intptr_t method);  // RVA: 0x674A80
    Byte[][] Invoke(Il2CppString* input);  // RVA: 0x674920
    IAsyncResult* BeginInvoke(Il2CppString* input, AsyncCallback* callback, Il2CppObject* object);  // RVA: 0x674A50
    Byte[][] EndInvoke(IAsyncResult* result);  // RVA: 0x674910
};

// Namespace: <global>
class dbf
{
public:
    // Static fields
    // static Il2CppString* bmqj;

    uint8_t pad_0000[0x10]; // 0x0000
    uint32_t bmqk; // 0x0010
    uint8_t pad_0011[0x3]; // 0x0011
    uint32_t bmql; // 0x0014
    uint8_t pad_0015[0x3]; // 0x0015
    HashCheckSumModifierDelegate* bmqm; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bool <bmqn>k__BackingField; // 0x0020

    // Methods
    bool wdp();  // RVA: 0x675220
    static void wdm(Il2CppString* a);  // RVA: 0x681530
    static Il2CppString* wdl();  // RVA: 0x681480
    void .ctor(uint32_t a);  // RVA: 0x681030
    uint32_t wdv(Il2CppString* a);  // RVA: 0x681840
    static void erz();  // RVA: 0x681170
    void igz(HashCheckSumModifierDelegate* a);  // RVA: 0x681060
    void wdu();  // RVA: 0x681830
    void ljw(bool a);  // RVA: 0x681370
    void wdt(bool a);  // RVA: 0x681370
    static Il2CppString* wdo();  // RVA: 0x681690
    void wdq(bool a);  // RVA: 0x6816D0
    void flm(HashCheckSumModifierDelegate* a);  // RVA: 0x681060
    void iep(HashCheckSumModifierDelegate* a);  // RVA: 0x681060
    static void wdn();  // RVA: 0x681590
    void cvc(HashCheckSumModifierDelegate* a);  // RVA: 0x681060
    uint32_t wdr();  // RVA: 0x6816E0
    static void itw();  // RVA: 0x681270
    static void doe();  // RVA: 0x681070
    static void nxr();  // RVA: 0x681380
    void wds(HashCheckSumModifierDelegate* a);  // RVA: 0x681060
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct DeviceLockLevel
    {
    public:
        // Static fields
        // static DeviceLockLevel None;
        // static DeviceLockLevel Soft;
        // static DeviceLockLevel Strict;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbg
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    DeviceLockLevel <bmqo>k__BackingField; // 0x0010
    DeviceLockTamperingSensitivity <bmqp>k__BackingField; // 0x0011

    // Methods
    DeviceLockLevel wdw();  // RVA: 0x675500
    void wdx(DeviceLockLevel a);  // RVA: 0x6819B0
    DeviceLockTamperingSensitivity wdy();  // RVA: 0x6819C0
    void wdz(DeviceLockTamperingSensitivity a);  // RVA: 0x6819D0
    void .ctor(DeviceLockLevel a, DeviceLockTamperingSensitivity b);  // RVA: 0x681970
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct DeviceLockTamperingSensitivity
    {
    public:
        // Static fields
        // static DeviceLockTamperingSensitivity Disabled;
        // static DeviceLockTamperingSensitivity Low;
        // static DeviceLockTamperingSensitivity Normal;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

    // Namespace: CodeStage.AntiCheat.Storage
    class DeviceUniqueIdentifierException : public BackgroundThreadAccessException
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x6749E0
    };

    // Namespace: CodeStage.AntiCheat.Storage
    class PersistentDataPathException : public BackgroundThreadAccessException
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x6755F0
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbh
{
public:
    // Static fields
    // static Il2CppString* bmqq;
    // static Il2CppString* bmqr;
    // static dbf* bmqs;

    uint8_t pad_0000[0x10]; // 0x0000
    Action* bmqt; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Action* bmqu; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    dbr* <bmqv>k__BackingField; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Il2CppString* <bmqw>k__BackingField; // 0x0028

    // Methods
    ObscuredFileReadResult jnw();  // RVA: 0x682930
    void wed(Action* a);  // RVA: 0x685CB0
    void hkp(Stream* a);  // RVA: 0x683280
    void .ctor();  // RVA: 0x681BA0
    ObscuredFileReadResult iim();  // RVA: 0x6833F0
    ObscuredFileHeader wem(Stream* a);  // RVA: 0x684060
    ObscuredFileWriteResult gdg(Byte[][] a);  // RVA: 0x682C80
    static void weh(Il2CppString* a);  // RVA: 0x685D70
    void exp(Stream* a, DeviceLockLevel b);  // RVA: 0x682BF0
    void web(Action* a);  // RVA: 0x685B70
    void .ctor(dbs* a);  // RVA: 0x681A60
    void .ctor(Il2CppString* a, dbr* b);  // RVA: 0x681C60
    void wep(Stream* a, DeviceLockLevel b);  // RVA: 0x686FE0
    ObscuredFileReadResult mda();  // RVA: 0x684DD0
    void wec(Action* a);  // RVA: 0x685C10
    void icc(Stream* a, DeviceLockLevel b);  // RVA: 0x6832F0
    ObscuredFileReadResult lbz();  // RVA: 0x684160
    void exb();  // RVA: 0x682BC0
    void gts(Stream* a);  // RVA: 0x683180
    bool wef();  // RVA: 0x685D50
    ObscuredFileWriteResult wej(Byte[][] a);  // RVA: 0x6840C0
    void .ctor(Il2CppString* a);  // RVA: 0x681B00
    Il2CppString* env(Il2CppString* a);  // RVA: 0x682970
    ObscuredFileReadResult wek();  // RVA: 0x682930
    void mit();  // RVA: 0x682BC0
    void wea(Action* a);  // RVA: 0x685AD0
    void igu(Stream* a);  // RVA: 0x683380
    ObscuredFileReadResult brb();  // RVA: 0x681CC0
    ObscuredFileWriteResult iyp(Byte[][] a);  // RVA: 0x6840C0
    void qg(Stream* a, DeviceLockLevel b);  // RVA: 0x685A40
    dbr* wee();  // RVA: 0x639E40
    ObscuredFileWriteResult wen(Byte[][] a);  // RVA: 0x686A70
    void kpf();  // RVA: 0x682BC0
    void weo(Stream* a);  // RVA: 0x686F70
    Il2CppString* weq(Il2CppString* a);  // RVA: 0x687070
    ObscuredFileHeader isb(Stream* a);  // RVA: 0x684060
    void wei();  // RVA: 0x682BC0
    ObscuredFileReadResult wel();  // RVA: 0x685E00
    Il2CppString* weg();  // RVA: 0x685D60
    ObscuredFileReadResult dxw();  // RVA: 0x682930
    ObscuredFileHeader mna(Stream* a);  // RVA: 0x684060
    void kvm();  // RVA: 0x682BC0
    ObscuredFileReadResult cfh();  // RVA: 0x682930
    void jhh(Stream* a);  // RVA: 0x6840F0
    void gty(Stream* a, DeviceLockLevel b);  // RVA: 0x6831F0
    static void .cctor();  // RVA: 0x6819E0
};

// Namespace: <global>
class dbi
{
public:
    // Static fields
    // static int32_t bmqx;
    // static int32_t bmqy;
    // static Byte[][] bmqz;


    // Methods
    static void wer(Stream* a, Stream* b, dbq* c);  // RVA: 0x687580
    static uint32_t bgj(Stream* a);  // RVA: 0x6872F0
    static void wez(Stream* a, Stream* b, dbq* c);  // RVA: 0x687860
    static void wev(Stream* a, uint32_t b);  // RVA: 0x687760
    static uint32_t ell(Stream* a);  // RVA: 0x6873D0
    static uint32_t wey(Byte[][] a);  // RVA: 0x687840
    static void kxu(Stream* a, Stream* b, dbq* c);  // RVA: 0x687580
    static uint32_t giy(Stream* a);  // RVA: 0x6874F0
    static uint32_t weu(Stream* a);  // RVA: 0x6876D0
    static void lcc(Stream* a, Stream* b, dbq* c);  // RVA: 0x687580
    static uint32_t frf(Stream* a);  // RVA: 0x687460
    static void lyd(Stream* a, Stream* b, dbq* c);  // RVA: 0x687330
    static uint32_t wew(Stream* a);  // RVA: 0x687690
    static void csk(Stream* a, Stream* b, dbq* c);  // RVA: 0x687330
    static void fud(Stream* a, Stream* b, dbq* c);  // RVA: 0x687330
    static void wes(Stream* a, Stream* b, dbq* c);  // RVA: 0x687330
    static uint32_t wet(Stream* a);  // RVA: 0x687690
    static uint32_t dwa(Stream* a);  // RVA: 0x687340
    static void wex(Stream* a, Stream* b, dbq* c);  // RVA: 0x687580
    static uint32_t luy(Byte[][] a);  // RVA: 0x687630
    static uint32_t noq(Stream* a);  // RVA: 0x687650
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileHeader
    {
    public:
        // Static fields
        // static uint8_t HeaderByte1;
        // static uint8_t HeaderByte2;
        // static uint8_t HeaderByte3;
        // static uint8_t HeaderByte4;
        // static uint8_t HeaderVersion;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t <Byte1>k__BackingField; // 0x0010
        uint8_t <Byte2>k__BackingField; // 0x0011
        uint8_t <Byte3>k__BackingField; // 0x0012
        uint8_t <Byte4>k__BackingField; // 0x0013
        uint8_t <Version>k__BackingField; // 0x0014
        ObscurationMode <ObscurationMode>k__BackingField; // 0x0015
    
        // Methods
        uint8_t get_Byte1();  // RVA: 0x674C50
        void set_Byte1(uint8_t value);  // RVA: 0x674CF0
        uint8_t get_Byte2();  // RVA: 0x674CA0
        void set_Byte2(uint8_t value);  // RVA: 0x674D00
        uint8_t get_Byte3();  // RVA: 0x674CB0
        void set_Byte3(uint8_t value);  // RVA: 0x674D10
        uint8_t get_Byte4();  // RVA: 0x674CC0
        void set_Byte4(uint8_t value);  // RVA: 0x674D20
        uint8_t get_Version();  // RVA: 0x674CE0
        void set_Version(uint8_t value);  // RVA: 0x674D40
        ObscurationMode get_ObscurationMode();  // RVA: 0x674CD0
        void set_ObscurationMode(ObscurationMode value);  // RVA: 0x674D30
        bool IsValid();  // RVA: 0x674C70
        void wfa(Stream* a);  // RVA: 0x674D50
        static void wfb(Stream* a, ObscurationMode b);  // RVA: 0x674E10
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileErrorCode
    {
    public:
        // Static fields
        // static ObscuredFileErrorCode NoError;
        // static ObscuredFileErrorCode FileNotFound;
        // static ObscuredFileErrorCode FileDamaged;
        // static ObscuredFileErrorCode DataIsNotLocked;
        // static ObscuredFileErrorCode NotInitialized;
        // static ObscuredFileErrorCode OtherException;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileError
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        ObscuredFileErrorCode <ErrorCode>k__BackingField; // 0x0010
        uint8_t pad_0011[0x7]; // 0x0011
        Exception* <Exception>k__BackingField; // 0x0018
    
        // Methods
        ObscuredFileErrorCode get_ErrorCode();  // RVA: 0x674C50
        Exception* get_Exception();  // RVA: 0x674C60
        void .ctor(ObscuredFileErrorCode code);  // RVA: 0x674C30
        void .ctor(Exception* exception);  // RVA: 0x674C20
        Il2CppString* ToString();  // RVA: 0x674B40
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileReadResult
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        Byte[][] <Data>k__BackingField; // 0x0010
        uint8_t pad_0011[0x7]; // 0x0011
        bool <DataIsNotGenuine>k__BackingField; // 0x0018
        bool <DataFromAnotherDevice>k__BackingField; // 0x0019
        uint8_t pad_001A[0x6]; // 0x001A
        ObscuredFileError <Error>k__BackingField; // 0x0020
        uint8_t pad_0021[0xF]; // 0x0021
        bool <IsValid>k__BackingField; // 0x0030
    
        // Methods
        bool wfc();  // RVA: 0x675230
        Byte[][] get_Data();  // RVA: 0x675200
        bool wfd();  // RVA: 0x675260
        bool get_DataIsNotGenuine();  // RVA: 0x6751F0
        bool get_DataFromAnotherDevice();  // RVA: 0x6751E0
        ObscuredFileError get_Error();  // RVA: 0x675210
        bool get_IsValid();  // RVA: 0x675220
        void .ctor(Byte[][] data, bool dataIsNotGenuine, bool dataFromAnotherDevice);  // RVA: 0x675190
        void .ctor(ObscuredFileError error);  // RVA: 0x675140
        static ObscuredFileReadResult wfe(Exception* a);  // RVA: 0x675270
        static ObscuredFileReadResult wff(ObscuredFileErrorCode a);  // RVA: 0x6752F0
        Il2CppString* ToString();  // RVA: 0x674ED0
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileWriteResult
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        ObscuredFileError <Error>k__BackingField; // 0x0010
        uint8_t pad_0011[0xF]; // 0x0011
        bool <IsValid>k__BackingField; // 0x0020
    
        // Methods
        bool wfg();  // RVA: 0x675510
        ObscuredFileError get_Error();  // RVA: 0x6754F0
        bool get_IsValid();  // RVA: 0x675500
        void .ctor(ObscuredFileErrorCode result);  // RVA: 0x6754A0
        void .ctor(ObscuredFileError error);  // RVA: 0x675470
        static ObscuredFileWriteResult wfh(Exception* a);  // RVA: 0x675520
        static ObscuredFileWriteResult wfi(ObscuredFileErrorCode a);  // RVA: 0x675570
        Il2CppString* ToString();  // RVA: 0x675370
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbj
{
public:
    // Static fields
    // static Il2CppString* bmra;
    // static Il2CppString* bmrb;
    // static Action* bmrc;
    // static Action* bmrd;
    // static dbh* bmre;
    // static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> bmrf;
    // static Il2CppObject* bmrg;
    // static bool <bmrh>k__BackingField;
    // static bool <bmri>k__BackingField;
    // static bool <bmrj>k__BackingField;
    // static ObscuredFileReadResult <bmrk>k__BackingField;
    // static ObscuredFileWriteResult <bmrl>k__BackingField;
    // static dbm* <bmrm>k__BackingField;


    // Methods
    static ObscuredDouble llg(Il2CppString* a, ObscuredDouble b);  // RVA: 0x68D670
    static dbh* ixk(Il2CppString* a, dbr* b);  // RVA: 0x68BC40
    static ObscuredFileWriteResult wip();  // RVA: 0x6932A0
    static ObscuredDateTimeOffset dyq(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x689720
    static void wfp(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x68F710
    static void jey(Il2CppString* a, dbr* b, bool c);  // RVA: 0x68BEA0
    static ObscuredFloat wgo(Il2CppString* a, ObscuredFloat b);  // RVA: 0x6907C0
    static ObscuredDateTimeOffset nfr(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x68E230
    static ObscuredByte wgh(Il2CppString* a, ObscuredByte b);  // RVA: 0x6901F0
    static ObscuredVector3Int new(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x68E130
    static void cla();  // RVA: 0x6884B0
    static void wib(Il2CppString* a, dbr* b, bool c);  // RVA: 0x692070
    static ObscuredVector2Int myj(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x68DF10
    static void etv();  // RVA: 0x68A040
    static void dgg(Il2CppString* a, ObscuredDouble b);  // RVA: 0x688C70
    static void kss(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x68CC60
    static ObscuredVector2 wgz(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x690FE0
    static void wfk(Il2CppString* a, ObscuredByte b);  // RVA: 0x68F410
    static void mlm(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x68DC40
    static dbh* dhr(Il2CppString* a, dbr* b);  // RVA: 0x689150
    static void wgd(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x68FF40
    static ObscuredInt wgq(Il2CppString* a, ObscuredInt b);  // RVA: 0x690980
    static void cqh(dbr* a, bool b);  // RVA: 0x6888B0
    static ObscuredUInt eks(Il2CppString* a, ObscuredUInt b);  // RVA: 0x689910
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> kgq();  // RVA: 0x68C5B0
    static void fot(Il2CppString* a, ObscuredDouble b);  // RVA: 0x68A390
    static dbh* lja(Il2CppString* a, dbr* b);  // RVA: 0x68D550
    static ObscuredQuaternion eoj(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x689A50
    static void jhu(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x68C0E0
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wio();  // RVA: 0x692E60
    static void ibh(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x68B570
    static void wfq(Il2CppString* a, ObscuredDouble b);  // RVA: 0x68F7C0
    static ObscuredDateTimeOffset wgk(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x6903F0
    static void wfw(Il2CppString* a, ObscuredSByte b);  // RVA: 0x68FB70
    static void wgb(Il2CppString* a, ObscuredUShort b);  // RVA: 0x68FE10
    static ObscuredGuid dee(Il2CppString* a, ObscuredGuid b);  // RVA: 0x688AC0
    static void wid();  // RVA: 0x692470
    static ObscuredShort wgu(Il2CppString* a, ObscuredShort b);  // RVA: 0x690C70
    static void wii();  // RVA: 0x692A70
    static void kto(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x68CD00
    static void deo(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x688BC0
    static bool Save();  // RVA: 0x687960
    static void gin(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x68ADE0
    static ObscuredQuaternion wgs(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x690AF0
    static ObscuredVector3 whb(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x691170
    static void whu(ObscuredFileWriteResult a);  // RVA: 0x691C30
    static void whd(Action* a);  // RVA: 0x691370
    static ObscuredShort lzl(Il2CppString* a, ObscuredShort b);  // RVA: 0x68D900
    static ObscuredDateTime wgj(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x690330
    static void whg(Action* a);  // RVA: 0x691650
    static dbr* whh();  // RVA: 0x691750
    static ObscuredULong wgx(Il2CppString* a, ObscuredULong b);  // RVA: 0x690E60
    static ObscuredString* wgv(Il2CppString* a, ObscuredString* b);  // RVA: 0x690D30
    static void nrv(Il2CppString* a, ObscuredUShort b);  // RVA: 0x68E670
    static ObscuredShort fpm(Il2CppString* a, ObscuredShort b);  // RVA: 0x68A430
    static ObscuredGuid gfp(Il2CppString* a, ObscuredGuid b);  // RVA: 0x68ACE0
    static void whn(bool a);  // RVA: 0x691960
    static dbh* whx();  // RVA: 0x691D70
    static void whp(bool a);  // RVA: 0x691A10
    static ObscuredDateTimeOffset mlo(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x68DCF0
    static void hey(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x68B090
    static ObscuredBigInteger wgm(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x6905E0
    static ObscuredGuid wgp(Il2CppString* a, ObscuredGuid b);  // RVA: 0x690880
    static dbm* whv();  // RVA: 0x691CB0
    static ObscuredVector3Int whc(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x691270
    static void wfs(Il2CppString* a, ObscuredGuid b);  // RVA: 0x68F900
    static void mlx(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x68DDE0
    static bool whl();  // RVA: 0x6918B0
    static bool hmi(Il2CppString* a);  // RVA: 0x68B3B0
    static void ocx(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x68E890
    static void wfu(Il2CppString* a, ObscuredLong b);  // RVA: 0x68FA30
    static ObscuredVector3 ivs(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x68BB40
    static void cev(Il2CppString* a, ObscuredUInt b);  // RVA: 0x688430
    static void wic();  // RVA: 0x6922B0
    static ObscuredVector2Int cpj(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x6887F0
    static void kyh(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x68CF30
    static void wij(Il2CppString* a, a b);  // RVA: 0x564160
    static void jbn(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x68BDF0
    static void xe(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x693890
    static void izd(Il2CppString* a, ObscuredULong b);  // RVA: 0x68BD60
    static void dyj(Il2CppString* a, dbr* b, bool c);  // RVA: 0x6894E0
    static bool whi();  // RVA: 0x6917A0
    static ObscuredULong kku(Il2CppString* a, ObscuredULong b);  // RVA: 0x68C9F0
    static void mgz(Il2CppString* a, ObscuredUShort b);  // RVA: 0x68DBB0
    static void nqw(Il2CppString* a, ObscuredChar b);  // RVA: 0x68E5E0
    static ObscuredFloat kvq(Il2CppString* a, ObscuredFloat b);  // RVA: 0x68CDB0
    static bool fqx();  // RVA: 0x68A4F0
    static void wir(Il2CppString* a, d b);  // RVA: 0x564160
    static ObscuredByte msr(Il2CppString* a, ObscuredByte b);  // RVA: 0x68DE90
    static ObscuredFileWriteResult wit(Byte[][] a);  // RVA: 0x693670
    static ObscuredChar wgi(Il2CppString* a, ObscuredChar b);  // RVA: 0x690270
    static ObscuredUShort wgy(Il2CppString* a, ObscuredUShort b);  // RVA: 0x690F20
    static ObscuredLong hiz(Il2CppString* a, ObscuredLong b);  // RVA: 0x68B230
    static void oeh(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x68E930
    static void ijh(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x68B770
    static void wfl(Il2CppString* a, ObscuredChar b);  // RVA: 0x68F490
    static ObscuredUShort vl(Il2CppString* a, ObscuredUShort b);  // RVA: 0x68F2C0
    static void nkz(Il2CppString* a, ObscuredULong b);  // RVA: 0x68E3A0
    static ObscuredFileWriteResult wht();  // RVA: 0x691BC0
    static ObscuredLong obh(Il2CppString* a, ObscuredLong b);  // RVA: 0x68E7D0
    static dbh* wil(Il2CppString* a, dbr* b);  // RVA: 0x692C60
    static ObscuredFileReadResult whr();  // RVA: 0x691AC0
    static void qm(Il2CppString* a, ObscuredDouble b);  // RVA: 0x68F110
    static void iia(dbr* a, bool b);  // RVA: 0x68B620
    static void wim();  // RVA: 0x692D80
    static void whz(Il2CppString* a, bool b);  // RVA: 0x691F40
    static void fgk(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x68A2E0
    static ObscuredSByte wgt(Il2CppString* a, ObscuredSByte b);  // RVA: 0x690BF0
    static ObscuredLong hsk(Il2CppString* a, ObscuredLong b);  // RVA: 0x68B430
    static ObscuredInt fey(Il2CppString* a, ObscuredInt b);  // RVA: 0x68A230
    static ObscuredVector2Int wha(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x6910B0
    static void wfz(Il2CppString* a, ObscuredUInt b);  // RVA: 0x68FD00
    static void lxn(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x68D850
    static void imy(Il2CppString* a, ObscuredShort b);  // RVA: 0x68B950
    static void wge(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x68FFD0
    static c wiq(Il2CppString* a, c b);  // RVA: 0x564160
    static void cvw(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x688A10
    static ObscuredLong wgr(Il2CppString* a, ObscuredLong b);  // RVA: 0x690A30
    static void kdf(Il2CppString* a, ObscuredULong b);  // RVA: 0x68C520
    static ObscuredByte lva(Il2CppString* a, ObscuredByte b);  // RVA: 0x68D7D0
    static bool whk();  // RVA: 0x691850
    static bool dlm(Il2CppString* a);  // RVA: 0x6893B0
    static bool who();  // RVA: 0x6919C0
    static System.Collections.Generic.ICollection<System.String> wig();  // RVA: 0x692900
    static void win();  // RVA: 0x692DF0
    static Il2CppString* whq();  // RVA: 0x691A70
    static ObscuredDecimal wgl(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x6904E0
    static ObscuredFloat hjf(Il2CppString* a, ObscuredFloat b);  // RVA: 0x68B2F0
    static void fxj(dbr* a, bool b);  // RVA: 0x68AB40
    static void sx(Il2CppString* a, ObscuredUInt b);  // RVA: 0x68F240
    static void wfm(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x68F520
    static void wie(bool a);  // RVA: 0x6927A0
    static ObscuredVector3 ohi(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x68EBE0
    static void nlf(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x68E430
    static void kll(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x68CAB0
    static void wfn(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x68F5B0
    static void dug(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x689430
    static ObscuredVector2 oac(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x68E700
    static ObscuredFileReadResult wis();  // RVA: 0x693490
    static void whe(Action* a);  // RVA: 0x691460
    static void liz();  // RVA: 0x68D360
    static void wih(Il2CppString* a);  // RVA: 0x692980
    static ObscuredDateTimeOffset fwk(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x68A950
    static void why(bool a);  // RVA: 0x691E80
    static ObscuredVector2 ncm(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x68E060
    static void wga(Il2CppString* a, ObscuredULong b);  // RVA: 0x68FD80
    static void whj(bool a);  // RVA: 0x6917F0
    static System.Collections.Generic.ICollection<System.String> ik();  // RVA: 0x68B820
    static void mbh(Il2CppString* a);  // RVA: 0x68DAC0
    static void .cctor();  // RVA: 0x687D00
    static ObscuredUShort jua(Il2CppString* a, ObscuredUShort b);  // RVA: 0x68C300
    static void jxe(Il2CppString* a, ObscuredULong b);  // RVA: 0x68C3C0
    static void btf(Il2CppString* a, dbr* b, bool c);  // RVA: 0x6880B0
    static ObscuredGuid kqw(Il2CppString* a, ObscuredGuid b);  // RVA: 0x68CB60
    static void sc(Il2CppString* a, ObscuredLong b);  // RVA: 0x68F1B0
    static bool whm();  // RVA: 0x691910
    static void wgc(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x68FEA0
    static void nac(Il2CppString* a, ObscuredLong b);  // RVA: 0x68DFD0
    static ObscuredDateTime diq(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x6892F0
    static bool dim(Il2CppString* a);  // RVA: 0x689270
    static ObscuredBool fsq(Il2CppString* a, ObscuredBool b);  // RVA: 0x68A890
    static void wfr(Il2CppString* a, ObscuredFloat b);  // RVA: 0x68F860
    static ObscuredQuaternion npz(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x68E4E0
    static void qk(Il2CppString* a, dbr* b, bool c);  // RVA: 0x68EED0
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> dgk();  // RVA: 0x688D10
    static ObscuredUInt etm(Il2CppString* a, ObscuredUInt b);  // RVA: 0x689B50
    static ObscuredBool wgg(Il2CppString* a, ObscuredBool b);  // RVA: 0x690130
    static ObscuredBool cof(Il2CppString* a, ObscuredBool b);  // RVA: 0x688730
    static ObscuredULong iqq(Il2CppString* a, ObscuredULong b);  // RVA: 0x68BA80
    static void wfo(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x68F660
    static ObscuredUShort bri(Il2CppString* a, ObscuredUShort b);  // RVA: 0x687F10
    static ObscuredQuaternion gom(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x68AE90
    static void inw(Il2CppString* a, ObscuredDouble b);  // RVA: 0x68B9E0
    static void whf(Action* a);  // RVA: 0x691550
    static ObscuredBool kyc(Il2CppString* a, ObscuredBool b);  // RVA: 0x68CE70
    static ObscuredFileWriteResult oem(Byte[][] a);  // RVA: 0x68E9C0
    static bool wif(Il2CppString* a);  // RVA: 0x692880
    static void ima(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x68B8A0
    static void iig(Il2CppString* a, ObscuredGuid b);  // RVA: 0x68B6C0
    static ObscuredVector2 kce(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x68C450
    static System.Collections.Generic.ICollection<System.String> lnv();  // RVA: 0x68D750
    static ObscuredVector3 fws(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x68AA40
    static void hhf(Il2CppString* a);  // RVA: 0x68B140
    static void emo(Il2CppString* a, ObscuredUShort b);  // RVA: 0x6899C0
    static ObscuredVector3Int mbb(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x68D9C0
    static ObscuredUShort cne(Il2CppString* a, ObscuredUShort b);  // RVA: 0x688670
    static void wfj(Il2CppString* a, ObscuredBool b);  // RVA: 0x68F380
    static void wgf(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x690080
    static ObscuredDouble bsv(Il2CppString* a, ObscuredDouble b);  // RVA: 0x687FD0
    static bool lit();  // RVA: 0x68CFC0
    static void wia(dbr* a, bool b);  // RVA: 0x691FD0
    static ObscuredGuid ejp(Il2CppString* a, ObscuredGuid b);  // RVA: 0x689810
    static ObscuredDouble wgn(Il2CppString* a, ObscuredDouble b);  // RVA: 0x6906E0
    static bool htw(Il2CppString* a);  // RVA: 0x68B4F0
    static void bwl(Il2CppString* a, ObscuredUInt b);  // RVA: 0x6882F0
    static void bfa(Il2CppString* a, ObscuredGuid b);  // RVA: 0x687D80
    static void jjl(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x68C180
    static ObscuredFloat bzt(Il2CppString* a, ObscuredFloat b);  // RVA: 0x688370
    static ObscuredUInt wgw(Il2CppString* a, ObscuredUInt b);  // RVA: 0x690DB0
    static ObscuredBool cqv(Il2CppString* a, ObscuredBool b);  // RVA: 0x688950
    static void jmx(Il2CppString* a);  // RVA: 0x68C210
    static ObscuredDouble bhc(Il2CppString* a, ObscuredDouble b);  // RVA: 0x687E30
    static void whw(dbm* a);  // RVA: 0x691D00
    static ObscuredByte ngf(Il2CppString* a, ObscuredByte b);  // RVA: 0x68E320
    static void wft(Il2CppString* a, ObscuredInt b);  // RVA: 0x68F9B0
    static ObscuredVector3 hbe(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x68AF90
    static b wik(Il2CppString* a, b b);  // RVA: 0x564160
    static void ots();  // RVA: 0x68ECE0
    static void wfy(Il2CppString* a, ObscuredString* b);  // RVA: 0x68FC80
    static void wfx(Il2CppString* a, ObscuredShort b);  // RVA: 0x68FBF0
    static void whs(ObscuredFileReadResult a);  // RVA: 0x691B30
    static ObscuredVector3Int fxo(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x68ABE0
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> ett();  // RVA: 0x689C00
    static void wfv(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x68FAC0
};

// Namespace: <global>
class dbk
{
public:
    // Static fields
    // static bool bmrn;


    // Methods
    static void mrx(bool a);  // RVA: 0x693E80
    static void wiz();  // RVA: 0x694310
    static void wiy(bool a);  // RVA: 0x694220
    static void fmn(bool a);  // RVA: 0x693BB0
    static void ie(bool a);  // RVA: 0x693CA0
    static void wiu();  // RVA: 0x693F70
    static void dqy();  // RVA: 0x693940
    static void wix(bool a);  // RVA: 0x694210
    static void mqm(bool a);  // RVA: 0x693D90
    static void wiw(bool a);  // RVA: 0x694200
    static bool wiv();  // RVA: 0x6941E0
};

// Namespace: <global>
class dbl
{
public:

    // Methods
    static dbo* jwn(dbm* a);  // RVA: 0x694470
    static b wjb(ObscuredPrefsData a, dbm* b);  // RVA: 0x564160
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> fhq(Byte[][] a, dbm* b);  // RVA: 0x694510
    static ObscuredPrefsData wja(a a, dbm* b);  // RVA: 0x564160
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wjd(Byte[][] a, dbm* b);  // RVA: 0x6946D0
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> hub(Byte[][] a, dbm* b);  // RVA: 0x6945F0
    static dbo* cpc(dbm* a);  // RVA: 0x694470
    static dbo* wje(dbm* a);  // RVA: 0x694470
    static dbo* ecm(dbm* a);  // RVA: 0x694470
    static Byte[][] hge(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a, dbm* b);  // RVA: 0x694580
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> dhx(Byte[][] a, dbm* b);  // RVA: 0x6944A0
    static Byte[][] wjc(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a, dbm* b);  // RVA: 0x694660
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct ACTkSerializationKind
    {
    public:
        // Static fields
        // static ACTkSerializationKind Binary;
    
        uint8_t pad_0000[0x10]; // 0x0000
        int32_t value__; // 0x0010
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbm
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    ACTkSerializationKind <bmro>k__BackingField; // 0x0010

    // Methods
    ACTkSerializationKind wjf();  // RVA: 0x674720
    void .ctor(ACTkSerializationKind a);  // RVA: 0x681030
};

// Namespace: <global>
class dbn
{
public:
    // Static fields
    // static uint8_t bmrp;
    // static dbn* bmrq;


    // Methods
    void wjl(BinaryWriter* a, Il2CppString* b, ObscuredPrefsData c);  // RVA: 0x694740
    System.ValueTuple<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> jov(BinaryReader* a);  // RVA: 0x694A90
    System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wjk(Byte[][] a);  // RVA: 0x6950B0
    static dbo* orq();  // RVA: 0x694BA0
    void .ctor();  // RVA: 0x628380
    static dbo* wjg();  // RVA: 0x694C30
    System.ValueTuple<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> hgs(BinaryReader* a);  // RVA: 0x6948F0
    void jiq(BinaryWriter* a, Il2CppString* b, ObscuredPrefsData c);  // RVA: 0x694740
    static dbo* imd();  // RVA: 0x694A00
    b wji(ObscuredPrefsData a);  // RVA: 0x564160
    void cdv(BinaryWriter* a, Il2CppString* b, ObscuredPrefsData c);  // RVA: 0x694740
    Byte[][] wjj(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a);  // RVA: 0x694CC0
    System.ValueTuple<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> fmm(BinaryReader* a);  // RVA: 0x6947E0
    ObscuredPrefsData wjh(a a);  // RVA: 0x564160
    void icl(BinaryWriter* a, Il2CppString* b, ObscuredPrefsData c);  // RVA: 0x694740
    void hzn(BinaryWriter* a, Il2CppString* b, ObscuredPrefsData c);  // RVA: 0x694740
    System.ValueTuple<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wjm(BinaryReader* a);  // RVA: 0x6954C0
};

// Namespace: <global>
class dbo
{
public:

    // Methods
    ObscuredPrefsData wjh(a a);  // RVA: 0x564160
    b wji(ObscuredPrefsData a);  // RVA: 0x564160
    Byte[][] wjj(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a);  // RVA: 0x419890
    System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wjk(Byte[][] a);  // RVA: 0x419890
};

// Namespace: <global>
class dbp
{
public:
    // Static fields
    // static dbp* bmrr;


    // Methods
    static dbo* kjj();  // RVA: 0x695660
    static dbo* wjn();  // RVA: 0x695770
    void .ctor();  // RVA: 0x628380
    Byte[][] wjj(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a);  // RVA: 0x6956F0
    b wji(ObscuredPrefsData a);  // RVA: 0x564160
    static dbo* ire();  // RVA: 0x6955D0
    ObscuredPrefsData wjh(a a);  // RVA: 0x564160
    System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wjk(Byte[][] a);  // RVA: 0x695730
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscurationMode
    {
    public:
        // Static fields
        // static ObscurationMode Plain;
        // static ObscurationMode Encrypted;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbq
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    ObscurationMode <bmrs>k__BackingField; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Byte[][] <bmrt>k__BackingField; // 0x0018

    // Methods
    ObscurationMode wjo();  // RVA: 0x675500
