// ============================================================
// Image: Assembly-CSharp.dll
// ============================================================

// Namespace: <global>
class b : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Unit* OwnerUnit; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Animator* Animatior; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    EUNITSTATE bawj; // 0x0030

    // Methods
    void dto(Il2CppString* a);  // RVA: 0x7FBF40
    void jny(float a);  // RVA: 0x7FBF20
    void hph(Il2CppString* a);  // RVA: 0x7FBF40
    void lds(Il2CppString* a);  // RVA: 0x7FBF40
    void .ctor();  // RVA: 0x628730
    void Update();  // RVA: 0x63D9D0
    void Awake();  // RVA: 0x7FBE60
    void dtn(float a);  // RVA: 0x7FBF20
    void dtm(EUNITSTATE a);  // RVA: 0x417B10
};

// Namespace: <global>
class c : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Action* OnACTIVE; // 0x0020

    // Methods
    void dtp(Action* a);  // RVA: 0x804530
    void dtq();  // RVA: 0x804510
    void mwr();  // RVA: 0x804510
    void llo();  // RVA: 0x804510
    void .ctor();  // RVA: 0x628730
    void dbt();  // RVA: 0x804510
};

// Namespace: <global>
class g
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bawk; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* bawl; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    FlickerController* bawm; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float bawn; // 0x0028

    // Methods
    void .ctor(int32_t a);  // RVA: 0x681030
    void dtr();  // RVA: 0x63D9D0
    bool MoveNext();  // RVA: 0x8045D0
    Il2CppObject* dts();  // RVA: 0x695920
    void dtt();  // RVA: 0x804710
    Il2CppObject* dtu();  // RVA: 0x695920
};

// Namespace: <global>
class FlickerController : public MonoBehaviour
{
public:
    // Static fields
    // static MaterialPropertyBlock* bawo;
    // static int32_t bawp;

    uint8_t pad_0000[0x20]; // 0x0000
    SpriteRenderer* m_spriteRenderer; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float m_targetValue; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    float m_flickTime; // 0x002C
    uint8_t pad_002D[0x3]; // 0x002D
    Coroutine* bawq; // 0x0030

    // Methods
    void Awake();  // RVA: 0x7F27A0
    void dtv();  // RVA: 0x7F28E0
    void dtw();  // RVA: 0x7F2980
    IEnumerator* dtx();  // RVA: 0x7F29D0
    void dty(float a);  // RVA: 0x7F2A40
    void .ctor();  // RVA: 0x628730
    static void .cctor();  // RVA: 0x7F2870
};

// Namespace: <global>
class h : public MonoBehaviour
{
public:

    // Methods
    void Start();  // RVA: 0x63D9D0
    void djo();  // RVA: 0x63D9D0
    void .ctor();  // RVA: 0x628730
    void Update();  // RVA: 0x63D9D0
    void glz();  // RVA: 0x63D9D0
    void ldo();  // RVA: 0x63D9D0
    void bcb();  // RVA: 0x63D9D0
    void hrp();  // RVA: 0x63D9D0
};

// Namespace: <global>
class k : public b
{
public:

    // Methods
    void Update();  // RVA: 0x804750
    void dtm(EUNITSTATE a);  // RVA: 0x804820
    void .ctor();  // RVA: 0x628730
};

// Namespace: <global>
class m : public MonoBehaviour
{
public:

    // Methods
    void Update();  // RVA: 0x63D9D0
    void fak();  // RVA: 0x63D9D0
    void eno();  // RVA: 0x63D9D0
    void vt();  // RVA: 0x63D9D0
    void Start();  // RVA: 0x63D9D0
    void nvl();  // RVA: 0x63D9D0
    void jpx();  // RVA: 0x63D9D0
    void nbp();  // RVA: 0x63D9D0
    void dyt();  // RVA: 0x63D9D0
    void .ctor();  // RVA: 0x628730
};

// Namespace: <global>
class HpBar : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    RectTransform* rect_m; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Slider* slider; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Image* image_Fillarea; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Unit* unit_Attach; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Vector3 monsterOffset; // 0x0040
    uint8_t pad_0041[0xB]; // 0x0041
    Vector3 heroOffset; // 0x004C
    uint8_t pad_004D[0xB]; // 0x004D
    Color color_Monster; // 0x0058
    uint8_t pad_0059[0xF]; // 0x0059
    Color color_Hero; // 0x0068

    // Methods
    void dtz(Unit* a);  // RVA: 0x7F2C10
    void Update();  // RVA: 0x7F2B10
    void dua();  // RVA: 0x7F2D40
    void dub(float a);  // RVA: 0x7F2E70
    void duc();  // RVA: 0x7F2EC0
    void .ctor();  // RVA: 0x7F2B60
};

// Namespace: <global>
class n : public b
{
public:

    // Methods
    void dtm(EUNITSTATE a);  // RVA: 0x8049E0
    void .ctor();  // RVA: 0x628730
};

// Namespace: <global>
struct EUNITSTATE
{
public:
    // Static fields
    // static EUNITSTATE NONE;
    // static EUNITSTATE IDLE;
    // static EUNITSTATE MOVE;
    // static EUNITSTATE RETURN_TO_POSITION;
    // static EUNITSTATE ATTACK;
    // static EUNITSTATE REVIVE;
    // static EUNITSTATE DIE;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
struct EATTACKSTATE
{
public:
    // Static fields
    // static EATTACKSTATE PREDELAY;
    // static EATTACKSTATE ACTIONTIME;
    // static EATTACKSTATE POSTDELAY;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
struct TextDisplayPosition
{
public:
    // Static fields
    // static TextDisplayPosition Center;
    // static TextDisplayPosition Top;
    // static TextDisplayPosition Bottom;
    // static TextDisplayPosition TopOffset;
    // static TextDisplayPosition CenterUp;
    // static TextDisplayPosition CenterDown;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
class o
{
public:
    // Static fields
    // static intptr_t bawr;
    // static int32_t baws;
    // static int32_t bawt;


    // Methods
    static void .cctor();  // RVA: 0x804ED0
    static int32_t RegSetValueEx(intptr_t hKey, Il2CppString* lpValueName, int32_t Reserved, int32_t dwType, Il2CppString* lpData, int32_t cbData);  // RVA: 0x804DE0
    static int32_t RegCloseKey(intptr_t hKey);  // RVA: 0x804BF0
    static uint32_t GetModuleFileName(intptr_t hModule, StringBuilder* lpFilename, int32_t nSize);  // RVA: 0x804B20
    static int32_t RegDeleteValue(intptr_t hKey, Il2CppString* lpValueName);  // RVA: 0x804C70
    static void dud(Il2CppString* a, bool b);  // RVA: 0x804F30
    void .ctor();  // RVA: 0x628380
    static int32_t RegOpenKeyEx(intptr_t hKey, Il2CppString* lpSubKey, int32_t ulOptions, int32_t samDesired, intptr_t phkResult);  // RVA: 0x804D10
};

// Namespace: <global>
class MonitorEnumDelegate : public MulticastDelegate
{
public:

    // Methods
    void .ctor(Il2CppObject* object, intptr_t method);  // RVA: 0x7F38F0
    bool Invoke(intptr_t hMonitor, intptr_t hdcMonitor, intptr_t lprcMonitor, intptr_t dwData);  // RVA: 0x7F38D0
    IAsyncResult* BeginInvoke(intptr_t hMonitor, intptr_t hdcMonitor, intptr_t lprcMonitor, intptr_t dwData, AsyncCallback* callback, Il2CppObject* object);  // RVA: 0x7F37F0
    bool EndInvoke(IAsyncResult* result);  // RVA: 0x7F38A0
};

// Namespace: <global>
class p : public MonoBehaviour
{
public:
    // Static fields
    // static uint32_t bawu;
    // static int32_t bawv;
    // static int32_t baww;
    // static RECT bawx;


    // Methods
    void OnApplicationFocus(bool hasFocus);  // RVA: 0x805660
    void grb();  // RVA: 0x805B30
    static intptr_t MonitorFromWindow(intptr_t hwnd, uint32_t dwFlags);  // RVA: 0x8055D0
    void mzg();  // RVA: 0x805EF0
    void due();  // RVA: 0x805670
    static bool EnumDisplayMonitors(intptr_t hdc, intptr_t lprcClip, MonitorEnumDelegate* lpfnEnum, intptr_t dwData);  // RVA: 0x8053F0
    static bool GetWindowRect(intptr_t hwnd, RECT rect);  // RVA: 0x805540
    void iig();  // RVA: 0x805D10
    void .ctor();  // RVA: 0x628730
    void gsj(bool hasFocus);  // RVA: 0x805660
    static bool GetMonitorInfo(intptr_t hMonitor, MONITORINFO lpmi);  // RVA: 0x8054B0
    void dug();  // RVA: 0x805A60
    static bool duf(intptr_t a, intptr_t b, intptr_t c, intptr_t d);  // RVA: 0x805850
};

// Namespace: <global>
class BoxEffectController : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    System.Collections.Generic.List<SpriteAnimation_Image> animationLists; // 0x0020

    // Methods
    void duh(int32_t a);  // RVA: 0x7F21A0
    bool dui();  // RVA: 0x7F23A0
    void OnDisable();  // RVA: 0x7F20B0
    void .ctor();  // RVA: 0x628730
};

// Namespace: <global>
class q : public MonoBehaviour
{
public:

    // Methods
    void OnPointerDown(PointerEventData* eventData);  // RVA: 0x63D9D0
    void OnPointerUp(PointerEventData* eventData);  // RVA: 0x63D9D0
    void .ctor();  // RVA: 0x628730
};

// Namespace: <global>
class ItemSlotDirectMovePreview : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    RectTransform* RectTransform; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Image* m_hoverTargetImage; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Sprite* m_moveToTradingStashIcon; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Sprite* m_moveToCubeIcon; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Sprite* m_moveToInventoryIcon; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    Sprite* m_moveToStashIcon; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Sprite* m_moveToGearIcon; // 0x0050

    // Methods
    void duj(ESlotType a, ESlotType b);  // RVA: 0x7F2EE0
    void .ctor();  // RVA: 0x628730
};

// Namespace: <global>
struct <DelayedAnimation>d__7
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    SelectHeroEffectController* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x7F85E0
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7F85D0
};

// Namespace: <global>
class SelectHeroEffectController : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    SpriteAnimation_Image* spriteAnimationImage; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    SpriteAnimation_Image[][] effectObjects; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    int32_t targetFrame; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float delay; // 0x0034

    // Methods
    void Awake();  // RVA: 0x7F3A80
    void OnDestroy();  // RVA: 0x7F3B80
    void duk(int32_t a);  // RVA: 0x7F3CC0
    UniTaskVoid dul();  // RVA: 0x7F3D80
    void dum();  // RVA: 0x7F3E10
    void .ctor();  // RVA: 0x628730
};

// Namespace: <global>
struct <DelayedAnimation>d__9
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    SelectHeroShakeFlashController* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x7F8840
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7F85D0
};

// Namespace: <global>
class SelectHeroShakeFlashController : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    SpriteAnimation_Image* spriteAnimationImage; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    int32_t targetFrame; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    SelectHeroOption* selectHeroOption; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    bool hasFlash; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Il2CppString* otherAnimKey; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    bool hasShake; // 0x0048
    uint8_t pad_0049[0x3]; // 0x0049
    float delay; // 0x004C

    // Methods
    void Awake();  // RVA: 0x7F4050
    void OnDestroy();  // RVA: 0x7F4150
    UniTaskVoid dun();  // RVA: 0x7F43F0
    void Play(int32_t frame);  // RVA: 0x7F4290
    void Play();  // RVA: 0x7F4350
    void .ctor();  // RVA: 0x628730
};

// Namespace: <global>
class r
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    SkillPointAnimationController* bawy; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    RectTransform* bawz; // 0x0018

    // Methods
    void duo();  // RVA: 0x8060D0
    void .ctor();  // RVA: 0x628380
};

// Namespace: <global>
class SkillPointAnimationController : public MonoBehaviour
{
public:
    // Static fields
    // static Color baxa;
    // static Color baxb;

    uint8_t pad_0000[0x20]; // 0x0000
    Image* m_sliderBarCover; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    GameObject* prefab; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Transform* poolHolder; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Transform[][] m_iconTargetPos; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    float m_animDurationTime; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    System.Collections.Generic.Queue<UnityEngine.RectTransform> baxc; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    System.Collections.Generic.List<UnityEngine.RectTransform> baxd; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    Tweener* baxe; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    ActiveSkillSlotDetail* baxf; // 0x0060

    // Methods
    void Awake();  // RVA: 0x7F4480
    void dup();  // RVA: 0x7F4830
    void duq();  // RVA: 0x7F4920
    void dur(bool a);  // RVA: 0x7F4B40
    void dus();  // RVA: 0x7F4DA0
    void dut();  // RVA: 0x7F4EE0
    void duu(Color a);  // RVA: 0x7F5020
    void duv(int32_t a, int32_t b);  // RVA: 0x7F5100
    RectTransform* duw();  // RVA: 0x7F5630
    void dux(RectTransform* a);  // RVA: 0x7F5770
    void OnDisable();  // RVA: 0x7F45B0
    void .ctor();  // RVA: 0x7F4760
    static void .cctor();  // RVA: 0x7F4700
};

// Namespace: <global>
class ActSlot : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    int32_t act; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* text_ActName; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Button* btn; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    ToggleButton* button_toggle; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    float m_selectedCorrectionY; // 0x0040
    uint8_t pad_0041[0x3]; // 0x0041
    float m_unSelectedCorrectionY; // 0x0044
    uint8_t pad_0045[0x3]; // 0x0045
    Color m_selectedColor; // 0x0048
    uint8_t pad_0049[0xF]; // 0x0049
    Color m_unSelectedColor; // 0x0058
    uint8_t pad_0059[0xF]; // 0x0059
    System.Action<System.Int32> baxg; // 0x0068

    // Methods
    void duy(int32_t a, System.Action<System.Int32> b);  // RVA: 0x7EF4D0
    void duz();  // RVA: 0x7EF630
    void dva(bool a);  // RVA: 0x7EF710
    void dvb();  // RVA: 0x7EF7F0
    void .ctor();  // RVA: 0x628730
};

// Namespace: <global>
class u : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    System.Collections.Generic.List<TaskbarHero.UI.AttributeSlot> attributeSlots; // 0x0020

    // Methods
    void .ctor();  // RVA: 0x806180
};

// Namespace: <global>
class LogSlot : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    RectTransform* rt; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* Text_LogText; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Animator* animator; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    car* feedback1; // 0x0038

    // Methods
    void dvc(Il2CppString* a, Vector2 b, GradeSO* c);  // RVA: 0x7F3620
    void offObject();  // RVA: 0x63D9D0
    void dvd();  // RVA: 0x7F3790
    void .ctor();  // RVA: 0x628730
};

// Namespace: <global>
class ba : public MonoBehaviour
{
public:

    // Methods
    void Update();  // RVA: 0x63D9D0
    void nla();  // RVA: 0x63D9D0
    void eiw();  // RVA: 0x63D9D0
    void Start();  // RVA: 0x63D9D0
    void .ctor();  // RVA: 0x628730
    void cmd();  // RVA: 0x63D9D0
    void ecg();  // RVA: 0x63D9D0
};

// Namespace: <global>
class bb
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t baxh; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* baxi; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BlinkAnimation* baxj; // 0x0020

    // Methods
    void .ctor(int32_t a);  // RVA: 0x681030
    void dve();  // RVA: 0x63D9D0
    bool MoveNext();  // RVA: 0x7FBF60
    Il2CppObject* dvf();  // RVA: 0x695920
    void dvg();  // RVA: 0x7FC180
    Il2CppObject* dvh();  // RVA: 0x695920
};

// Namespace: <global>
class bc
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t baxk; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* baxl; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BlinkAnimation* baxm; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float baxn; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    float baxo; // 0x002C
    uint8_t pad_002D[0x3]; // 0x002D
    float baxp; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float baxq; // 0x0034

    // Methods
    void .ctor(int32_t a);  // RVA: 0x681030
    void dvi();  // RVA: 0x63D9D0
    bool MoveNext();  // RVA: 0x7FC1C0
    Il2CppObject* dvj();  // RVA: 0x695920
    void dvk();  // RVA: 0x7FC300
    Il2CppObject* dvl();  // RVA: 0x695920
};

// Namespace: <global>
class bd
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t baxr; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* baxs; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BlinkAnimation* baxt; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float baxu; // 0x0028

    // Methods
    void .ctor(int32_t a);  // RVA: 0x681030
    void dvm();  // RVA: 0x63D9D0
    bool MoveNext();  // RVA: 0x7FC340
    Il2CppObject* dvn();  // RVA: 0x695920
    void dvo();  // RVA: 0x7FC450
    Il2CppObject* dvp();  // RVA: 0x695920
};

// Namespace: <global>
class BlinkAnimation : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    float blinkSpeed; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    float minAlpha; // 0x0024
    uint8_t pad_0025[0x3]; // 0x0025
    float maxAlpha; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    bool smoothBlink; // 0x002C
    bool playOnStart; // 0x002D
    bool loop; // 0x002E
    bool unscaledTime; // 0x002F
    SpriteRenderer* baxv; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Image* baxw; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    CanvasGroup* baxx; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    TextMesh* baxy; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    MeshRenderer* baxz; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    TextMeshProUGUI* baya; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    TextMeshPro* bayb; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    bool bayc; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    Coroutine* bayd; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    float baye; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    Action* OnBlinkStart; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    Action* OnBlinkEnd; // 0x0088
    uint8_t pad_0089[0x7]; // 0x0089
    Action* OnBlinkCycle; // 0x0090

    // Methods
    bool dvq();  // RVA: 0x7EF8D0
    float dvr();  // RVA: 0x7EF8E0
    void dvs(float a);  // RVA: 0x7EF8F0
    float dvt();  // RVA: 0x7EF910
    float dvu();  // RVA: 0x7EF920
    void Awake();  // RVA: 0x7EF810
    void Start();  // RVA: 0x7EF8A0
    void OnValidate();  // RVA: 0x7EF830
    void dvv();  // RVA: 0x7EF930
    void dvw();  // RVA: 0x7EFC00
    void dvx();  // RVA: 0x7EFE70
    void dvy();  // RVA: 0x7EFF20
    void dvz();  // RVA: 0x7EFF70
    void dwa();  // RVA: 0x7F0060
    void dwb(float a);  // RVA: 0x7F0070
    float dwc();  // RVA: 0x7F0480
    void dwd(float a, float b, float c, bool d);  // RVA: 0x7F06F0
    IEnumerator* dwe();  // RVA: 0x7F0860
    IEnumerator* dwf(float a);  // RVA: 0x7F08D0
    IEnumerator* dwg(float a);  // RVA: 0x7F0950
    void dwh();  // RVA: 0x7F09D0
    void .ctor();  // RVA: 0x7EF8B0
};

// Namespace: <global>
struct SpriteAnimClip
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Il2CppString* ClipName; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Sprite[][] Sprites; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bool Loop; // 0x0020
};

// Namespace: <global>
class be
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bayf; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* bayg; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    SpriteAnimation_Image* bayh; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float bayi; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    int32_t bayj; // 0x002C

    // Methods
    void .ctor(int32_t a);  // RVA: 0x681030
    void dwi();  // RVA: 0x63D9D0
    bool MoveNext();  // RVA: 0x7FC490
    Il2CppObject* dwj();  // RVA: 0x695920
    void dwk();  // RVA: 0x7FC6D0
    Il2CppObject* dwl();  // RVA: 0x695920
};

// Namespace: <global>
class SpriteAnimation_Image : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Image* image; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    System.Collections.Generic.List<UnityEngine.Sprite> sprites; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float duration; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float speed; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    bool playOnStart; // 0x0038
    bool PlayOnEnable; // 0x0039
    bool loop; // 0x003A
    bool unscaledTime; // 0x003B
    bool m_deactivateOnComplete; // 0x003C
    uint8_t pad_003D[0x3]; // 0x003D
    Coroutine* bayk; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    bool bayl; // 0x0048
    uint8_t pad_0049[0x3]; // 0x0049
    int32_t baym; // 0x004C
    uint8_t pad_004D[0x3]; // 0x004D
    Action* OnAnimationStart; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    Action* OnAnimationComplete; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    System.Action<System.Int32> OnFrameChanged; // 0x0060

    // Methods
    Image* dwm();  // RVA: 0x639E40
    System.Collections.Generic.List<UnityEngine.Sprite> dwn();  // RVA: 0x685D60
    float dwo();  // RVA: 0x7F5A90
    float dwp();  // RVA: 0x7F5AA0
    bool dwq();  // RVA: 0x7F5AB0
    bool dwr();  // RVA: 0x7F5AC0
    int32_t dws();  // RVA: 0x7F5AD0
    int32_t dwt();  // RVA: 0x7F5AE0
    float dwu();  // RVA: 0x7F5B20
    void Start();  // RVA: 0x7F59A0
    void OnEnable();  // RVA: 0x7F5890
    void OnValidate();  // RVA: 0x7F58F0
    void dwv();  // RVA: 0x7F5B70
    void dww();  // RVA: 0x7F5D50
    void dwx();  // RVA: 0x7F5DA0
    void dwy(int32_t a);  // RVA: 0x7F5E30
    void dwz();  // RVA: 0x7F5F30
    void dxa();  // RVA: 0x7F5F80
    IEnumerator* dxb();  // RVA: 0x7F5FE0
    void dxc(float a, float b, bool c);  // RVA: 0x7F6050
    void dxd(System.Collections.Generic.List<UnityEngine.Sprite> a);  // RVA: 0x7F60F0
    void dxe(Sprite* a);  // RVA: 0x7F6270
    void dxf(int32_t a);  // RVA: 0x7F6300
    void dxg();  // RVA: 0x7F6390
    void dxh();  // RVA: 0x63D9D0
    void .ctor();  // RVA: 0x7F5A00
};

// Namespace: <global>
class bf
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bayn; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* bayo; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    SpriteAnimation_SpriteRenderer* bayp; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float bayq; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    int32_t bayr; // 0x002C

    // Methods
    void .ctor(int32_t a);  // RVA: 0x681030
    void dxi();  // RVA: 0x63D9D0
    bool MoveNext();  // RVA: 0x7FC710
    Il2CppObject* dxj();  // RVA: 0x695920
    void dxk();  // RVA: 0x7FCBF0
    Il2CppObject* dxl();  // RVA: 0x695920
};

// Namespace: <global>
class SpriteAnimation_SpriteRenderer : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    SpriteRenderer* spriteRenderer; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    System.Collections.Generic.List<UnityEngine.Sprite> sprites; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float duration; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float delay; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    bool playOnStart; // 0x0038
    bool PlayOnEnable; // 0x0039
    bool DisableObjectWhenPlayEnd; // 0x003A
    bool m_disableRendererWhenPlayEnd; // 0x003B
    bool loop; // 0x003C
    bool unscaledTime; // 0x003D
    bool randomZRotation; // 0x003E
    uint8_t pad_003F[0x1]; // 0x003F
    Coroutine* bays; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    bool bayt; // 0x0048
    uint8_t pad_0049[0x3]; // 0x0049
    int32_t bayu; // 0x004C
    uint8_t pad_004D[0x3]; // 0x004D
    Color bayv; // 0x0050
    uint8_t pad_0051[0xF]; // 0x0051
    bool bayw; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    WaitForSeconds* bayx; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    WaitForSecondsRealtime* bayy; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    float bayz; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    Action* OnAnimationStart; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    Action* OnAnimationComplete; // 0x0088
    uint8_t pad_0089[0x7]; // 0x0089
    System.Action<System.Int32> OnFrameChanged; // 0x0090
    uint8_t pad_0091[0x7]; // 0x0091
    Action* OnDelayStart; // 0x0098
    uint8_t pad_0099[0x7]; // 0x0099
    Action* OnDelayComplete; // 0x00A0

    // Methods
    SpriteRenderer* dxm();  // RVA: 0x639E40
    System.Collections.Generic.List<UnityEngine.Sprite> dxn();  // RVA: 0x685D60
    float dxo();  // RVA: 0x7F5A90
    float dxp();  // RVA: 0x7F5AA0
    bool dxq();  // RVA: 0x7F6700
    bool dxr();  // RVA: 0x7F5AC0
    int32_t dxs();  // RVA: 0x7F5AD0
    int32_t dxt();  // RVA: 0x7F6710
    float dxu();  // RVA: 0x7F6750
    void Start();  // RVA: 0x7F65E0
    void OnEnable();  // RVA: 0x7F64C0
    void OnDisable();  // RVA: 0x7F6420
    void dxv();  // RVA: 0x7F67A0
    void dxw();  // RVA: 0x7F6830
    void OnValidate();  // RVA: 0x7F6530
    void dxx();  // RVA: 0x7F6930
    void dxy();  // RVA: 0x7F6A30
    void dxz();  // RVA: 0x7F6AE0
    void dya(int32_t a);  // RVA: 0x7F6B50
    void dyb();  // RVA: 0x7F6C50
    void dyc();  // RVA: 0x7F6CA0
    WaitForSeconds* dyd(float a);  // RVA: 0x7F6D00
    WaitForSecondsRealtime* dye(float a);  // RVA: 0x7F6DD0
    IEnumerator* dyf();  // RVA: 0x7F6EA0
    void dyg(float a, float b, bool c);  // RVA: 0x7F6F10
    void dyh(System.Collections.Generic.List<UnityEngine.Sprite> a);  // RVA: 0x7F6F90
    void dyi(Sprite* a);  // RVA: 0x7F70E0
    void dyj(int32_t a);  // RVA: 0x7F7170
    void dyk();  // RVA: 0x7F7200
    void dyl();  // RVA: 0x63D9D0
    void .ctor();  // RVA: 0x7F6670
};

// Namespace: <global>
class <>c
{
public:
    // Static fields
    // static <>c* <>9;
    // static UnityAction* <>9__15_0;


    // Methods
    static void .cctor();  // RVA: 0x7F8E50
    void .ctor();  // RVA: 0x628380
    void dym();  // RVA: 0x7F8EC0
};

// Namespace: <global>
class BottomStageQuickMenu : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    bool baza; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    RectTransform* m_quickMenu; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    ScreenBoundsCorrector* m_screenBoundsCorrector; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    float m_bottomOnTopPos; // 0x0038
    uint8_t pad_0039[0x3]; // 0x0039
    float m_bottomOnBottomPos; // 0x003C
    uint8_t pad_003D[0x3]; // 0x003D
    oj* m_quickMenuHoverCheck; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    Button* m_nonPresetButton; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Button* m_pinBattleScreenButton; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    TextMeshProUGUI* m_pinBattleScreenText; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    Button* m_muteButton; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    TextMeshProUGUI* m_muteText; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    Button* m_alwaysOnTopButton; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    TextMeshProUGUI* m_alwaysOnTopText; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    System.Collections.Generic.List<TaskbarHero.UI.LayoutPresetButton> m_layoutPresetButtons; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    bool bazb; // 0x0088

    // Methods
    void dyn();  // RVA: 0x7F1090
    void dyo(bool a);  // RVA: 0x7F1D10
    void dyp(bool a);  // RVA: 0x7F1D90
    void dyq(bool a);  // RVA: 0x7F1E70
    void dyr(ESoundType a, float b);  // RVA: 0x7F1F50
    void Update();  // RVA: 0x7F1030
    void OnDisable();  // RVA: 0x628720
    void OnPointerClick(PointerEventData* eventData);  // RVA: 0x7F0E60
    void OnPointerEnter(PointerEventData* eventData);  // RVA: 0x7F1020
    void OnPointerExit(PointerEventData* eventData);  // RVA: 0x628720
    void .ctor();  // RVA: 0x628730
    void dys();  // RVA: 0x7F2080
};

// Namespace: <global>
class StageTooltip : public MonoBehaviour
{
public:
    // Static fields
    // static int32_t bazc;
    // static int32_t bazd;

    uint8_t pad_0000[0x20]; // 0x0000
    TextMeshProUGUI* m_titleText; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* m_stageTypeText; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    TextMeshProUGUI* m_stageLevelText; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Image* m_BG; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Sprite[][] m_bgSprites; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    GameObject* m_soulStoneBG; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Image* m_soulStoneIcon; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    TextMeshProUGUI* m_soulStoneAmountText; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    SpriteAnimation_Image* m_bluePortalAnim; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    SpriteAnimation_Image* m_redPortalAnim; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    GameObject* m_lockIcon; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    GameObject* m_bottomText; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    TextMeshProUGUI* m_bottomTextLabel; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    GameObject* m_mouseIcon; // 0x0088
    uint8_t pad_0089[0x7]; // 0x0089
    TextMeshProUGUI* m_enterText; // 0x0090
    uint8_t pad_0091[0x7]; // 0x0091
    Color m_normalColor; // 0x0098
    uint8_t pad_0099[0xF]; // 0x0099
    Color m_actBossColor; // 0x00A8

    // Methods
    void Show(StageCache* cache);  // RVA: 0x7F7270
    void Hide();  // RVA: 0x731B60
    void dyt();  // RVA: 0x7F7730
    void dyu(StageCache* a, int32_t b);  // RVA: 0x7F7890
    void dyv(bool a, bool b);  // RVA: 0x7F7B40
    void dyw(SpriteAnimation_Image* a, SpriteAnimation_Image* b, bool c);  // RVA: 0x7F7B70
    void dyx(StageCache* a, bool b, bool c, bool d, int32_t e);  // RVA: 0x7F7C90
    void dyy(bool a, Il2CppString* b, Color c);  // RVA: 0x7F7FD0
    void .ctor();  // RVA: 0x628730
};

// Namespace: <global>
class OfflineHeroSlot
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    GameObject* slotObject; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    TextMeshProUGUI* nameText; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    TextMeshProUGUI* levelText; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* expText; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Image* baseExp; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Image* addedExp; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    GameObject* levelUpFX; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    System.Collections.Generic.List<UnityEngine.GameObject> heroList; // 0x0048

    // Methods
    void .ctor();  // RVA: 0x7F39A0
};

// Namespace: <global>
struct <ShowLevelUpFX>d__21
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    UI_OfflineReward* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    System.Collections.Generic.List<UI_OfflineReward.OfflineHeroSlot> list; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Awaiter <>u__1; // 0x0030

    // Methods
    void MoveNext();  // RVA: 0x7F8AA0
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7F85D0
};

// Namespace: <global>
class UI_OfflineReward : public MonoBehaviour
{
public:
    // Static fields
    // static float baze;
    // static float bazf;
    // static EEquipClassType[][] bazg;

    uint8_t pad_0000[0x20]; // 0x0000
    TextMeshProUGUI* m_lastLoginText; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* m_offlineTimeText; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Slider* m_timeSlider; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    TextMeshProUGUI* m_goldText; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    GameObject* m_blockBG; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    OfflineHeroSlot[][] heroSlots; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    CanvasGroup* m_parentCanvasGroup; // 0x0050

    // Methods
    void dyz(OfflineRewardResult a);  // RVA: 0x7FAAE0
    void dza(bool a);  // RVA: 0x7FADC0
    void dzb(OfflineRewardResult a);  // RVA: 0x7FADE0
    void dzc(OfflineRewardResult a);  // RVA: 0x7FB060
    void dzd(OfflineRewardResult a);  // RVA: 0x7FB120
    void dze(OfflineHeroSlot* a, OfflineRewardHeroResult b);  // RVA: 0x7FB4A0
    void dzf(OfflineHeroSlot* a, HeroInfoData* b);  // RVA: 0x7FB9C0
    int32_t dzg(HeroInfoData* a);  // RVA: 0x7FBB80
    HeroInfoData* dzh(int32_t a);  // RVA: 0x7FBC60
    float dzi(float a, float b);  // RVA: 0x7FBD50
    UniTaskVoid dzj(System.Collections.Generic.List<UI_OfflineReward.OfflineHeroSlot> a);  // RVA: 0x7FBD80
    void OnDisable();  // RVA: 0x7FA8A0
    void .ctor();  // RVA: 0x628730
    static void .cctor();  // RVA: 0x7FAA50
    bool dzk();  // RVA: 0x7FBE30
};

// Namespace: <global>
struct EStatusUIState
{
public:
    // Static fields
    // static EStatusUIState Default;
    // static EStatusUIState StatDetail;
    // static EStatusUIState AttributeDetail;
    // static EStatusUIState SkillEquip;
    // static EStatusUIState SkillSlot;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
struct EWorldUILocation
{
public:
    // Static fields
    // static EWorldUILocation Left;
    // static EWorldUILocation Center;
    // static EWorldUILocation Right;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
class UI_Main : public MonoBehaviour
{
public:
    // Static fields
    // static float bazi;
    // static float bazj;
    // static float bazk;
    // static float bazl;

    uint8_t pad_0000[0x20]; // 0x0000
    UIManager* bazh; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    UiStateMachineBehaviour* _usm; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    RectTransform* panel_left; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    RectTransform* panel_right; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    RectTransform* panel_center; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    xs* button_Stash; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    xs* button_Stat; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    xs* button_Cube; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    xs* button_Rune; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    xs* button_Portal; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    System.Collections.Generic.List<xs> ContentButtons; // 0x0070

    // Methods
    void Awake();  // RVA: 0x7F9790
    void dzl();  // RVA: 0x7F9B60
    void Start();  // RVA: 0x7F9A30
    void OnEnable();  // RVA: 0x7F9A30
    void dzm();  // RVA: 0x7F9C70
    EWorldUILocation dzn(float a);  // RVA: 0x7F9EE0
    bool dzo();  // RVA: 0x7F9F00
    bool dzp();  // RVA: 0x7F9F80
    void dzq();  // RVA: 0x7FA000
    void dzr(float a);  // RVA: 0x7FA040
    void dzs(float a);  // RVA: 0x7FA0F0
    void dzt(float a);  // RVA: 0x7FA1A0
    void dzu();  // RVA: 0x7FA250
    void dzv();  // RVA: 0x7FA250
    void dzw();  // RVA: 0x7FA3B0
    void dzx();  // RVA: 0x7FA490
    void dzy();  // RVA: 0x7FA4A0
    void dzz();  // RVA: 0x7FA6F0
    void eaa();  // RVA: 0x7FA870
    void eab();  // RVA: 0x7FA870
    void .ctor();  // RVA: 0x7F9AE0
};

// Namespace: <global>
class bg : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Vector2 bazm; // 0x0020

    // Methods
    void bld(Vector2 a);  // RVA: 0x7FCC30
    void eac(Vector2 a);  // RVA: 0x7FCC40
    void kxj(Vector2 a);  // RVA: 0x7FCC30
    void eae(float a);  // RVA: 0x7FCC30
    void yu(Vector2 a);  // RVA: 0x7FCC30
    void ead(Vector2 a);  // RVA: 0x7FCC30
    void .ctor();  // RVA: 0x628730
    void els(Vector2 a);  // RVA: 0x7FCC30
};

// Namespace: <global>
struct <UpdateCoolTimeAsync>d__11
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bh* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x7F9350
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7F85D0
};

// Namespace: <global>
class bh
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    float bazn; // 0x0010
    uint8_t pad_0011[0x3]; // 0x0011
    int32_t bazo; // 0x0014
    uint8_t pad_0015[0x3]; // 0x0015
    System.Action<System.Int32> bazp; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    CancellationTokenSource* bazq; // 0x0020

    // Methods
    float eaf();  // RVA: 0x7FCC80
    void eah();  // RVA: 0x7FCCA0
    void .ctor(int32_t a);  // RVA: 0x7FCC50
    void eai();  // RVA: 0x7FCDA0
    UniTaskVoid eaj();  // RVA: 0x7FCDF0
    bool eag();  // RVA: 0x7FCC90
    void eix();  // RVA: 0x7FCE80
    void enb();  // RVA: 0x7FCF80
    void pk();  // RVA: 0x7FD180
    void juw();  // RVA: 0x7FD080
};

// Namespace: <global>
class bi
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bazr; // 0x0010

    // Methods
    void .ctor();  // RVA: 0x628380
};

// Namespace: <global>
class bj
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bazs; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* bazt; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    DeadUnitData* bazu; // 0x0020

    // Methods
    void .ctor(int32_t a);  // RVA: 0x681030
    void eak();  // RVA: 0x63D9D0
    bool MoveNext();  // RVA: 0x7FD280
    Il2CppObject* eal();  // RVA: 0x695920
    void eam();  // RVA: 0x7FD410
    Il2CppObject* ean();  // RVA: 0x695920
};

// Namespace: <global>
class DeadUnitData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    ug* cache; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    float currentResurrectionTime; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    System.Action<System.Single> OnProcessChange; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Coroutine* resurrectionCoroutine; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    int32_t bazv; // 0x0030

    // Methods
    int32_t eao();  // RVA: 0x7F25D0
    void .ctor(ug* cache, int32_t dieOrder);  // RVA: 0x7F2480
    void eap();  // RVA: 0x7F25E0
    void eaq();  // RVA: 0x7F26B0
    IEnumerator* ear();  // RVA: 0x7F2730
};

// Namespace: <global>
class ObstacleScriptableObject : public ScriptableObject
{
public:
    uint8_t pad_0000[0x18]; // 0x0000
    System.Collections.Generic.List<System.Single> ObstacleMoveSpeeds; // 0x0018

    // Methods
    void .ctor();  // RVA: 0x6C59B0
};

// Namespace: <global>
class SkillSO : public ScriptableObject
{
public:
    uint8_t pad_0000[0x18]; // 0x0000
    SKILLTYPE skillTYPE; // 0x0018
    uint8_t pad_0019[0x3]; // 0x0019
    float preTime; // 0x001C
    uint8_t pad_001D[0x3]; // 0x001D
    float actionTime; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    float postTime; // 0x0024
    uint8_t pad_0025[0x3]; // 0x0025
    bool KeepActivateOnRecast; // 0x0028
    bool CanMultiCastSkill; // 0x0029
    uint8_t pad_002A[0x6]; // 0x002A
    PrefabAndOffSetEffect* SkillEf_StartEf_Me; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    PrefabAndOffSetEffect* SkillEf_Direct_Other; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    PrefabAndOffSetEffect* AreaOfEffect_Other_Hitted; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    PrefabAndOffSetProjecTile* SkillProjecTile; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    AreaOfEffectData AreaOfEffectObject; // 0x0050
    uint8_t pad_0051[0x17]; // 0x0051
    bcp* WillSpawnTurret; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    bl* WillSpawnTrap; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    float WillSpawnTrapFixedY; // 0x0078
    uint8_t pad_0079[0x3]; // 0x0079
    float WillSpawnTrapSpeed; // 0x007C
    uint8_t pad_007D[0x3]; // 0x007D
    float WillSpawnTrapRandPosOffsetDividedRange; // 0x0080
    uint8_t pad_0081[0x3]; // 0x0081
    float WillSpawnTrapRandPosOffsetIncrementDividedRange; // 0x0084
    uint8_t pad_0085[0x3]; // 0x0085
    float WillSpawnTrapRandPosMaxOffsetDividedRange; // 0x0088
    uint8_t pad_0089[0x3]; // 0x0089
    float WillFinalOffsetXDividedRange_Move; // 0x008C
    uint8_t pad_008D[0x3]; // 0x008D
    float WillFinalOffsetXDividedRange_NotMove; // 0x0090
    uint8_t pad_0091[0x7]; // 0x0091
    SpawnSomethingData SpawnSomethingData; // 0x0098
    uint8_t pad_0099[0x17]; // 0x0099
    MonsterRandomSpawnData RandomMonsterSpawnData; // 0x00B0
    uint8_t pad_00B1[0x17]; // 0x00B1
    Sprite* SkillSprite; // 0x00C8
    uint8_t pad_00C9[0x7]; // 0x00C9
    AnimationClip* SkillClip1; // 0x00D0
    uint8_t pad_00D1[0x7]; // 0x00D1
    AnimationClip* SkillClip2; // 0x00D8
    uint8_t pad_00D9[0x7]; // 0x00D9
    AnimationClip* SkillClip3; // 0x00E0

    // Methods
    bool eas();  // RVA: 0x7F5820
    bool eat();  // RVA: 0x7F5830
    bool eau();  // RVA: 0x7F5840
    bool eav();  // RVA: 0x7F5850
    bool eaw();  // RVA: 0x7F5860
    bool eax();  // RVA: 0x7F5870
    bool eay();  // RVA: 0x7F5880
    void .ctor();  // RVA: 0x7F5810
};

// Namespace: <global>
struct SpawnSomethingData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    GameObject* SpawnPrefab; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector3 Offset; // 0x0018
};

// Namespace: <global>
struct MonsterRandomSpawnData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    System.Collections.Generic.List<System.Int32> RandomSpawnMonsterKey; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    int32_t SpawnCount; // 0x0018
    uint8_t pad_0019[0x3]; // 0x0019
    float RandomSpawnPosOffsetMin; // 0x001C
    uint8_t pad_001D[0x3]; // 0x001D
    float RandomSpawnPosOffsetMax; // 0x0020
};

// Namespace: <global>
struct AreaOfEffectData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    GameObject* Prefab; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector3 OffSet; // 0x0018
};

// Namespace: <global>
class PrefabAndOffSetEffect
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    GameObject* Go_Prefab; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector3 OffSet; // 0x0018

    // Methods
    void .ctor();  // RVA: 0x7F3A20
};

// Namespace: <global>
class PrefabAndOffSetProjecTile
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    bdc* Go_Prefab; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector3 OffSet; // 0x0018

    // Methods
    void .ctor();  // RVA: 0x7F3A20
};

// Namespace: <global>
class TrapExplosionData : public ScriptableObject
{
public:
    uint8_t pad_0000[0x18]; // 0x0000
    EDamageAttribute ReactDamageType; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bbj* AreaOfEffect; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Il2CppString* ExplosionTriggerName; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float DividedExplosionDelayTime; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    int32_t DamageIncreaseValue; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    StatusEffectType StatusEffectType; // 0x0038
    uint8_t pad_0039[0x3]; // 0x0039
    float StatusEffectChance; // 0x003C

    // Methods
    void .ctor();  // RVA: 0x6C59B0
};

// Namespace: <global>
struct <ActivatingExplosion>d__31
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bk* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TrapExplosionData* data; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Awaiter <>u__1; // 0x0030

    // Methods
    void MoveNext();  // RVA: 0x7F8100
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7F85D0
};

// Namespace: <global>
class bk : public bl
{
public:
    uint8_t pad_0000[0x48]; // 0x0000
    TrapExplosionData[][] ExplosionData; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Unit* bazw; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    System.Collections.Generic.Dictionary<TaskbarHero.Data.EDamageAttribute,TrapExplosionData> bazx; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    float bazy; // 0x0060
    uint8_t pad_0061[0x3]; // 0x0061
    EDamageAttribute bazz; // 0x0064
    uint8_t pad_0065[0x3]; // 0x0065
    EDamageType bbaa; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    TrapExplosionData* bbab; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    bool bbac; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    CancellationTokenSource* bbad; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    Action* bbae; // 0x0088
    uint8_t pad_0089[0x7]; // 0x0089
    int32_t bbaf; // 0x0090
    uint8_t pad_0091[0x3]; // 0x0091
    int32_t bbag; // 0x0094
    uint8_t pad_0095[0x3]; // 0x0095
    int32_t bbah; // 0x0098

    // Methods
    void djj(float a);  // RVA: 0x7FD4D0
    void ivt(float a);  // RVA: 0x7FD4D0
    Vector3 ebq();  // RVA: 0x62EC00
    float ebo();  // RVA: 0x7FDD40
    UniTaskVoid ebm(TrapExplosionData* a);  // RVA: 0x7FDAD0
    Unit* ebc();  // RVA: 0x668DD0
    void ebg(EDamageAttribute a);  // RVA: 0x7FD600
    DamageableType ebb();  // RVA: 0x7FD570
    void ebh(float a);  // RVA: 0x7FD4D0
    void lzv(float a, Unit* b, EDamageType c, Action* d);  // RVA: 0x7FD590
    void ebe(float a, Unit* b, EDamageType c, Action* d);  // RVA: 0x7FD590
    void ebk();  // RVA: 0x7FD9E0
    void ebl();  // RVA: 0x7FDA70
    void jya(float a);  // RVA: 0x7FD4D0
    void ong(float a, Unit* b, EDamageType c, Action* d);  // RVA: 0x7FD590
    void ebf(int32_t a, int32_t b, int32_t c);  // RVA: 0x7FD5E0
    DamageInfo hbg();  // RVA: 0x7FDE40
    void jgu();  // RVA: 0x7FDA70
    void jll();  // RVA: 0x7FDA70
    int32_t ebr();  // RVA: 0x7FDE30
    Bounds ebp();  // RVA: 0x7FDD70
    DamageInfo ebn();  // RVA: 0x7FDB80
    Vector3 eaz();  // RVA: 0x7FD520
    void kug(float a, Unit* b, EDamageType c, Action* d);  // RVA: 0x7FD590
    bool eba();  // RVA: 0x67A4D0
    void .ctor();  // RVA: 0x7FD450
    Transform* ebd();  // RVA: 0x7FD580
    void ebi(Vector3 a, Vector3 b, float c, float d);  // RVA: 0x7FD6B0
    void ebj(DamageInfo a, bool b);  // RVA: 0x7FD830
    void gkj();  // RVA: 0x7FDA70
    void ert();  // RVA: 0x7FDA70
    DamageInfo lfh();  // RVA: 0x7FE000
    void ife(float a, Unit* b, EDamageType c, Action* d);  // RVA: 0x7FD590
    DamageInfo omh();  // RVA: 0x7FE1C0
};

// Namespace: <global>
struct <UpdateTrapLifeTime>d__11
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bl* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x7F9550
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7F85D0
};

// Namespace: <global>
class bl : public bci
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Animator* TrapAnimator; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    bdh* TrapMover; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float LifeTime; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float TrapMoveSpeed; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    float TrapMoveHeight; // 0x0038
    uint8_t pad_0039[0x3]; // 0x0039
    bool bbai; // 0x003C
    uint8_t pad_003D[0x3]; // 0x003D
    CancellationTokenSource* bbaj; // 0x0040

    // Methods
    void gou();  // RVA: 0x7FE380
    void OnDisable();  // RVA: 0x7FE380
    void ebi(Vector3 a, Vector3 b, float c, float d);  // RVA: 0x7FE530
    void cgc();  // RVA: 0x7FE430
    void hjf();  // RVA: 0x7FEC30
    void bgf();  // RVA: 0x7FE380
    void ebk();  // RVA: 0x7FE890
    void .ctor();  // RVA: 0x7FE3A0
    void fju();  // RVA: 0x7FEB30
    void ebs();  // RVA: 0x7FE8E0
    void fcs();  // RVA: 0x7FEAB0
    void goh();  // RVA: 0x7FEBB0
    void bnc();  // RVA: 0x7FE3B0
    void ebu();  // RVA: 0x7FE9F0
    void iau();  // RVA: 0x7FE380
    void ebv();  // RVA: 0x7FEA70
    UniTaskVoid ebt();  // RVA: 0x7FE960
    void djy();  // RVA: 0x7FE4B0
};

// Namespace: <global>
struct <UpdateAsync>d__15
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    LineController* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x7F8EF0
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7F85D0
};

// Namespace: <global>
class LineController : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    bool OnlyOneLoop; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    LineRenderer* LineRenderer; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Texture[][] lineTextures; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    float Fps; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    SpriteRenderer* m_headCap; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    SpriteRenderer* m_tailCap; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    float bbak; // 0x0050
    uint8_t pad_0051[0x3]; // 0x0051
    int32_t bbal; // 0x0054
    uint8_t pad_0055[0x3]; // 0x0055
    bool bbam; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    Transform* bban; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    Transform* bbao; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    Vector3 bbap; // 0x0070
    uint8_t pad_0071[0xB]; // 0x0071
    Vector3 bbaq; // 0x007C

    // Methods
    void ebw();  // RVA: 0x7F3030
    void ebx(Transform* a, Transform* b, Vector3 c, Vector3 d);  // RVA: 0x7F3090
    UniTaskVoid eby();  // RVA: 0x7F3340
    void ebz(Vector3 a, Vector3 b);  // RVA: 0x7F33C0
    void .ctor();  // RVA: 0x628730
};

// Namespace: <global>
class bm : public bz
{
public:
    uint8_t pad_0000[0x38]; // 0x0000
    float FloorHalfSize; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    System.Collections.Generic.List<UnityEngine.GameObject> Presets; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    FollowCamera* FollowCamera; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    float ObstacleMoveSpeed; // 0x0050
    uint8_t pad_0051[0x3]; // 0x0051
    float TimeCorrectionValue; // 0x0054
    uint8_t pad_0055[0x3]; // 0x0055
    float bbar; // 0x0058
    uint8_t pad_0059[0x3]; // 0x0059
    int32_t bbas; // 0x005C
    uint8_t pad_005D[0x3]; // 0x005D
    System.Collections.Generic.List<bo> ChildLayers; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    int32_t bbat; // 0x0068
    uint8_t pad_0069[0x3]; // 0x0069
    float bbau; // 0x006C
    uint8_t pad_006D[0x3]; // 0x006D
    Transform* bbav; // 0x0070

    // Methods
    void Hide();  // RVA: 0x7FEEA0
    void ecb();  // RVA: 0x7FFE10
    void njo(Transform* a);  // RVA: 0x801C50
    void fih(Transform* a);  // RVA: 0x8007E0
    void Show();  // RVA: 0x7FEED0
    void End();  // RVA: 0x7FECB0
    void emi(Vector3 a, float b, int32_t c);  // RVA: 0x8004A0
    void ftn();  // RVA: 0x800A60
    void bpo();  // RVA: 0x7FF2A0
    void ecd(Transform* a);  // RVA: 0x800220
    void mbn(Vector3 a, float b, int32_t c);  // RVA: 0x8015D0
    void jso(Vector3 a, float b, int32_t c);  // RVA: 0x8010A0
    void Update();  // RVA: 0x7FEF00
    void cxb();  // RVA: 0x7FF5C0
    void ecc(Transform* a);  // RVA: 0x7FFFA0
    void .ctor();  // RVA: 0x7FF220
    void jhu();  // RVA: 0x800D80
    void nhh(Vector3 a, float b, int32_t c);  // RVA: 0x801910
    void eca(Vector3 a, float b, int32_t c);  // RVA: 0x7FFAD0
    void hwe();  // RVA: 0x7FEEA0
    void lrp();  // RVA: 0x8013E0
    void dvj();  // RVA: 0x7FF8E0
};

// Namespace: <global>
class bn : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Camera* bbaw; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    UI_Stage* bbax; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    bool OnHover; // 0x0030

    // Methods
    void kdz();  // RVA: 0x801F60
    void Update();  // RVA: 0x801F60
    void dzl();  // RVA: 0x801F60
    void .ctor();  // RVA: 0x628730
    void bvw();  // RVA: 0x801F60
    void fhz();  // RVA: 0x801F90
    void mq();  // RVA: 0x802020
    void Start();  // RVA: 0x801ED0
};

// Namespace: <global>
class bo : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    System.Collections.Generic.List<SpriteAnimation_SpriteRenderer> SpriteAnimationList; // 0x0020

    // Methods
    void ecf();  // RVA: 0x802330
    void dnj();  // RVA: 0x8020B0
    void ece();  // RVA: 0x8021F0
    void .ctor();  // RVA: 0x628730
    void mqc();  // RVA: 0x802440
};

// Namespace: <global>
class bp : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    System.Collections.Generic.List<UnityEngine.GameObject> BackGroundPresets; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    FollowCamera* FollowCamera; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float ObstacleMoveSpeed; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    System.Collections.Generic.List<SpriteAnimation_SpriteRenderer> SpriteAnimationList; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Vector3 bbay; // 0x0040

    // Methods
    void ngy();  // RVA: 0x802580
    void oh();  // RVA: 0x8042E0
    void cry();  // RVA: 0x802D10
    void Update();  // RVA: 0x802710
    void .ctor();  // RVA: 0x628730
    void ecg(Vector3 a);  // RVA: 0x802F40
    void idx();  // RVA: 0x803310
    void jos(Vector3 a);  // RVA: 0x803910
    void onv();  // RVA: 0x802580
    void bif(Vector3 a);  // RVA: 0x802940
    void ilz(Vector3 a);  // RVA: 0x803540
    void Awake();  // RVA: 0x802580
    void o();  // RVA: 0x8040B0
    void net(Vector3 a);  // RVA: 0x803CE0
    void End();  // RVA: 0x8025C0
};

// Namespace: <global>
class bq
{
public:
    // Static fields
    // static Il2CppString* bbaz;
    // static Il2CppString* bbba;
    // static Il2CppString* bbbb;
    // static Il2CppString* bbbc;
    // static Il2CppString* bbbd;
    // static Il2CppString* bbbe;
    // static Il2CppString* bbbf;


    // Methods
    static void .cctor();  // RVA: 0x80DF50
};

// Namespace: <global>
class br
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Il2CppString* bbbg; // 0x0010

    // Methods
    void .ctor();  // RVA: 0x628380
    bool imr(Il2CppString* a);  // RVA: 0x80E100
    bool ech(Il2CppString* a);  // RVA: 0x80E100
    bool jst(Il2CppString* a);  // RVA: 0x80E100
    bool lgp(Il2CppString* a);  // RVA: 0x80E100
};

// Namespace: <global>
class CsvManager : public MonoBehaviour
{
public:
    // Static fields
    // static CsvManager* bbbh;

    uint8_t pad_0000[0x20]; // 0x0000
    Il2CppString* m_csvFolderPath; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    System.Collections.Generic.List<UnityEngine.TextAsset> m_csvTextAssets; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    System.Collections.Generic.Dictionary<System.String,UnityEngine.TextAsset> bbbi; // 0x0030

    // Methods
    static CsvManager* eci();  // RVA: 0x807750
    void Awake();  // RVA: 0x8075F0
    void ecj();  // RVA: 0x807790
    System.Collections.Generic.List<a> eck(Il2CppString* a);  // RVA: 0x419890
    TextAsset* ecl(Il2CppString* a);  // RVA: 0x807920
    String[][] ecm(Il2CppString* a);  // RVA: 0x807980
    void .ctor();  // RVA: 0x807650
};

// Namespace: <global>
class FollowCamera : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    StageManager* _stageController; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Unit[][] _targets; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Vector3 _battleModeOffset; // 0x0030
    uint8_t pad_0031[0xF]; // 0x0031
    RectTransform* m_stageUIRect; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    BoxCollider2D* m_collider2D; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Vector3 windowFrameOffset; // 0x0050
    uint8_t pad_0051[0xB]; // 0x0051
    Vector3 bbbj; // 0x005C
    uint8_t pad_005D[0xB]; // 0x005D
    float bbbk; // 0x0068
    uint8_t pad_0069[0x3]; // 0x0069
    float bbbl; // 0x006C
    uint8_t pad_006D[0x3]; // 0x006D
    float m_monsterTargetOffsetValue; // 0x0070
    uint8_t pad_0071[0x3]; // 0x0071
    float m_monsterFollowCameraCenterOffset; // 0x0074
    uint8_t pad_0075[0x3]; // 0x0075
    Vector3 m_windowFrameMonsterBattleFollowOffset; // 0x0078
    uint8_t pad_0079[0xB]; // 0x0079
    Vector3 m_windowFrameCorrectionOffset; // 0x0084
    uint8_t pad_0085[0xB]; // 0x0085
    float m_heroSpreadMaxDistance; // 0x0090
    uint8_t pad_0091[0x3]; // 0x0091
    float m_heroSpreadTargetOffsetX; // 0x0094
    uint8_t pad_0095[0x3]; // 0x0095
    float m_maxFollowDistance; // 0x0098
    uint8_t pad_0099[0x3]; // 0x0099
    float m_catchUpSpeedMultiplier; // 0x009C
    uint8_t pad_009D[0x3]; // 0x009D
    float bbbm; // 0x00A0
    uint8_t pad_00A1[0x7]; // 0x00A1
    TMP_InputField* m_debugCorrectionOffsetXInput; // 0x00A8
    uint8_t pad_00A9[0x7]; // 0x00A9
    TMP_InputField* m_debugCorrectionOffsetYInput; // 0x00B0
    uint8_t pad_00B1[0x7]; // 0x00B1
    TMP_InputField* m_debugCorrectionOffsetZInput; // 0x00B8

    // Methods
    Transform* ecn();  // RVA: 0x808270
    Vector3 eco();  // RVA: 0x8082A0
    float ecp();  // RVA: 0x8082E0
    void Start();  // RVA: 0x8081B0
    void ecq();  // RVA: 0x8082F0
    void ecr(Il2CppString* a);  // RVA: 0x8085F0
    void ecs(Il2CppString* a);  // RVA: 0x808630
    void ect(Il2CppString* a);  // RVA: 0x808670
    void Update();  // RVA: 0x8081C0
    void ecu();  // RVA: 0x8086B0
    void ecv(float a);  // RVA: 0x808980
    void ecw(Unit[][] a);  // RVA: 0x808990
    Vector3 ecx();  // RVA: 0x808C50
    Vector3 ecy();  // RVA: 0x808D60
    Vector3 ecz();  // RVA: 0x808E70
    void eda(Vector3 a);  // RVA: 0x809370
    void .ctor();  // RVA: 0x8081D0
};

// Namespace: <global>
class TestFollowScript : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Transform* m_stageUIRect; // 0x0020

    // Methods
    void Update();  // RVA: 0x80CC30
    void .ctor();  // RVA: 0x628730
};

// Namespace: <global>
class AnimationEf : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    SpriteRenderer* spr; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    SpriteAnimation_SpriteRenderer* sprite_Animation; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    System.Collections.Generic.List<SpriteAnimation_SpriteRenderer> additionalAnimations; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Action* bbbn; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    bool EndDestroy; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    SpriteAnimation_SpriteRenderer* bbbo; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    SpriteRenderer* bbbp; // 0x0050

    // Methods
    void edb(Action* a);  // RVA: 0x806A80
    void Awake();  // RVA: 0x806410
    void edc();  // RVA: 0x806B20
    void edd();  // RVA: 0x806F50
