// ============================================================
// Image: ACTk.Runtime.dll
// ============================================================

namespace Microsoft.CodeAnalysis
{

    // Namespace: Microsoft.CodeAnalysis
    class EmbeddedAttribute : public Attribute
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x678F50
    };

} // namespace Microsoft.CodeAnalysis

namespace System.Runtime.CompilerServices
{

    // Namespace: System.Runtime.CompilerServices
    class IsUnmanagedAttribute : public Attribute
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x678F50
    };

} // namespace System.Runtime.CompilerServices

// Namespace: <global>
struct MonoScriptData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Byte[][] FilePathsData; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Byte[][] TypesData; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    int32_t TotalTypes; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    int32_t TotalFiles; // 0x0024
    uint8_t pad_0025[0x3]; // 0x0025
    bool IsEditorOnly; // 0x0028
};

// Namespace: <global>
class dam
{
public:

    // Methods
    void .ctor();  // RVA: 0x628390
    static MonoScriptData htu();  // RVA: 0x679CE0
    static MonoScriptData mzd();  // RVA: 0x679DC0
    static MonoScriptData vyt();  // RVA: 0x679EA0
    static MonoScriptData fng();  // RVA: 0x679C00
};

// Namespace: <global>
class dan
{
public:

    // Methods
    static void vyu();  // RVA: 0x63E5A0
    static void vyv();  // RVA: 0x63E5A0
    static void pe();  // RVA: 0x63E5A0
    static void nt();  // RVA: 0x63E5A0
    static void lmh();  // RVA: 0x63E5A0
    static void nap();  // RVA: 0x63E5A0
};

// Namespace: <global>
class ApplicationFocusEventHandler : public MulticastDelegate
{
public:

    // Methods
    void .ctor(Il2CppObject* object, intptr_t method);  // RVA: 0x678E40
    void Invoke(bool hasFocus);  // RVA: 0x678E30
    IAsyncResult* BeginInvoke(bool hasFocus, AsyncCallback* callback, Il2CppObject* object);  // RVA: 0x678DC0
    void EndInvoke(IAsyncResult* result);  // RVA: 0x678E20
};

// Namespace: <global>
class ApplicationPauseEventHandler : public MulticastDelegate
{
public:

    // Methods
    void .ctor(Il2CppObject* object, intptr_t method);  // RVA: 0x678E40
    void Invoke(bool pauseStatus);  // RVA: 0x678E30
    IAsyncResult* BeginInvoke(bool pauseStatus, AsyncCallback* callback, Il2CppObject* object);  // RVA: 0x678DC0
    void EndInvoke(IAsyncResult* result);  // RVA: 0x678E20
};

// Namespace: <global>
class dao : public MonoBehaviour
{
public:
    // Static fields
    // static dao* bmni;

    uint8_t pad_0000[0x20]; // 0x0000
    ApplicationFocusEventHandler* bmng; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    ApplicationPauseEventHandler* bmnh; // 0x0028

    // Methods
    void drx(bool hasFocus);  // RVA: 0x67A020
    void kjo(bool hasFocus);  // RVA: 0x67A020
    void cvj();  // RVA: 0x67A060
    void vyz(ApplicationPauseEventHandler* a);  // RVA: 0x67A4C0
    void gms();  // RVA: 0x67A100
    void mkh();  // RVA: 0x67A1A0
    void vyy(ApplicationPauseEventHandler* a);  // RVA: 0x67A420
    void oar();  // RVA: 0x67A240
    void .ctor();  // RVA: 0x628740
    void vyx(ApplicationFocusEventHandler* a);  // RVA: 0x67A380
    void vyw(ApplicationFocusEventHandler* a);  // RVA: 0x67A2E0
    void Awake();  // RVA: 0x679F80
    void jjp(bool hasFocus);  // RVA: 0x67A020
    void OnApplicationFocus(bool hasFocus);  // RVA: 0x67A020
    static dao* vza();  // RVA: 0x67A560
    void OnApplicationPause(bool pauseStatus);  // RVA: 0x67A040
};

// Namespace: <global>
class dap
{
public:

    // Methods
    static Il2CppString* vzb(Il2CppString* a);  // RVA: 0x67ABB0
    static Il2CppString* muv(Il2CppString* a);  // RVA: 0x67AB10
    static Char[][] vzc(Il2CppString* a);  // RVA: 0x67AC50
    static Il2CppString* vze(Char[][] a);  // RVA: 0x67AE10
    static Il2CppString* lhf(Char[][] a);  // RVA: 0x67A8F0
    static Il2CppString* kdq(Il2CppString* a);  // RVA: 0x67A730
    static Il2CppString* ccs(Il2CppString* a);  // RVA: 0x67A690
    static Il2CppString* kwk(Il2CppString* a);  // RVA: 0x67A850
    static Il2CppString* vzd(Il2CppString* a);  // RVA: 0x67ACF0
    static Il2CppString* lhh(Char[][] a);  // RVA: 0x67AA00
};

// Namespace: <global>
class daq
{
public:
    // Static fields
    // static int32_t bmnj;
    // static uint8_t bmnk;
    // static uint8_t bmnl;
    // static uint8_t bmnm;
    // static uint8_t bmnn;
    // static uint8_t bmno;


    // Methods
    static void vzh(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x67B4D0
    static void fvx(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x67B0E0
    static void mng(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x67B380
    static void vzi(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x67B540
    static void dgq(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x67AF90
    static void vzj(Stream* a, Stream* b, Byte[][] c, uint8_t d);  // RVA: 0x563BC0
    static void gjn(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x67B150
    static void vzk(Stream* a, Stream* b, Byte[][] c, uint8_t d, uint8_t e);  // RVA: 0x436630
    static void cjh(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x67AF20
    static void jns(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x67B2A0
    static void gmd(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x67B1C0
    static void euh(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x67B070
    static void vzf(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x67B3F0
    static void ehg(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x67B000
    static void vzg(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x67B460
    static void hyd(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x67B230
    static void jui(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x67B310
};

// Namespace: <global>
class dar
{
public:
    // Static fields
    // static int32_t bmnp;


    // Methods
    static bool iqv(BigInteger a, int32_t b);  // RVA: 0x67C460
    static bool vzl(BigInteger a, int32_t b);  // RVA: 0x67C460
    static bool vzn(Decimal a, int32_t b);  // RVA: 0x67C220
    static bool mhs(bool a, int32_t b);  // RVA: 0x67BFC0
    static bool jcq(float a, int32_t b);  // RVA: 0x67B850
    static int32_t kgr(BigInteger a);  // RVA: 0x67C490
    static int32_t buh(DateTimeOffset a);  // RVA: 0x67B5B0
    static bool vzx(float a, int32_t b);  // RVA: 0x67B850
    static int32_t wad(BigInteger a);  // RVA: 0x67D240
    static bool jys(uint32_t a, int32_t b);  // RVA: 0x67B990
    static bool kqs(Guid a, int32_t b);  // RVA: 0x67B690
    static int32_t wai(DateTimeOffset a);  // RVA: 0x67D850
    static bool fug(double a, int32_t b);  // RVA: 0x67B8B0
    static int32_t kny(bool a);  // RVA: 0x67C800
    static bool bve(Guid a, int32_t b);  // RVA: 0x67B690
    static int32_t nxb(uint64_t a);  // RVA: 0x67CBA0
    static bool nmf(Vector2 a, int32_t b);  // RVA: 0x67BA60
    static int32_t wac(a a);  // RVA: 0x563BC0
    static bool nqb(Guid a, int32_t b);  // RVA: 0x67B690
    static int32_t hcs(DateTime a);  // RVA: 0x67C130
    static int32_t waf(Decimal a);  // RVA: 0x67D540
    static int32_t wag(int32_t a);  // RVA: 0x67D710
    static bool ivo(double a, int32_t b);  // RVA: 0x67B8B0
    static bool odc(DateTimeOffset a, int32_t b);  // RVA: 0x67BB70
    static bool vzr(uint64_t a, int32_t b);  // RVA: 0x67D080
    static int32_t wak(int64_t a);  // RVA: 0x67DB90
    static bool vzq(uint32_t a, int32_t b);  // RVA: 0x67B990
    static int32_t wam(uint64_t a);  // RVA: 0x67DC30
    static int32_t wan(float a);  // RVA: 0x67C810
    static bool onk(Guid a, int32_t b);  // RVA: 0x67B690
    static int32_t wap(Quaternion a);  // RVA: 0x67DCF0
    static int32_t waq(Vector2 a);  // RVA: 0x67C090
    static bool mlj(Vector3Int a, int32_t b);  // RVA: 0x67BB10
    static int32_t lin(float a);  // RVA: 0x67C810
    static bool wab(Guid a, int32_t b);  // RVA: 0x67B690
    static bool im(float a, int32_t b);  // RVA: 0x67B850
    static int32_t exz(BigInteger a);  // RVA: 0x67BBA0
    static int32_t war(Vector2Int a);  // RVA: 0x67B7B0
    static bool vzv(Vector3 a, int32_t b);  // RVA: 0x67D130
    static bool fvs(bool a, int32_t b);  // RVA: 0x67BFC0
    static int32_t cxa(Vector2Int a);  // RVA: 0x67B7B0
    static int32_t waj(Guid a);  // RVA: 0x67D930
    static int32_t wah(DateTime a);  // RVA: 0x67D760
    static bool den(float a, int32_t b);  // RVA: 0x67B850
    static bool gbi(int64_t a, int32_t b);  // RVA: 0x67BFE0
    static bool vzo(int32_t a, int32_t b);  // RVA: 0x67B990
    static bool duw(uint32_t a, int32_t b);  // RVA: 0x67B990
    static int32_t imr(uint64_t a);  // RVA: 0x67C330
    static int32_t wav(Il2CppString* a);  // RVA: 0x67E070
    static int32_t bzj(bool a);  // RVA: 0x67B7A0
    static int32_t wal(uint32_t a);  // RVA: 0x67D710
    static bool vzy(double a, int32_t b);  // RVA: 0x67B8B0
    static bool jgl(DateTimeOffset a, int32_t b);  // RVA: 0x67BB70
    static int32_t okv(Decimal a);  // RVA: 0x67CC40
    static bool epr(Vector2 a, int32_t b);  // RVA: 0x67BA60
    static bool epi(DateTimeOffset a, int32_t b);  // RVA: 0x67BB70
    static bool dqy(Vector2Int a, int32_t b);  // RVA: 0x67B8E0
    static bool bxs(Char[][] a, int32_t b);  // RVA: 0x67B740
    static bool egg(Vector3Int a, int32_t b);  // RVA: 0x67BB10
    static bool lbo(Vector3Int a, int32_t b);  // RVA: 0x67BB10
    static int32_t wat(Vector3Int a);  // RVA: 0x67DF20
    static int32_t was(Vector3 a);  // RVA: 0x67DE30
    static bool okk(int64_t a, int32_t b);  // RVA: 0x67BFE0
    static bool kfb(Char[][] a, int32_t b);  // RVA: 0x67B740
    static bool ocs(int32_t a, int32_t b);  // RVA: 0x67B990
    static int32_t wao(double a);  // RVA: 0x67DCD0
    static bool nyi(bool a, int32_t b);  // RVA: 0x67BFC0
    static bool dep(double a, int32_t b);  // RVA: 0x67B8B0
    static int32_t dwa(Il2CppString* a);  // RVA: 0x67B9E0
    static int32_t bvr(Il2CppString* a);  // RVA: 0x67B6C0
    static bool vzu(Vector2Int a, int32_t b);  // RVA: 0x67B8E0
    static bool ojc(uint32_t a, int32_t b);  // RVA: 0x67B990
    static int32_t su(BigInteger a);  // RVA: 0x67CD90
    static int32_t ncx(bool a);  // RVA: 0x67CA20
    static bool eoo(Quaternion a, int32_t b);  // RVA: 0x67BB40
    static bool hne(DateTimeOffset a, int32_t b);  // RVA: 0x67BB70
    static bool nom(uint32_t a, int32_t b);  // RVA: 0x67B990
    static bool vzs(Quaternion a, int32_t b);  // RVA: 0x67BB40
    static bool vzw(Vector3Int a, int32_t b);  // RVA: 0x67BB10
    static bool hsk(Decimal a, int32_t b);  // RVA: 0x67C220
    static bool iue(float a, int32_t b);  // RVA: 0x67B850
    static int32_t iop(DateTimeOffset a);  // RVA: 0x67C380
    static bool vzt(Vector2 a, int32_t b);  // RVA: 0x67BA60
    static int32_t gyq(Vector2 a);  // RVA: 0x67C090
    static bool oig(Vector2 a, int32_t b);  // RVA: 0x67BA60
    static bool mzr(double a, int32_t b);  // RVA: 0x67B8B0
    static int32_t lrr(uint64_t a);  // RVA: 0x67C330
    static bool iz(bool a, int32_t b);  // RVA: 0x67BFC0
    static int32_t fbe(Decimal a);  // RVA: 0x67BE90
    static int32_t nlr(DateTime a);  // RVA: 0x67CA30
    static bool lfk(Char[][] a, int32_t b);  // RVA: 0x67B740
    static bool vzz(Char[][] a, int32_t b);  // RVA: 0x67B740
    static bool hbl(Vector2Int a, int32_t b);  // RVA: 0x67B8E0
    static int32_t wae(bool a);  // RVA: 0x67D530
    static int32_t mkp(Decimal a);  // RVA: 0x67C860
    static bool vzp(int64_t a, int32_t b);  // RVA: 0x67BFE0
    static int32_t nsn(uint64_t a);  // RVA: 0x67C330
    static bool waa(DateTimeOffset a, int32_t b);  // RVA: 0x67BB70
    static int32_t ifv(DateTimeOffset a);  // RVA: 0x67C250
    static int32_t or(double a);  // RVA: 0x67CD70
    static bool mil(Vector2Int a, int32_t b);  // RVA: 0x67B8E0
    static int32_t obj(Vector2 a);  // RVA: 0x67C090
    static bool eao(Vector2 a, int32_t b);  // RVA: 0x67BA60
    static bool vzm(bool a, int32_t b);  // RVA: 0x67BFC0
    static int32_t wau(Char[][] a);  // RVA: 0x67E020
    static int32_t kkk(Il2CppString* a);  // RVA: 0x67C780
    static int32_t nte(Il2CppString* a);  // RVA: 0x67CB20
};

// Namespace: <global>
class das : public CertificateHandler
{
public:

    // Methods
    bool ValidateCertificate(Byte[][] certificateData);  // RVA: 0x67E0F0
    void .ctor();  // RVA: 0x67E100
};

// Namespace: <global>
class dat
{
public:

    // Methods
    static bool dmi(double a, double b, double c);  // RVA: 0x67E110
    static bool waw(float a, float b, float c);  // RVA: 0x67E550
    static bool jco(double a, double b, double c);  // RVA: 0x67E370
    static bool wax(double a, double b, double c);  // RVA: 0x67E600
    static bool hyi(double a, double b, double c);  // RVA: 0x67E240
    static bool khn(float a, float b, float c);  // RVA: 0x67E4A0
};

// Namespace: <global>
class dau
{
public:

    // Methods
    static void way(System.IProgress<CodeStage.AntiCheat.Genuine.CodeHash.FilesProgress> a, int32_t b, int32_t c, int64_t d, Il2CppString* e);  // RVA: 0x67E730
};

// Namespace: <global>
class dav
{
public:

    // Methods
    static int32_t jdp();  // RVA: 0x67EAF0
    static uint64_t ixf();  // RVA: 0x67E8B0
    static uint8_t wba();  // RVA: 0x67EF80
    static wchar_t wbc();  // RVA: 0x67F020
    static uint8_t gsq();  // RVA: 0x67EA00
    static uint8_t fri();  // RVA: 0x67E910
    static int16_t wbd();  // RVA: 0x67F070
    static int8_t ftx();  // RVA: 0x67E960
    static int64_t wbh();  // RVA: 0x67E8B0
    static uint32_t jxl();  // RVA: 0x67EB40
    static Il2CppString* waz(int32_t a);  // RVA: 0x67EEA0
    static uint32_t wbg();  // RVA: 0x67EB40
    static int32_t wbf();  // RVA: 0x67EB40
    static int64_t ogh();  // RVA: 0x67EDB0
    static uint64_t wbi();  // RVA: 0x67E8B0
    static void wbj(Char[][] a);  // RVA: 0x67F110
    static int16_t los();  // RVA: 0x67EC30
    static Il2CppString* ndo(int32_t a);  // RVA: 0x67EC80
    static int32_t hwk();  // RVA: 0x67EA50
    static uint8_t cwt();  // RVA: 0x67E860
    static int64_t hzt();  // RVA: 0x67EAA0
    static int32_t kto();  // RVA: 0x67EBE0
    static int64_t uj();  // RVA: 0x67EE50
    static int32_t kqd();  // RVA: 0x67EB90
    static int64_t oh();  // RVA: 0x67EE00
    static uint8_t gfg();  // RVA: 0x67E9B0
    static int16_t nic();  // RVA: 0x67ED60
    static uint64_t dxj();  // RVA: 0x67E8B0
    static uint16_t wbe();  // RVA: 0x67F0C0
    static int8_t wbb();  // RVA: 0x67EFD0
};

// Namespace: <global>
class daw
{
public:
    // Static fields
    // static Char[][] bmnq;


    // Methods
    static Il2CppString* wbp(Byte[][] a);  // RVA: 0x67F3A0
    static Byte[][] wbk(Char[][] a);  // RVA: 0x67F230
    static Char[][] dkj(Byte[][] a);  // RVA: 0x67F270
    static Il2CppString* dvv(Byte[][] a);  // RVA: 0x67F2B0
    static Il2CppString* wbo(Byte[][] a, int32_t b, int32_t c);  // RVA: 0x67F340
    static Il2CppString* hyv(Byte[][] a);  // RVA: 0x67F2B0
    static Char[][] bhc(Byte[][] a);  // RVA: 0x67F270
    static Byte[][] wbl(Il2CppString* a);  // RVA: 0x67F2F0
    static Byte[][] cus(Char[][] a);  // RVA: 0x67F230
    static Il2CppString* wbn(Byte[][] a);  // RVA: 0x67F2B0
    static Il2CppString* ofi(Byte[][] a);  // RVA: 0x67F2B0
    static Char[][] kpc(Byte[][] a);  // RVA: 0x67F270
    static Byte[][] bcc(Char[][] a);  // RVA: 0x67F230
    static void .cctor();  // RVA: 0x67F1A0
    static Char[][] wbm(Byte[][] a);  // RVA: 0x67F270
    static Byte[][] mat(Il2CppString* a);  // RVA: 0x67F2F0
    static Il2CppString* ckv(Byte[][] a);  // RVA: 0x67F2B0
};

// Namespace: <global>
class dax`1
{
public:
    System.Collections.Concurrent.ConcurrentBag<a> bmnr; // 0x0000
    System.Func<a> bmns; // 0x0000

    // Methods
    void hyd();  // RVA: 0x42DD80
    a wbq();  // RVA: 0x563BC0
    void .ctor(System.Func<a> a);  // RVA: 0x418540
    void wbs();  // RVA: 0x42DD80
    void kbw();  // RVA: 0x42DD80
    void hsz();  // RVA: 0x42DD80
    void wbr(a a);  // RVA: 0x563BC0
};

// Namespace: <global>
class day
{
public:
    // Static fields
    // static Random* bmnt;
    // static Random* bmnu;


    // Methods
    static void hjt(Byte[][] a);  // RVA: 0x67F5A0
    static int64_t wbu(int64_t a, int64_t b);  // RVA: 0x680FF0
    static int64_t zj(int64_t a, int64_t b);  // RVA: 0x681910
    static void laj(Byte[][] a);  // RVA: 0x67FAA0
    static int64_t mwr(int64_t a, int64_t b);  // RVA: 0x680850
    static void .cctor();  // RVA: 0x67F520
    static void wbw(Char[][] a);  // RVA: 0x6814F0
    static int64_t wbx(Random* a, int64_t b, int64_t c);  // RVA: 0x681800
    static void mvs(Char[][] a);  // RVA: 0x680540
    static void ner(Char[][] a);  // RVA: 0x680AC0
    static void wbv(Byte[][] a);  // RVA: 0x681260
    static int32_t wbt(int32_t a, int32_t b);  // RVA: 0x680DD0
    static void wby(Random* a, Char[][] b);  // RVA: 0x681880
    static int64_t hsc(int64_t a, int64_t b);  // RVA: 0x67F830
    static void le(Byte[][] a);  // RVA: 0x680040
    static int64_t mcn(int64_t a, int64_t b);  // RVA: 0x6802D0
    static void lbu(Char[][] a);  // RVA: 0x67FD30
};

// Namespace: <global>
class daz
{
public:
    // Static fields
    // static int64_t bmnv;


    // Methods
    static int64_t wcb();  // RVA: 0x681DF0
    static int64_t wcd();  // RVA: 0x681E30
    static int64_t fqe();  // RVA: 0x681C50
    static int64_t czw();  // RVA: 0x681C10
    static int64_t wbz();  // RVA: 0x681D20
    static double ph();  // RVA: 0x681CB0
    static double czh();  // RVA: 0x681BA0
    static int64_t egr();  // RVA: 0x681C30
    static int64_t hxq();  // RVA: 0x681C70
    static int64_t jep();  // RVA: 0x681C90
    static double wca();  // RVA: 0x681D80
    static int64_t bgv();  // RVA: 0x681B80
    static int64_t wcc();  // RVA: 0x681E10
};

// Namespace: <global>
class dba
{
public:
    // Static fields
    // static uint32_t bmnw;
    // static uint32_t bmnx;
    // static uint32_t bmny;
    // static uint32_t bmnz;
    // static uint32_t bmoa;


    // Methods
    static uint32_t wce(Byte[][] a, int32_t b, uint32_t c);  // RVA: 0x682640
    static uint32_t wcf(Stream* a, int64_t b, uint32_t c);  // RVA: 0x682A70
    static uint32_t kqq(Byte[][] a, int32_t b, uint32_t c);  // RVA: 0x682440
    static uint32_t ffw(Byte[][] a, int32_t b, uint32_t c);  // RVA: 0x681E50
    static uint32_t hwh(Byte[][] a, int32_t b, uint32_t c);  // RVA: 0x682230
    static uint32_t hgf(Byte[][] a, int32_t b, uint32_t c);  // RVA: 0x682020
};

// Namespace: <global>
class dbb : public dcx`1
{
public:
    // Static fields
    // static bool bmob;
    // static bool bmoc;
    // static float bmod;
    // static float bmoe;
    // static float bmof;
    // static float bmog;
    // static float bmoh;
    // static float bmoi;
    // static bool bmoj;

    uint8_t pad_0000[0x30]; // 0x0000
    int64_t bmok; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    int64_t bmol; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    int64_t bmom; // 0x0040

    // Methods
    void eag();  // RVA: 0x683390
    void wct();  // RVA: 0x684C30
    static float wcj();  // RVA: 0x684460
    static void wcg();  // RVA: 0x684100
    static void wch();  // RVA: 0x684170
    static float wck();  // RVA: 0x684520
    static void ebj();  // RVA: 0x6834A0
    void lpn();  // RVA: 0x683A10
    void dyh();  // RVA: 0x6832F0
    static float wcl();  // RVA: 0x6845E0
    void Update();  // RVA: 0x682ED0
    void bci();  // RVA: 0x682FD0
    static float wcm();  // RVA: 0x6846A0
    void jou();  // RVA: 0x683760
    void mfq();  // RVA: 0x683CD0
    bool ocu();  // RVA: 0x683E80
    void .ctor();  // RVA: 0x682F90
    static void old();  // RVA: 0x684090
    void wcu(Scene a, LoadSceneMode b);  // RVA: 0x684CD0
    static float wci();  // RVA: 0x6843A0
    static void eox();  // RVA: 0x683510
    void wcs();  // RVA: 0x684B20
    void mfk();  // RVA: 0x683C10
    bool wcq();  // RVA: 0x684840
    static void lvh();  // RVA: 0x683BA0
    bool kgd();  // RVA: 0x683800
    void gl();  // RVA: 0x683690
    void lpu();  // RVA: 0x683AD0
    void wcr();  // RVA: 0x684A50
    void nco();  // RVA: 0x683DE0
    static float wco();  // RVA: 0x684820
    void esv();  // RVA: 0x683580
    bool clp();  // RVA: 0x6830E0
    static float wcn();  // RVA: 0x684760
    static void wcp(float a);  // RVA: 0x684830
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct StorageDataType
    {
    public:
        // Static fields
        // static StorageDataType Unknown;
        // static StorageDataType SByte;
        // static StorageDataType Byte;
        // static StorageDataType Int16;
        // static StorageDataType UInt16;
        // static StorageDataType Int32;
        // static StorageDataType UInt32;
        // static StorageDataType Int64;
        // static StorageDataType UInt64;
        // static StorageDataType Char;
        // static StorageDataType Single;
        // static StorageDataType Double;
        // static StorageDataType Decimal;
        // static StorageDataType BigInteger;
        // static StorageDataType Boolean;
        // static StorageDataType String;
        // static StorageDataType DateTime;
        // static StorageDataType ByteArray;
        // static StorageDataType Vector2;
        // static StorageDataType Vector2Int;
        // static StorageDataType Vector3;
        // static StorageDataType Vector3Int;
        // static StorageDataType Vector4;
        // static StorageDataType Quaternion;
        // static StorageDataType Color;
        // static StorageDataType Color32;
        // static StorageDataType Rect;
        // static StorageDataType RectInt;
        // static StorageDataType RangeInt;
        // static StorageDataType Matrix4x4;
        // static StorageDataType Ray;
        // static StorageDataType Ray2D;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredPrefsData
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        StorageDataType type; // 0x0010
        uint8_t pad_0011[0x7]; // 0x0011
        Byte[][] data; // 0x0018
    
        // Methods
        void .ctor(StorageDataType type, Byte[][] data);  // RVA: 0x679AE0
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbc
{
public:

    // Methods
    static Color32 ilg(Byte[][] a);  // RVA: 0x684D90
    static c wcy(Byte[][] a);  // RVA: 0x563BC0
    static T wdd(Byte[][] a);  // RVA: 0x563BC0
    static Color32 wcv(Byte[][] a);  // RVA: 0x684DD0
    static Color32 gew(Byte[][] a);  // RVA: 0x684D50
    static d wcz(StorageDataType a, Byte[][] b);  // RVA: 0x563BC0
    static f wdb(StorageDataType a, Byte[][] b);  // RVA: 0x563BC0
    static Byte[][] wda(StorageDataType a, e b);  // RVA: 0x563BC0
    static b wcx(ObscuredPrefsData a);  // RVA: 0x563BC0
    static ObscuredPrefsData wcw(a a);  // RVA: 0x563BC0
    static Byte[][] wdc(T a);  // RVA: 0x563BC0
};

// Namespace: <global>
class dbd
{
public:
    // Static fields
    // static Type* bmon;
    // static Type* bmoo;
    // static Type* bmop;
    // static Type* bmoq;
    // static Type* bmor;
    // static Type* bmos;
    // static Type* bmot;
    // static Type* bmou;
    // static Type* bmov;
    // static Type* bmow;
    // static Type* bmox;
    // static Type* bmoy;
    // static Type* bmoz;
    // static Type* bmpa;
    // static Type* bmpb;
    // static Type* bmpc;
    // static Type* bmpd;
    // static Type* bmpe;
    // static Type* bmpf;
    // static Type* bmpg;
    // static Type* bmph;
    // static Type* bmpi;
    // static Type* bmpj;
    // static Type* bmpk;
    // static Type* bmpl;
    // static Type* bmpm;
    // static Type* bmpn;
    // static Type* bmpo;
    // static Type* bmpp;
    // static Type* bmpq;
    // static Type* bmpr;


    // Methods
    static StorageDataType wde();  // RVA: 0x421260
    static void .cctor();  // RVA: 0x684E10
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    class UnsupportedDataTypeException : public Exception
    {
    public:
    
        // Methods
        void .ctor(Type* type);  // RVA: 0x679B60
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class HashCheckSumModifierDelegate : public MulticastDelegate
{
public:

    // Methods
    void .ctor(Il2CppObject* object, intptr_t method);  // RVA: 0x678F90
    Byte[][] Invoke(Il2CppString* input);  // RVA: 0x678E30
    IAsyncResult* BeginInvoke(Il2CppString* input, AsyncCallback* callback, Il2CppObject* object);  // RVA: 0x678F60
    Byte[][] EndInvoke(IAsyncResult* result);  // RVA: 0x678E20
};

// Namespace: <global>
class dbe
{
public:
    // Static fields
    // static Il2CppString* bmps;

    uint8_t pad_0000[0x10]; // 0x0000
    uint32_t bmpt; // 0x0010
    uint8_t pad_0011[0x3]; // 0x0011
    uint32_t bmpu; // 0x0014
    uint8_t pad_0015[0x3]; // 0x0015
    HashCheckSumModifierDelegate* bmpv; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bool <bmpw>k__BackingField; // 0x0020

    // Methods
    void wf(HashCheckSumModifierDelegate* a);  // RVA: 0x685BF0
    static void wdg(Il2CppString* a);  // RVA: 0x685930
    static void wdh();  // RVA: 0x685990
    uint32_t wdp(Il2CppString* a);  // RVA: 0x685C00
    static Il2CppString* lry();  // RVA: 0x685700
    bool wdj();  // RVA: 0x679730
    void wdk(bool a);  // RVA: 0x685A90
    static Il2CppString* wdi();  // RVA: 0x685700
    void .ctor(uint32_t a);  // RVA: 0x6856C0
    static Il2CppString* jfv();  // RVA: 0x685700
    uint32_t wdl();  // RVA: 0x685AA0
    void ivx(bool a);  // RVA: 0x6856F0
    static Il2CppString* grn();  // RVA: 0x685700
    void bvv(bool a);  // RVA: 0x6856F0
    void wdm(HashCheckSumModifierDelegate* a);  // RVA: 0x685BF0
    static Il2CppString* eoa();  // RVA: 0x685700
    static Il2CppString* wdf();  // RVA: 0x685880
    uint32_t nkh(Il2CppString* a);  // RVA: 0x685750
    void wdn(bool a);  // RVA: 0x6856F0
    void wdo();  // RVA: 0x685740
    void dcm(bool a);  // RVA: 0x6856F0
    void mwq(bool a);  // RVA: 0x6856F0
    void ksx();  // RVA: 0x685740
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct DeviceLockLevel
    {
    public:
        // Static fields
        // static DeviceLockLevel None;
        // static DeviceLockLevel Soft;
        // static DeviceLockLevel Strict;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbf
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    DeviceLockLevel <bmpx>k__BackingField; // 0x0010
    DeviceLockTamperingSensitivity <bmpy>k__BackingField; // 0x0011

    // Methods
    DeviceLockLevel wdq();  // RVA: 0x679A10
    void wdr(DeviceLockLevel a);  // RVA: 0x685D70
    DeviceLockTamperingSensitivity wds();  // RVA: 0x685D80
    void wdt(DeviceLockTamperingSensitivity a);  // RVA: 0x685D90
    void .ctor(DeviceLockLevel a, DeviceLockTamperingSensitivity b);  // RVA: 0x685D30
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct DeviceLockTamperingSensitivity
    {
    public:
        // Static fields
        // static DeviceLockTamperingSensitivity Disabled;
        // static DeviceLockTamperingSensitivity Low;
        // static DeviceLockTamperingSensitivity Normal;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

    // Namespace: CodeStage.AntiCheat.Storage
    class DeviceUniqueIdentifierException : public BackgroundThreadAccessException
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x678EF0
    };

    // Namespace: CodeStage.AntiCheat.Storage
    class PersistentDataPathException : public BackgroundThreadAccessException
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x679B00
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbg
{
public:
    // Static fields
    // static Il2CppString* bmpz;
    // static Il2CppString* bmqa;
    // static dbe* bmqb;

    uint8_t pad_0000[0x10]; // 0x0000
    Action* bmqc; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Action* bmqd; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    dbq* <bmqe>k__BackingField; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Il2CppString* <bmqf>k__BackingField; // 0x0028

    // Methods
    ObscuredFileWriteResult wed(Byte[][] a);  // RVA: 0x686860
    void wdv(Action* a);  // RVA: 0x68B3F0
    ObscuredFileReadResult j();  // RVA: 0x688AB0
    ObscuredFileHeader jlc(Stream* a);  // RVA: 0x686890
    Il2CppString* jky(Il2CppString* a);  // RVA: 0x689720
    ObscuredFileWriteResult cv(Byte[][] a);  // RVA: 0x6868F0
    ObscuredFileWriteResult bu(Byte[][] a);  // RVA: 0x686360
    ObscuredFileHeader cxx(Stream* a);  // RVA: 0x686890
    ObscuredFileReadResult wef();  // RVA: 0x68B6B0
    void omu(Stream* a, DeviceLockLevel b);  // RVA: 0x68B230
    void ghw(Stream* a);  // RVA: 0x686E30
    void .ctor(Il2CppString* a, dbq* b);  // RVA: 0x685E20
    void vw(Stream* a, DeviceLockLevel b);  // RVA: 0x68B2C0
    void wdu(Action* a);  // RVA: 0x68B350
    void wej(Stream* a, DeviceLockLevel b);  // RVA: 0x68C890
    ObscuredFileWriteResult mbl(Byte[][] a);  // RVA: 0x68A830
    void gok(Stream* a);  // RVA: 0x686EA0
    ObscuredFileReadResult wee();  // RVA: 0x686DF0
    ObscuredFileReadResult exj();  // RVA: 0x686DF0
    static void .cctor();  // RVA: 0x685DA0
    Il2CppString* wek(Il2CppString* a);  // RVA: 0x68C920
    void .ctor(Il2CppString* a);  // RVA: 0x685F20
    ObscuredFileWriteResult nzb(Byte[][] a);  // RVA: 0x68AD30
    ObscuredFileWriteResult weh(Byte[][] a);  // RVA: 0x68C320
    dbq* wdy();  // RVA: 0x63AEB0
    bool wdz();  // RVA: 0x68B5D0
    ObscuredFileHeader cjd(Stream* a);  // RVA: 0x686890
    void wdw(Action* a);  // RVA: 0x68B490
    static void web(Il2CppString* a);  // RVA: 0x68B5F0
    void hvp(Stream* a);  // RVA: 0x687B80
    Il2CppString* klx(Il2CppString* a);  // RVA: 0x689970
    void boe(Stream* a, DeviceLockLevel b);  // RVA: 0x6862D0
    ObscuredFileReadResult idr();  // RVA: 0x687BF0
    Il2CppString* beh(Il2CppString* a);  // RVA: 0x686080
    void .ctor();  // RVA: 0x685FC0
    ObscuredFileWriteResult cdl(Byte[][] a);  // RVA: 0x686860
    Il2CppString* wea();  // RVA: 0x68B5E0
    void wei(Stream* a);  // RVA: 0x68C820
    ObscuredFileHeader kcj(Stream* a);  // RVA: 0x686890
    ObscuredFileReadResult jfq();  // RVA: 0x686DF0
    void .ctor(dbr* a);  // RVA: 0x685E80
    ObscuredFileReadResult gta();  // RVA: 0x686F10
    Il2CppString* idt(Il2CppString* a);  // RVA: 0x688860
    void wec();  // RVA: 0x68B680
    void wdx(Action* a);  // RVA: 0x68B530
    ObscuredFileReadResult lai();  // RVA: 0x689BC0
    ObscuredFileHeader weg(Stream* a);  // RVA: 0x686890
    ObscuredFileReadResult nnt();  // RVA: 0x686DF0
    ObscuredFileReadResult fix();  // RVA: 0x686DF0
};

// Namespace: <global>
class dbh
{
public:
    // Static fields
    // static int32_t bmqg;
    // static int32_t bmqh;
    // static Byte[][] bmqi;


    // Methods
    static void ojf(Stream* a, Stream* b, dbp* c);  // RVA: 0x68CF20
    static void wem(Stream* a, Stream* b, dbp* c);  // RVA: 0x68CF20
    static void gyr(Stream* a, Stream* b, dbp* c);  // RVA: 0x68CC90
    static void ps(Stream* a, Stream* b, dbp* c);  // RVA: 0x68CC90
    static void wep(Stream* a, uint32_t b);  // RVA: 0x68D000
    static uint32_t wen(Stream* a);  // RVA: 0x68CE30
    static void nvx(Stream* a, Stream* b, dbp* c);  // RVA: 0x68CE70
    static uint32_t weq(Stream* a);  // RVA: 0x68CE30
    static void nha(Stream* a, Stream* b, dbp* c);  // RVA: 0x68CC90
    static uint32_t leh(Stream* a);  // RVA: 0x68CD80
    static uint32_t iqj(Byte[][] a);  // RVA: 0x68CD40
    static uint32_t wes(Byte[][] a);  // RVA: 0x68D0E0
    static void wel(Stream* a, Stream* b, dbp* c);  // RVA: 0x68CC90
    static uint32_t mkk(Byte[][] a);  // RVA: 0x68CDC0
    static uint32_t noo(Stream* a);  // RVA: 0x68CE30
    static void wer(Stream* a, Stream* b, dbp* c);  // RVA: 0x68CC90
    static uint32_t nez(Byte[][] a);  // RVA: 0x68CDD0
    static uint32_t opx(Stream* a);  // RVA: 0x68CF30
    static uint32_t fgc(Stream* a);  // RVA: 0x68CBA0
    static void fls(Stream* a, Stream* b, dbp* c);  // RVA: 0x68CBE0
    static uint32_t nkk(Stream* a);  // RVA: 0x68CDF0
    static uint32_t weo(Stream* a);  // RVA: 0x68CF70
    static void mrt(Stream* a, Stream* b, dbp* c);  // RVA: 0x68CC90
    static void wet(Stream* a, Stream* b, dbp* c);  // RVA: 0x68D100
    static uint32_t ivo(Byte[][] a);  // RVA: 0x68CD60
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileHeader
    {
    public:
        // Static fields
        // static uint8_t HeaderByte1;
        // static uint8_t HeaderByte2;
        // static uint8_t HeaderByte3;
        // static uint8_t HeaderByte4;
        // static uint8_t HeaderVersion;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t <Byte1>k__BackingField; // 0x0010
        uint8_t <Byte2>k__BackingField; // 0x0011
        uint8_t <Byte3>k__BackingField; // 0x0012
        uint8_t <Byte4>k__BackingField; // 0x0013
        uint8_t <Version>k__BackingField; // 0x0014
        ObscurationMode <ObscurationMode>k__BackingField; // 0x0015
    
        // Methods
        uint8_t get_Byte1();  // RVA: 0x679160
        void set_Byte1(uint8_t value);  // RVA: 0x679200
        uint8_t get_Byte2();  // RVA: 0x6791B0
        void set_Byte2(uint8_t value);  // RVA: 0x679210
        uint8_t get_Byte3();  // RVA: 0x6791C0
        void set_Byte3(uint8_t value);  // RVA: 0x679220
        uint8_t get_Byte4();  // RVA: 0x6791D0
        void set_Byte4(uint8_t value);  // RVA: 0x679230
        uint8_t get_Version();  // RVA: 0x6791F0
        void set_Version(uint8_t value);  // RVA: 0x679250
        ObscurationMode get_ObscurationMode();  // RVA: 0x6791E0
        void set_ObscurationMode(ObscurationMode value);  // RVA: 0x679240
        bool IsValid();  // RVA: 0x679180
        void weu(Stream* a);  // RVA: 0x679260
        static void wev(Stream* a, ObscurationMode b);  // RVA: 0x679320
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileErrorCode
    {
    public:
        // Static fields
        // static ObscuredFileErrorCode NoError;
        // static ObscuredFileErrorCode FileNotFound;
        // static ObscuredFileErrorCode FileDamaged;
        // static ObscuredFileErrorCode DataIsNotLocked;
        // static ObscuredFileErrorCode NotInitialized;
        // static ObscuredFileErrorCode OtherException;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileError
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        ObscuredFileErrorCode <ErrorCode>k__BackingField; // 0x0010
        uint8_t pad_0011[0x7]; // 0x0011
        Exception* <Exception>k__BackingField; // 0x0018
    
        // Methods
        ObscuredFileErrorCode get_ErrorCode();  // RVA: 0x679160
        Exception* get_Exception();  // RVA: 0x679170
        void .ctor(ObscuredFileErrorCode code);  // RVA: 0x679140
        void .ctor(Exception* exception);  // RVA: 0x679130
        Il2CppString* ToString();  // RVA: 0x679050
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileReadResult
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        Byte[][] <Data>k__BackingField; // 0x0010
        uint8_t pad_0011[0x7]; // 0x0011
        bool <DataIsNotGenuine>k__BackingField; // 0x0018
        bool <DataFromAnotherDevice>k__BackingField; // 0x0019
        uint8_t pad_001A[0x6]; // 0x001A
        ObscuredFileError <Error>k__BackingField; // 0x0020
        uint8_t pad_0021[0xF]; // 0x0021
        bool <IsValid>k__BackingField; // 0x0030
    
        // Methods
        bool wew();  // RVA: 0x679740
        Byte[][] get_Data();  // RVA: 0x679710
        bool wex();  // RVA: 0x679770
        bool get_DataIsNotGenuine();  // RVA: 0x679700
        bool get_DataFromAnotherDevice();  // RVA: 0x6796F0
        ObscuredFileError get_Error();  // RVA: 0x679720
        bool get_IsValid();  // RVA: 0x679730
        void .ctor(Byte[][] data, bool dataIsNotGenuine, bool dataFromAnotherDevice);  // RVA: 0x6796A0
        void .ctor(ObscuredFileError error);  // RVA: 0x679650
        static ObscuredFileReadResult wey(Exception* a);  // RVA: 0x679780
        static ObscuredFileReadResult wez(ObscuredFileErrorCode a);  // RVA: 0x679800
        Il2CppString* ToString();  // RVA: 0x6793E0
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileWriteResult
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        ObscuredFileError <Error>k__BackingField; // 0x0010
        uint8_t pad_0011[0xF]; // 0x0011
        bool <IsValid>k__BackingField; // 0x0020
    
        // Methods
        bool wfa();  // RVA: 0x679A20
        ObscuredFileError get_Error();  // RVA: 0x679A00
        bool get_IsValid();  // RVA: 0x679A10
        void .ctor(ObscuredFileErrorCode result);  // RVA: 0x6799B0
        void .ctor(ObscuredFileError error);  // RVA: 0x679980
        static ObscuredFileWriteResult wfb(Exception* a);  // RVA: 0x679A30
        static ObscuredFileWriteResult wfc(ObscuredFileErrorCode a);  // RVA: 0x679A80
        Il2CppString* ToString();  // RVA: 0x679880
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbi
{
public:
    // Static fields
    // static Il2CppString* bmqj;
    // static Il2CppString* bmqk;
    // static Action* bmql;
    // static Action* bmqm;
    // static dbg* bmqn;
    // static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> bmqo;
    // static Il2CppObject* bmqp;
    // static bool <bmqq>k__BackingField;
    // static bool <bmqr>k__BackingField;
    // static bool <bmqs>k__BackingField;
    // static ObscuredFileReadResult <bmqt>k__BackingField;
    // static ObscuredFileWriteResult <bmqu>k__BackingField;
    // static dbl* <bmqv>k__BackingField;


    // Methods
    static void iym(bool a);  // RVA: 0x690F40
    static Il2CppString* whk();  // RVA: 0x697290
    static ObscuredFileWriteResult mlh(Byte[][] a);  // RVA: 0x692B00
    static ObscuredLong wgl(Il2CppString* a, ObscuredLong b);  // RVA: 0x696250
    static void lcf(Il2CppString* a, ObscuredULong b);  // RVA: 0x6924C0
    static void bpq();  // RVA: 0x68DB50
    static void wfu(Il2CppString* a, ObscuredULong b);  // RVA: 0x6955A0
    static ObscuredDateTimeOffset wge(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x695C10
    static dbg* dbi(Il2CppString* a, dbq* b);  // RVA: 0x68E6B0
    static ObscuredVector2Int wgu(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x6968D0
    static void whq(dbl* a);  // RVA: 0x697520
    static void wfo(Il2CppString* a, ObscuredLong b);  // RVA: 0x695250
    static void ont(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x694780
    static void mxb(Il2CppString* a, ObscuredGuid b);  // RVA: 0x6932F0
    static void gqs();  // RVA: 0x68FAF0
    static ObscuredFileWriteResult whn();  // RVA: 0x6973E0
    static void wft(Il2CppString* a, ObscuredUInt b);  // RVA: 0x695520
    static void wfj(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x694F30
    static ObscuredBool wga(Il2CppString* a, ObscuredBool b);  // RVA: 0x695950
    static ObscuredChar wgc(Il2CppString* a, ObscuredChar b);  // RVA: 0x695A90
    static void omf(Il2CppString* a, ObscuredSByte b);  // RVA: 0x694700
    static ObscuredFileReadResult kol();  // RVA: 0x691C30
    static dbl* whp();  // RVA: 0x6974D0
    static ObscuredLong fbg(Il2CppString* a, ObscuredLong b);  // RVA: 0x68F000
    static ObscuredDecimal wgf(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x695D00
    static ObscuredFileWriteResult wij();  // RVA: 0x698A80
    static ObscuredDateTime wgd(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x695B50
    static void wic();  // RVA: 0x698290
    static void gyv(Il2CppString* a, ObscuredString* b);  // RVA: 0x68FD60
    static void gts(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x68FCB0
    static ObscuredDouble ibb(Il2CppString* a, ObscuredDouble b);  // RVA: 0x690710
    static ObscuredVector2 wgt(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x696800
    static ObscuredChar mgk(Il2CppString* a, ObscuredChar b);  // RVA: 0x692970
    static void wil(Il2CppString* a, d b);  // RVA: 0x563BC0
    static void wha(Action* a);  // RVA: 0x696E70
    static ObscuredString* wgp(Il2CppString* a, ObscuredString* b);  // RVA: 0x696550
    static ObscuredSByte wgn(Il2CppString* a, ObscuredSByte b);  // RVA: 0x696410
    static void wfe(Il2CppString* a, ObscuredByte b);  // RVA: 0x694C30
    static void bth(bool a);  // RVA: 0x68DD10
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> gaf();  // RVA: 0x68F570
    static ObscuredULong wgr(Il2CppString* a, ObscuredULong b);  // RVA: 0x696680
    static ObscuredUInt pr(Il2CppString* a, ObscuredUInt b);  // RVA: 0x6949A0
    static bool cuw(Il2CppString* a);  // RVA: 0x68E570
    static void wfm(Il2CppString* a, ObscuredGuid b);  // RVA: 0x695120
    static void wfs(Il2CppString* a, ObscuredString* b);  // RVA: 0x6954A0
    static void cge(Il2CppString* a, bool b);  // RVA: 0x68E1D0
    static void whs(bool a);  // RVA: 0x6976A0
    static ObscuredUInt foe(Il2CppString* a, ObscuredUInt b);  // RVA: 0x68F280
    static ObscuredQuaternion wgm(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x696310
    static void wfk(Il2CppString* a, ObscuredDouble b);  // RVA: 0x694FE0
    static void jhy(Il2CppString* a, ObscuredShort b);  // RVA: 0x691300
    static void ola(Il2CppString* a, ObscuredByte b);  // RVA: 0x694440
    static ObscuredLong gks(Il2CppString* a, ObscuredLong b);  // RVA: 0x68FA30
    static ObscuredVector2Int mby(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x6928B0
    static bool whf();  // RVA: 0x6970D0
    static void wgx(Action* a);  // RVA: 0x696B90
    static void whh(bool a);  // RVA: 0x697180
    static void bke(Il2CppString* a, ObscuredInt b);  // RVA: 0x68DAD0
    static void dxl(Il2CppString* a, ObscuredUShort b);  // RVA: 0x68ED50
    static void wfn(Il2CppString* a, ObscuredInt b);  // RVA: 0x6951D0
    static ObscuredFileReadResult whl();  // RVA: 0x6972E0
    static ObscuredChar cwu(Il2CppString* a, ObscuredChar b);  // RVA: 0x68E5F0
    static void lul(Il2CppString* a, ObscuredULong b);  // RVA: 0x692650
    static dbg* whr();  // RVA: 0x697590
    static void kp(Il2CppString* a);  // RVA: 0x691E10
    static ObscuredUShort jpx(Il2CppString* a, ObscuredUShort b);  // RVA: 0x691670
    static ObscuredLong gtq(Il2CppString* a, ObscuredLong b);  // RVA: 0x68FBF0
    static void wfw(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x6956C0
    static void wht(Il2CppString* a, bool b);  // RVA: 0x697760
    static ObscuredBigInteger heq(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x6901E0
    static void whv(Il2CppString* a, dbq* b, bool c);  // RVA: 0x697890
    static void wfr(Il2CppString* a, ObscuredShort b);  // RVA: 0x695410
    static ObscuredByte wgb(Il2CppString* a, ObscuredByte b);  // RVA: 0x695A10
    static void why(bool a);  // RVA: 0x697FC0
    static void wfp(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x6952E0
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wii();  // RVA: 0x698680
    static void wib(Il2CppString* a);  // RVA: 0x6981A0
    static void mny(Il2CppString* a, ObscuredGuid b);  // RVA: 0x692E80
    static void mzz(Il2CppString* a, ObscuredShort b);  // RVA: 0x693490
    static void wid(Il2CppString* a, a b);  // RVA: 0x563BC0
    static ObscuredVector3 wgv(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x696990
    static void ezc(Il2CppString* a, ObscuredDouble b);  // RVA: 0x68EF60
    static void oli(Il2CppString* a, dbq* b, bool c);  // RVA: 0x6944C0
    static void wih();  // RVA: 0x698610
    static void isj(Il2CppString* a);  // RVA: 0x690D50
    static void whd(bool a);  // RVA: 0x697010
    static bool whc();  // RVA: 0x696FC0
    static void yu();  // RVA: 0x699060
    static ObscuredSByte eeh(Il2CppString* a, ObscuredSByte b);  // RVA: 0x68EDE0
    static ObscuredDateTimeOffset cls(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x68E320
    static ObscuredByte hsu(Il2CppString* a, ObscuredByte b);  // RVA: 0x6905D0
    static void kly(Il2CppString* a, ObscuredByte b);  // RVA: 0x691A80
    static void eyi(Il2CppString* a, ObscuredByte b);  // RVA: 0x68EEE0
    static ObscuredDateTimeOffset kvc(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x692030
    static void ktt(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x691F80
    static ObscuredSByte knt(Il2CppString* a, ObscuredSByte b);  // RVA: 0x691B00
    static void or(Il2CppString* a, ObscuredSByte b);  // RVA: 0x6948B0
    static void g(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x68F4C0
    static void dly(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x68EB00
    static ObscuredUInt wgq(Il2CppString* a, ObscuredUInt b);  // RVA: 0x6965D0
    static void whw();  // RVA: 0x697AD0
    static ObscuredInt wgk(Il2CppString* a, ObscuredInt b);  // RVA: 0x6961A0
    static dbg* ihb(Il2CppString* a, dbq* b);  // RVA: 0x6908D0
    static void fji(Il2CppString* a, ObscuredString* b);  // RVA: 0x68F0C0
    static void gsv(Il2CppString* a, ObscuredUShort b);  // RVA: 0x68FB60
    static void wfz(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x6958A0
    static void ope(Il2CppString* a, ObscuredDouble b);  // RVA: 0x694810
    static ObscuredDouble wgh(Il2CppString* a, ObscuredDouble b);  // RVA: 0x695F00
    static void wfg(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x694D40
    static ObscuredVector3Int wgw(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x696A90
    static void wfv(Il2CppString* a, ObscuredUShort b);  // RVA: 0x695630
    static dbg* wif(Il2CppString* a, dbq* b);  // RVA: 0x698480
    static ObscuredVector3Int kxs(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x692310
    static void kdx(Il2CppString* a, ObscuredChar b);  // RVA: 0x691910
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> ohb();  // RVA: 0x693F10
    static void lvm(Il2CppString* a, ObscuredInt b);  // RVA: 0x6926E0
    static void yx(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x6990D0
    static ObscuredDateTimeOffset mza(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x6933A0
    static void cmh(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x68E410
    static void fmp(Il2CppString* a, bool b);  // RVA: 0x68F1F0
    static void hgb(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x6903E0
    static void wfx(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x695760
    static void msg(Il2CppString* a, ObscuredShort b);  // RVA: 0x693260
    static void nly(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x6937F0
    static System.Collections.Generic.ICollection<System.String> wia();  // RVA: 0x698120
    static void wfy(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x6957F0
    static void whx();  // RVA: 0x697C90
    static void lgx();  // RVA: 0x692550
    static void kvo();  // RVA: 0x692120
    static void wff(Il2CppString* a, ObscuredChar b);  // RVA: 0x694CB0
    static void jan(Il2CppString* a, ObscuredFloat b);  // RVA: 0x691020
    static ObscuredGuid wgj(Il2CppString* a, ObscuredGuid b);  // RVA: 0x6960A0
    static void jj(Il2CppString* a, ObscuredFloat b);  // RVA: 0x691390
    static void vj(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x694B10
    static ObscuredFileWriteResult iju();  // RVA: 0x6909F0
    static ObscuredFileReadResult wim();  // RVA: 0x698C60
    static ObscuredVector2Int clg(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x68E260
    static void dqj();  // RVA: 0x68EB90
    static void jct(Il2CppString* a, dbq* b, bool c);  // RVA: 0x6910C0
    static ObscuredVector2Int beu(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x68DA10
    static void bbs(Il2CppString* a, dbq* b, bool c);  // RVA: 0x68D7D0
    static void fjo(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x68F140
    static ObscuredChar ggi(Il2CppString* a, ObscuredChar b);  // RVA: 0x68F970
    static void wfl(Il2CppString* a, ObscuredFloat b);  // RVA: 0x695080
    static ObscuredString* oja(Il2CppString* a, ObscuredString* b);  // RVA: 0x6943C0
    static ObscuredFileWriteResult nzu(Byte[][] a);  // RVA: 0x693A50
    static void whm(ObscuredFileReadResult a);  // RVA: 0x697350
    static void whu(dbq* a, bool b);  // RVA: 0x6977F0
    static void nhl(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x693740
    static void whj(bool a);  // RVA: 0x697230
    static ObscuredLong hvy(Il2CppString* a, ObscuredLong b);  // RVA: 0x690650
    static c wik(Il2CppString* a, c b);  // RVA: 0x563BC0
    static void mna(dbq* a, bool b);  // RVA: 0x692D20
    static bool whz(Il2CppString* a);  // RVA: 0x6980A0
    static ObscuredQuaternion nni(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x6938A0
    static void ohs(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x694310
    static ObscuredUShort wgs(Il2CppString* a, ObscuredUShort b);  // RVA: 0x696740
    static void wfq(Il2CppString* a, ObscuredSByte b);  // RVA: 0x695390
    static void jvy(Il2CppString* a, ObscuredDouble b);  // RVA: 0x6917E0
    static ObscuredShort oaq(Il2CppString* a, ObscuredShort b);  // RVA: 0x693C70
    static ObscuredFloat wgi(Il2CppString* a, ObscuredFloat b);  // RVA: 0x695FE0
    static ObscuredString* kqf(Il2CppString* a, ObscuredString* b);  // RVA: 0x691F00
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> bwm();  // RVA: 0x68DDD0
    static ObscuredFileWriteResult win(Byte[][] a);  // RVA: 0x698E40
    static ObscuredDouble ics(Il2CppString* a, ObscuredDouble b);  // RVA: 0x6907F0
    static void lbo(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x692410
    static void fos(Il2CppString* a, ObscuredLong b);  // RVA: 0x68F330
    static ObscuredVector2 mig(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x692A30
    static ObscuredVector2 iov(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x690C80
    static void ofg(Il2CppString* a, ObscuredDouble b);  // RVA: 0x693E70
    static ObscuredShort wgo(Il2CppString* a, ObscuredShort b);  // RVA: 0x696490
    static void wig();  // RVA: 0x6985A0
    static void jrc(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x691730
    static void jlv(Il2CppString* a, dbq* b, bool c);  // RVA: 0x691430
    static void nsk(Il2CppString* a, ObscuredGuid b);  // RVA: 0x6939A0
    static ObscuredVector3Int hff(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x6902E0
    static void kfe(bool a);  // RVA: 0x6919A0
    static void hgh(bool a);  // RVA: 0x690490
    static ObscuredUInt koj(Il2CppString* a, ObscuredUInt b);  // RVA: 0x691B80
    static void csg(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x68E4C0
    static void oen(dbq* a, bool b);  // RVA: 0x693DD0
    static void oc(dbq* a, bool b);  // RVA: 0x693D30
    static void osl();  // RVA: 0x694930
    static void eis(Il2CppString* a, ObscuredInt b);  // RVA: 0x68EE60
    static void wfh(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x694DD0
    static ObscuredSByte hjw(Il2CppString* a, ObscuredSByte b);  // RVA: 0x690550
    static b wie(Il2CppString* a, b b);  // RVA: 0x563BC0
    static void wfi(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x694E80
    static bool whi();  // RVA: 0x6971E0
    static ObscuredUInt iok(Il2CppString* a, ObscuredUInt b);  // RVA: 0x690BD0
    static void dgz();  // RVA: 0x68E7D0
    static ObscuredShort uy(Il2CppString* a, ObscuredShort b);  // RVA: 0x694A50
    static void .cctor();  // RVA: 0x68D750
    static void wfd(Il2CppString* a, ObscuredBool b);  // RVA: 0x694BA0
    static ObscuredChar mnp(Il2CppString* a, ObscuredChar b);  // RVA: 0x692DC0
    static void wgz(Action* a);  // RVA: 0x696D70
    static bool Save();  // RVA: 0x68D200
    static ObscuredVector2Int mbk(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x6927F0
    static void ltj(Il2CppString* a, ObscuredLong b);  // RVA: 0x6925C0
    static ObscuredBigInteger wgg(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x695E00
    static void mam(Il2CppString* a, ObscuredLong b);  // RVA: 0x692760
    static void who(ObscuredFileWriteResult a);  // RVA: 0x697450
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> he();  // RVA: 0x68FDE0
    static ObscuredBigInteger fyh(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x68F3C0
    static void wgy(Action* a);  // RVA: 0x696C80
    static void jwy(Il2CppString* a, ObscuredUShort b);  // RVA: 0x691880
    static bool whe();  // RVA: 0x697070
    static dbq* whb();  // RVA: 0x696F70
    static void mrp();  // RVA: 0x692F30
    static bool whg();  // RVA: 0x697130
    static ObscuredVector3 iwx(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x690E40
    static ObscuredFileWriteResult nar(Byte[][] a);  // RVA: 0x693520
};

// Namespace: <global>
class dbj
{
public:
    // Static fields
    // static bool bmqw;


    // Methods
    static void wit();  // RVA: 0x699CB0
    static void wio();  // RVA: 0x699930
    static void ggz();  // RVA: 0x6994E0
    static bool ccj();  // RVA: 0x699160
    static void hmy(bool a);  // RVA: 0x699750
    static void lqn(bool a);  // RVA: 0x699840
    static bool els();  // RVA: 0x699160
    static void wir(bool a);  // RVA: 0x699BB0
    static bool wip();  // RVA: 0x699160
    static void wiq(bool a);  // RVA: 0x699BA0
    static void wis(bool a);  // RVA: 0x699BC0
    static void dsd(bool a);  // RVA: 0x699180
    static void etd();  // RVA: 0x699270
    static bool dsw();  // RVA: 0x699160
};

// Namespace: <global>
class dbk
{
public:

    // Methods
    static ObscuredPrefsData wiu(a a, dbl* b);  // RVA: 0x563BC0
    static b wiv(ObscuredPrefsData a, dbl* b);  // RVA: 0x563BC0
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wix(Byte[][] a, dbl* b);  // RVA: 0x699EF0
    static Byte[][] wiw(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a, dbl* b);  // RVA: 0x699E80
    static dbn* wiy(dbl* a);  // RVA: 0x699FC0
    static Byte[][] eut(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a, dbl* b);  // RVA: 0x699E10
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct ACTkSerializationKind
    {
    public:
        // Static fields
        // static ACTkSerializationKind Binary;
    
        uint8_t pad_0000[0x10]; // 0x0000
        int32_t value__; // 0x0010
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbl
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    ACTkSerializationKind <bmqx>k__BackingField; // 0x0010

    // Methods
    ACTkSerializationKind wiz();  // RVA: 0x678C30
    void .ctor(ACTkSerializationKind a);  // RVA: 0x6856C0
};

// Namespace: <global>
class dbm
{
public:
    // Static fields
    // static uint8_t bmqy;
    // static dbm* bmqz;


    // Methods
    Byte[][] wjd(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a);  // RVA: 0x69A4C0
    static dbn* h();  // RVA: 0x69A160
    void .ctor();  // RVA: 0x628390
    System.ValueTuple<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> olg(BinaryReader* a);  // RVA: 0x69A320
    void mlg(BinaryWriter* a, Il2CppString* b, ObscuredPrefsData c);  // RVA: 0x69A280
    void wjf(BinaryWriter* a, Il2CppString* b, ObscuredPrefsData c);  // RVA: 0x69A280
    b wjc(ObscuredPrefsData a);  // RVA: 0x563BC0
    static dbn* kcn();  // RVA: 0x69A1F0
    System.ValueTuple<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wjg(BinaryReader* a);  // RVA: 0x69ACC0
    ObscuredPrefsData wjb(a a);  // RVA: 0x563BC0
    static dbn* gun();  // RVA: 0x69A0D0
    System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wje(Byte[][] a);  // RVA: 0x69A8B0
    static dbn* wja();  // RVA: 0x69A430
    void mxg(BinaryWriter* a, Il2CppString* b, ObscuredPrefsData c);  // RVA: 0x69A280
};

// Namespace: <global>
class dbn
{
public:

    // Methods
    ObscuredPrefsData wjb(a a);  // RVA: 0x563BC0
    b wjc(ObscuredPrefsData a);  // RVA: 0x563BC0
    Byte[][] wjd(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a);  // RVA: 0x4193D0
    System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wje(Byte[][] a);  // RVA: 0x4193D0
};

// Namespace: <global>
class dbo
{
public:
    // Static fields
    // static dbo* bmra;


    // Methods
    Byte[][] wjd(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a);  // RVA: 0x69ADD0
    b wjc(ObscuredPrefsData a);  // RVA: 0x563BC0
    System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wje(Byte[][] a);  // RVA: 0x69AE10
    static dbn* wjh();  // RVA: 0x69AE50
    void .ctor();  // RVA: 0x628390
    ObscuredPrefsData wjb(a a);  // RVA: 0x563BC0
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscurationMode
    {
    public:
        // Static fields
        // static ObscurationMode Plain;
        // static ObscurationMode Encrypted;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbp
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    ObscurationMode <bmrb>k__BackingField; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Byte[][] <bmrc>k__BackingField; // 0x0018

    // Methods
    ObscurationMode wji();  // RVA: 0x679A10
    Byte[][] wjj();  // RVA: 0x69B000
    void .ctor(Il2CppString* a);  // RVA: 0x69AEE0
    void .ctor(Byte[][] a);  // RVA: 0x69AFB0
};

// Namespace: <global>
class dbq
{
public:

    // Methods
    ObscuredFileLocation wjk();  // RVA: 0x4211E0
    dbp* wjl();  // RVA: 0x41C1E0
    dbf* wjm();  // RVA: 0x41C1E0
    bool wjn();  // RVA: 0x4211E0
    bool wjo();  // RVA: 0x4211E0
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileLocation
    {
    public:
        // Static fields
        // static ObscuredFileLocation PersistentData;
        // static ObscuredFileLocation Custom;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbr
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    ObscuredFileLocation <bmrd>k__BackingField; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    dbp* <bmre>k__BackingField; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    dbf* <bmrf>k__BackingField; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    bool <bmrg>k__BackingField; // 0x0028
    bool <bmrh>k__BackingField; // 0x0029

    // Methods
    ObscuredFileLocation wjk();  // RVA: 0x679A10
    void wjp(ObscuredFileLocation a);  // RVA: 0x685D70
    dbp* wjl();  // RVA: 0x69B000
    void wjq(dbp* a);  // RVA: 0x685BF0
    dbf* wjm();  // RVA: 0x63AEB0
    void wjr(dbf* a);  // RVA: 0x63AEC0
    bool wjn();  // RVA: 0x63AED0
