// ============================================================
// Image: Assembly-CSharp.dll
// ============================================================

// Namespace: <global>
class b : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Unit* OwnerUnit; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Animator* Animatior; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    EUNITSTATE bawd; // 0x0030

    // Methods
    void dmo();  // RVA: 0x813DB0
    void Update();  // RVA: 0x63E5A0
    void dtn(Il2CppString* a);  // RVA: 0x813E90
    void dtm(float a);  // RVA: 0x813E70
    void dtl(EUNITSTATE a);  // RVA: 0x417650
    void ogi(float a);  // RVA: 0x813E70
    void jfo();  // RVA: 0x813F70
    void byk();  // RVA: 0x813CF0
    void Awake();  // RVA: 0x813C30
    void iw();  // RVA: 0x813EB0
    void .ctor();  // RVA: 0x628740
};

// Namespace: <global>
class c : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Action* OnACTIVE; // 0x0020

    // Methods
    void .ctor();  // RVA: 0x628740
    void dto(Action* a);  // RVA: 0x81B1F0
    void dtp();  // RVA: 0x81B290
};

// Namespace: <global>
class g
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bawe; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* bawf; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    FlickerController* bawg; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float bawh; // 0x0028

    // Methods
    void .ctor(int32_t a);  // RVA: 0x6856C0
    void dtq();  // RVA: 0x63E5A0
    bool MoveNext();  // RVA: 0x81B2B0
    Il2CppObject* dtr();  // RVA: 0x69B000
    void dts();  // RVA: 0x81B3F0
    Il2CppObject* dtt();  // RVA: 0x69B000
};

// Namespace: <global>
class FlickerController : public MonoBehaviour
{
public:
    // Static fields
    // static MaterialPropertyBlock* bawi;
    // static int32_t bawj;

    uint8_t pad_0000[0x20]; // 0x0000
    SpriteRenderer* m_spriteRenderer; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float m_targetValue; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    float m_flickTime; // 0x002C
    uint8_t pad_002D[0x3]; // 0x002D
    Coroutine* bawk; // 0x0030

    // Methods
    void Awake();  // RVA: 0x8091A0
    void dtu();  // RVA: 0x8092E0
    void dtv();  // RVA: 0x809380
    IEnumerator* dtw();  // RVA: 0x8093D0
    void dtx(float a);  // RVA: 0x809440
    void .ctor();  // RVA: 0x628740
    static void .cctor();  // RVA: 0x809270
};

// Namespace: <global>
class h : public MonoBehaviour
{
public:

    // Methods
    void lk();  // RVA: 0x63E5A0
    void Update();  // RVA: 0x63E5A0
    void Start();  // RVA: 0x63E5A0
    void .ctor();  // RVA: 0x628740
};

// Namespace: <global>
class k : public b
{
public:

    // Methods
    void Update();  // RVA: 0x81B430
    void dtl(EUNITSTATE a);  // RVA: 0x81B500
    void .ctor();  // RVA: 0x628740
};

// Namespace: <global>
class m : public MonoBehaviour
{
public:

    // Methods
    void dqt();  // RVA: 0x63E5A0
    void .ctor();  // RVA: 0x628740
    void Start();  // RVA: 0x63E5A0
    void dee();  // RVA: 0x63E5A0
    void edv();  // RVA: 0x63E5A0
    void Update();  // RVA: 0x63E5A0
};

// Namespace: <global>
class HpBar : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    RectTransform* rect_m; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Slider* slider; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Image* image_Fillarea; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Unit* unit_Attach; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Vector3 monsterOffset; // 0x0040
    uint8_t pad_0041[0xB]; // 0x0041
    Vector3 heroOffset; // 0x004C
    uint8_t pad_004D[0xB]; // 0x004D
    Color color_Monster; // 0x0058
    uint8_t pad_0059[0xF]; // 0x0059
    Color color_Hero; // 0x0068

    // Methods
    void dty(Unit* a);  // RVA: 0x80A9E0
    void Update();  // RVA: 0x80A8E0
    void dtz();  // RVA: 0x80AB10
    void dua(float a);  // RVA: 0x80AC40
    void dub();  // RVA: 0x80AC90
    void .ctor();  // RVA: 0x80A930
};

// Namespace: <global>
class n : public b
{
public:

    // Methods
    void dtl(EUNITSTATE a);  // RVA: 0x81B6C0
    void .ctor();  // RVA: 0x628740
};

// Namespace: <global>
struct EUNITSTATE
{
public:
    // Static fields
    // static EUNITSTATE NONE;
    // static EUNITSTATE IDLE;
    // static EUNITSTATE MOVE;
    // static EUNITSTATE RETURN_TO_POSITION;
    // static EUNITSTATE ATTACK;
    // static EUNITSTATE REVIVE;
    // static EUNITSTATE DIE;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
struct EATTACKSTATE
{
public:
    // Static fields
    // static EATTACKSTATE PREDELAY;
    // static EATTACKSTATE ACTIONTIME;
    // static EATTACKSTATE POSTDELAY;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
struct TextDisplayPosition
{
public:
    // Static fields
    // static TextDisplayPosition Center;
    // static TextDisplayPosition Top;
    // static TextDisplayPosition Bottom;
    // static TextDisplayPosition TopOffset;
    // static TextDisplayPosition CenterUp;
    // static TextDisplayPosition CenterDown;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
class o
{
public:
    // Static fields
    // static intptr_t bawl;
    // static int32_t bawm;
    // static int32_t bawn;


    // Methods
    static void lga(Il2CppString* a, bool b);  // RVA: 0x81C390
    void .ctor();  // RVA: 0x628390
    static void duc(Il2CppString* a, bool b);  // RVA: 0x81BFD0
    static int32_t RegOpenKeyEx(intptr_t hKey, Il2CppString* lpSubKey, int32_t ulOptions, int32_t samDesired, intptr_t phkResult);  // RVA: 0x81B9F0
    static int32_t RegSetValueEx(intptr_t hKey, Il2CppString* lpValueName, int32_t Reserved, int32_t dwType, Il2CppString* lpData, int32_t cbData);  // RVA: 0x81BAC0
    static int32_t RegDeleteValue(intptr_t hKey, Il2CppString* lpValueName);  // RVA: 0x81B950
    static int32_t RegCloseKey(intptr_t hKey);  // RVA: 0x81B8D0
    static void .cctor();  // RVA: 0x81BBB0
    static uint32_t GetModuleFileName(intptr_t hModule, StringBuilder* lpFilename, int32_t nSize);  // RVA: 0x81B800
    static void djj(Il2CppString* a, bool b);  // RVA: 0x81BC10
    static void mqj(Il2CppString* a, bool b);  // RVA: 0x81C750
};

// Namespace: <global>
class MonitorEnumDelegate : public MulticastDelegate
{
public:

    // Methods
    void .ctor(Il2CppObject* object, intptr_t method);  // RVA: 0x80B6C0
    bool Invoke(intptr_t hMonitor, intptr_t hdcMonitor, intptr_t lprcMonitor, intptr_t dwData);  // RVA: 0x80B6A0
    IAsyncResult* BeginInvoke(intptr_t hMonitor, intptr_t hdcMonitor, intptr_t lprcMonitor, intptr_t dwData, AsyncCallback* callback, Il2CppObject* object);  // RVA: 0x80B5C0
    bool EndInvoke(IAsyncResult* result);  // RVA: 0x80B670
};

// Namespace: <global>
class p : public MonoBehaviour
{
public:
    // Static fields
    // static uint32_t bawo;
    // static int32_t bawp;
    // static int32_t bawq;
    // static RECT bawr;


    // Methods
    void cpo(bool hasFocus);  // RVA: 0x81CD80
    static bool due(intptr_t a, intptr_t b, intptr_t c, intptr_t d);  // RVA: 0x81D150
    static bool GetWindowRect(intptr_t hwnd, RECT rect);  // RVA: 0x81CC60
    static bool GetMonitorInfo(intptr_t hMonitor, MONITORINFO lpmi);  // RVA: 0x81CBD0
    void kqt();  // RVA: 0x81D610
    void uj();  // RVA: 0x81D8C0
    static intptr_t MonitorFromWindow(intptr_t hwnd, uint32_t dwFlags);  // RVA: 0x81CCF0
    void .ctor();  // RVA: 0x628740
    void fvs(bool hasFocus);  // RVA: 0x81CD80
    void dud();  // RVA: 0x81CF70
    void dut(bool hasFocus);  // RVA: 0x81CD80
    void duf();  // RVA: 0x81D360
    void iig();  // RVA: 0x81D430
    void loc();  // RVA: 0x81D6E0
    void dgl(bool hasFocus);  // RVA: 0x81CD80
    void bpv();  // RVA: 0x81CD90
    void OnApplicationFocus(bool hasFocus);  // RVA: 0x81CD80
    static bool EnumDisplayMonitors(intptr_t hdc, intptr_t lprcClip, MonitorEnumDelegate* lpfnEnum, intptr_t dwData);  // RVA: 0x81CB10
};

// Namespace: <global>
class BoxEffectController : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    System.Collections.Generic.List<SpriteAnimation_Image> animationLists; // 0x0020

    // Methods
    void dug(int32_t a);  // RVA: 0x808700
    bool duh();  // RVA: 0x808900
    void OnDisable();  // RVA: 0x808610
    void .ctor();  // RVA: 0x628740
};

// Namespace: <global>
class q : public MonoBehaviour
{
public:

    // Methods
    void OnPointerDown(PointerEventData* eventData);  // RVA: 0x63E5A0
    void OnPointerUp(PointerEventData* eventData);  // RVA: 0x63E5A0
    void .ctor();  // RVA: 0x628740
};

// Namespace: <global>
class ItemSlotDirectMovePreview : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    RectTransform* RectTransform; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Image* m_hoverTargetImage; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Sprite* m_moveToTradingStashIcon; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Sprite* m_moveToCubeIcon; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Sprite* m_moveToInventoryIcon; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    Sprite* m_moveToStashIcon; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Sprite* m_moveToGearIcon; // 0x0050

    // Methods
    void dui(ESlotType a, ESlotType b);  // RVA: 0x80ACB0
    void .ctor();  // RVA: 0x628740
};

// Namespace: <global>
struct <DelayedAnimation>d__7
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    SelectHeroEffectController* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x8103B0
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x8103A0
};

// Namespace: <global>
class SelectHeroEffectController : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    SpriteAnimation_Image* spriteAnimationImage; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    SpriteAnimation_Image[][] effectObjects; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    int32_t targetFrame; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float delay; // 0x0034

    // Methods
    void Awake();  // RVA: 0x80B850
    void OnDestroy();  // RVA: 0x80B950
    void duj(int32_t a);  // RVA: 0x80BA90
    UniTaskVoid duk();  // RVA: 0x80BB50
    void dul();  // RVA: 0x80BBE0
    void .ctor();  // RVA: 0x628740
};

// Namespace: <global>
struct <DelayedAnimation>d__9
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    SelectHeroShakeFlashController* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x810610
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x8103A0
};

// Namespace: <global>
class SelectHeroShakeFlashController : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    SpriteAnimation_Image* spriteAnimationImage; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    int32_t targetFrame; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    SelectHeroOption* selectHeroOption; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    bool hasFlash; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Il2CppString* otherAnimKey; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    bool hasShake; // 0x0048
    uint8_t pad_0049[0x3]; // 0x0049
    float delay; // 0x004C

    // Methods
    void Awake();  // RVA: 0x80BE20
    void OnDestroy();  // RVA: 0x80BF20
    UniTaskVoid dum();  // RVA: 0x80C1C0
    void Play(int32_t frame);  // RVA: 0x80C060
    void Play();  // RVA: 0x80C120
    void .ctor();  // RVA: 0x628740
};

// Namespace: <global>
class r
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    SkillPointAnimationController* baws; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    RectTransform* bawt; // 0x0018

    // Methods
    void lr();  // RVA: 0x81D990
    void dun();  // RVA: 0x81D990
    void .ctor();  // RVA: 0x628390
};

// Namespace: <global>
class SkillPointAnimationController : public MonoBehaviour
{
public:
    // Static fields
    // static Color bawu;
    // static Color bawv;

    uint8_t pad_0000[0x20]; // 0x0000
    Image* m_sliderBarCover; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    GameObject* prefab; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Transform* poolHolder; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Transform[][] m_iconTargetPos; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    float m_animDurationTime; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    System.Collections.Generic.Queue<UnityEngine.RectTransform> baww; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    System.Collections.Generic.List<UnityEngine.RectTransform> bawx; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    Tweener* bawy; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    ActiveSkillSlotDetail* bawz; // 0x0060

    // Methods
    void Awake();  // RVA: 0x80C250
    void duo();  // RVA: 0x80C600
    void dup();  // RVA: 0x80C6F0
    void duq(bool a);  // RVA: 0x80C910
    void dur();  // RVA: 0x80CB70
    void dus();  // RVA: 0x80CCB0
    void dut(Color a);  // RVA: 0x80CDF0
    void duu(int32_t a, int32_t b);  // RVA: 0x80CED0
    RectTransform* duv();  // RVA: 0x80D400
    void duw(RectTransform* a);  // RVA: 0x80D540
    void OnDisable();  // RVA: 0x80C380
    void .ctor();  // RVA: 0x80C530
    static void .cctor();  // RVA: 0x80C4D0
};

// Namespace: <global>
class ActSlot : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    int32_t act; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* text_ActName; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Button* btn; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    ToggleButton* button_toggle; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    float m_selectedCorrectionY; // 0x0040
    uint8_t pad_0041[0x3]; // 0x0041
    float m_unSelectedCorrectionY; // 0x0044
    uint8_t pad_0045[0x3]; // 0x0045
    Color m_selectedColor; // 0x0048
    uint8_t pad_0049[0xF]; // 0x0049
    Color m_unSelectedColor; // 0x0058
    uint8_t pad_0059[0xF]; // 0x0059
    System.Action<System.Int32> baxa; // 0x0068

    // Methods
    void dux(int32_t a, System.Action<System.Int32> b);  // RVA: 0x805A30
    void duy();  // RVA: 0x805B90
    void duz(bool a);  // RVA: 0x805C70
    void dva();  // RVA: 0x805D50
    void .ctor();  // RVA: 0x628740
};

// Namespace: <global>
class u : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    System.Collections.Generic.List<TaskbarHero.UI.AttributeSlot> attributeSlots; // 0x0020

    // Methods
    void .ctor();  // RVA: 0x81DA40
};

// Namespace: <global>
class LogSlot : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    RectTransform* rt; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* Text_LogText; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Animator* animator; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    caq* feedback1; // 0x0038

    // Methods
    void dvb(Il2CppString* a, Vector2 b, GradeSO* c);  // RVA: 0x80B3F0
    void offObject();  // RVA: 0x63E5A0
    void dvc();  // RVA: 0x80B560
    void .ctor();  // RVA: 0x628740
};

// Namespace: <global>
class ba : public MonoBehaviour
{
public:

    // Methods
    void hkn();  // RVA: 0x63E5A0
    void Start();  // RVA: 0x63E5A0
    void .ctor();  // RVA: 0x628740
    void Update();  // RVA: 0x63E5A0
};

// Namespace: <global>
class bb
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t baxb; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* baxc; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BlinkAnimation* baxd; // 0x0020

    // Methods
    void .ctor(int32_t a);  // RVA: 0x6856C0
    void dvd();  // RVA: 0x63E5A0
    bool MoveNext();  // RVA: 0x814030
    Il2CppObject* dve();  // RVA: 0x69B000
    void dvf();  // RVA: 0x814250
    Il2CppObject* dvg();  // RVA: 0x69B000
};

// Namespace: <global>
class bc
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t baxe; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* baxf; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BlinkAnimation* baxg; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float baxh; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    float baxi; // 0x002C
    uint8_t pad_002D[0x3]; // 0x002D
    float baxj; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float baxk; // 0x0034

    // Methods
    void .ctor(int32_t a);  // RVA: 0x6856C0
    void dvh();  // RVA: 0x63E5A0
    bool MoveNext();  // RVA: 0x814290
    Il2CppObject* dvi();  // RVA: 0x69B000
    void dvj();  // RVA: 0x8143D0
    Il2CppObject* dvk();  // RVA: 0x69B000
};

// Namespace: <global>
class bd
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t baxl; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* baxm; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BlinkAnimation* baxn; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float baxo; // 0x0028

    // Methods
    void .ctor(int32_t a);  // RVA: 0x6856C0
    void dvl();  // RVA: 0x63E5A0
    bool MoveNext();  // RVA: 0x814410
    Il2CppObject* dvm();  // RVA: 0x69B000
    void dvn();  // RVA: 0x814520
    Il2CppObject* dvo();  // RVA: 0x69B000
};

// Namespace: <global>
class BlinkAnimation : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    float blinkSpeed; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    float minAlpha; // 0x0024
    uint8_t pad_0025[0x3]; // 0x0025
    float maxAlpha; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    bool smoothBlink; // 0x002C
    bool playOnStart; // 0x002D
    bool loop; // 0x002E
    bool unscaledTime; // 0x002F
    SpriteRenderer* baxp; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Image* baxq; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    CanvasGroup* baxr; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    TextMesh* baxs; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    MeshRenderer* baxt; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    TextMeshProUGUI* baxu; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    TextMeshPro* baxv; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    bool baxw; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    Coroutine* baxx; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    float baxy; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    Action* OnBlinkStart; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    Action* OnBlinkEnd; // 0x0088
    uint8_t pad_0089[0x7]; // 0x0089
    Action* OnBlinkCycle; // 0x0090

    // Methods
    bool dvp();  // RVA: 0x805E30
    float dvq();  // RVA: 0x805E40
    void dvr(float a);  // RVA: 0x805E50
    float dvs();  // RVA: 0x805E70
    float dvt();  // RVA: 0x805E80
    void Awake();  // RVA: 0x805D70
    void Start();  // RVA: 0x805E00
    void OnValidate();  // RVA: 0x805D90
    void dvu();  // RVA: 0x805E90
    void dvv();  // RVA: 0x806160
    void dvw();  // RVA: 0x8063D0
    void dvx();  // RVA: 0x806480
    void dvy();  // RVA: 0x8064D0
    void dvz();  // RVA: 0x8065C0
    void dwa(float a);  // RVA: 0x8065D0
    float dwb();  // RVA: 0x8069E0
    void dwc(float a, float b, float c, bool d);  // RVA: 0x806C50
    IEnumerator* dwd();  // RVA: 0x806DC0
    IEnumerator* dwe(float a);  // RVA: 0x806E30
    IEnumerator* dwf(float a);  // RVA: 0x806EB0
    void dwg();  // RVA: 0x806F30
    void .ctor();  // RVA: 0x805E10
};

// Namespace: <global>
struct SpriteAnimClip
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Il2CppString* ClipName; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Sprite[][] Sprites; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bool Loop; // 0x0020
};

// Namespace: <global>
class be
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t baxz; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* baya; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    SpriteAnimation_Image* bayb; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float bayc; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    int32_t bayd; // 0x002C

    // Methods
    void .ctor(int32_t a);  // RVA: 0x6856C0
    void dwh();  // RVA: 0x63E5A0
    bool MoveNext();  // RVA: 0x814560
    Il2CppObject* dwi();  // RVA: 0x69B000
    void dwj();  // RVA: 0x8147A0
    Il2CppObject* dwk();  // RVA: 0x69B000
};

// Namespace: <global>
class SpriteAnimation_Image : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Image* image; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    System.Collections.Generic.List<UnityEngine.Sprite> sprites; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float duration; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float speed; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    bool playOnStart; // 0x0038
    bool PlayOnEnable; // 0x0039
    bool loop; // 0x003A
    bool unscaledTime; // 0x003B
    bool m_deactivateOnComplete; // 0x003C
    uint8_t pad_003D[0x3]; // 0x003D
    Coroutine* baye; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    bool bayf; // 0x0048
    uint8_t pad_0049[0x3]; // 0x0049
    int32_t bayg; // 0x004C
    uint8_t pad_004D[0x3]; // 0x004D
    Action* OnAnimationStart; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    Action* OnAnimationComplete; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    System.Action<System.Int32> OnFrameChanged; // 0x0060

    // Methods
    Image* dwl();  // RVA: 0x63AEB0
    System.Collections.Generic.List<UnityEngine.Sprite> dwm();  // RVA: 0x68B5E0
    float dwn();  // RVA: 0x80D860
    float dwo();  // RVA: 0x80D870
    bool dwp();  // RVA: 0x80D880
    bool dwq();  // RVA: 0x80D890
    int32_t dwr();  // RVA: 0x80D8A0
    int32_t dws();  // RVA: 0x80D8B0
    float dwt();  // RVA: 0x80D8F0
    void Start();  // RVA: 0x80D770
    void OnEnable();  // RVA: 0x80D660
    void OnValidate();  // RVA: 0x80D6C0
    void dwu();  // RVA: 0x80D940
    void dwv();  // RVA: 0x80DB20
    void dww();  // RVA: 0x80DB70
    void dwx(int32_t a);  // RVA: 0x80DC00
    void dwy();  // RVA: 0x80DD00
    void dwz();  // RVA: 0x80DD50
    IEnumerator* dxa();  // RVA: 0x80DDB0
    void dxb(float a, float b, bool c);  // RVA: 0x80DE20
    void dxc(System.Collections.Generic.List<UnityEngine.Sprite> a);  // RVA: 0x80DEC0
    void dxd(Sprite* a);  // RVA: 0x80E040
    void dxe(int32_t a);  // RVA: 0x80E0D0
    void dxf();  // RVA: 0x80E160
    void dxg();  // RVA: 0x63E5A0
    void .ctor();  // RVA: 0x80D7D0
};

// Namespace: <global>
class bf
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bayh; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* bayi; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    SpriteAnimation_SpriteRenderer* bayj; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float bayk; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    int32_t bayl; // 0x002C

    // Methods
    void .ctor(int32_t a);  // RVA: 0x6856C0
    void dxh();  // RVA: 0x63E5A0
    bool MoveNext();  // RVA: 0x8147E0
    Il2CppObject* dxi();  // RVA: 0x69B000
    void dxj();  // RVA: 0x814CC0
    Il2CppObject* dxk();  // RVA: 0x69B000
};

// Namespace: <global>
class SpriteAnimation_SpriteRenderer : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    SpriteRenderer* spriteRenderer; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    System.Collections.Generic.List<UnityEngine.Sprite> sprites; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float duration; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float delay; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    bool playOnStart; // 0x0038
    bool PlayOnEnable; // 0x0039
    bool DisableObjectWhenPlayEnd; // 0x003A
    bool m_disableRendererWhenPlayEnd; // 0x003B
    bool loop; // 0x003C
    bool unscaledTime; // 0x003D
    bool randomZRotation; // 0x003E
    uint8_t pad_003F[0x1]; // 0x003F
    Coroutine* baym; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    bool bayn; // 0x0048
    uint8_t pad_0049[0x3]; // 0x0049
    int32_t bayo; // 0x004C
    uint8_t pad_004D[0x3]; // 0x004D
    Color bayp; // 0x0050
    uint8_t pad_0051[0xF]; // 0x0051
    bool bayq; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    WaitForSeconds* bayr; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    WaitForSecondsRealtime* bays; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    float bayt; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    Action* OnAnimationStart; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    Action* OnAnimationComplete; // 0x0088
    uint8_t pad_0089[0x7]; // 0x0089
    System.Action<System.Int32> OnFrameChanged; // 0x0090
    uint8_t pad_0091[0x7]; // 0x0091
    Action* OnDelayStart; // 0x0098
    uint8_t pad_0099[0x7]; // 0x0099
    Action* OnDelayComplete; // 0x00A0

    // Methods
    SpriteRenderer* dxl();  // RVA: 0x63AEB0
    System.Collections.Generic.List<UnityEngine.Sprite> dxm();  // RVA: 0x68B5E0
    float dxn();  // RVA: 0x80D860
    float dxo();  // RVA: 0x80D870
    bool dxp();  // RVA: 0x80E4D0
    bool dxq();  // RVA: 0x80D890
    int32_t dxr();  // RVA: 0x80D8A0
    int32_t dxs();  // RVA: 0x80E4E0
    float dxt();  // RVA: 0x80E520
    void Start();  // RVA: 0x80E3B0
    void OnEnable();  // RVA: 0x80E290
    void OnDisable();  // RVA: 0x80E1F0
    void dxu();  // RVA: 0x80E570
    void dxv();  // RVA: 0x80E600
    void OnValidate();  // RVA: 0x80E300
    void dxw();  // RVA: 0x80E700
    void dxx();  // RVA: 0x80E800
    void dxy();  // RVA: 0x80E8B0
    void dxz(int32_t a);  // RVA: 0x80E920
    void dya();  // RVA: 0x80EA20
    void dyb();  // RVA: 0x80EA70
    WaitForSeconds* dyc(float a);  // RVA: 0x80EAD0
    WaitForSecondsRealtime* dyd(float a);  // RVA: 0x80EBA0
    IEnumerator* dye();  // RVA: 0x80EC70
    void dyf(float a, float b, bool c);  // RVA: 0x80ECE0
    void dyg(System.Collections.Generic.List<UnityEngine.Sprite> a);  // RVA: 0x80ED60
    void dyh(Sprite* a);  // RVA: 0x80EEB0
    void dyi(int32_t a);  // RVA: 0x80EF40
    void dyj();  // RVA: 0x80EFD0
    void dyk();  // RVA: 0x63E5A0
    void .ctor();  // RVA: 0x80E440
};

// Namespace: <global>
class <>c
{
public:
    // Static fields
    // static <>c* <>9;
    // static UnityAction* <>9__15_0;


    // Methods
    static void .cctor();  // RVA: 0x810C20
    void .ctor();  // RVA: 0x628390
    void dyl();  // RVA: 0x810C90
};

// Namespace: <global>
class BottomStageQuickMenu : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    bool bayu; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    RectTransform* m_quickMenu; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    ScreenBoundsCorrector* m_screenBoundsCorrector; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    float m_bottomOnTopPos; // 0x0038
    uint8_t pad_0039[0x3]; // 0x0039
    float m_bottomOnBottomPos; // 0x003C
    uint8_t pad_003D[0x3]; // 0x003D
    oi* m_quickMenuHoverCheck; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    Button* m_nonPresetButton; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Button* m_pinBattleScreenButton; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    TextMeshProUGUI* m_pinBattleScreenText; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    Button* m_muteButton; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    TextMeshProUGUI* m_muteText; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    Button* m_alwaysOnTopButton; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    TextMeshProUGUI* m_alwaysOnTopText; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    System.Collections.Generic.List<TaskbarHero.UI.LayoutPresetButton> m_layoutPresetButtons; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    bool bayv; // 0x0088

    // Methods
    void dym();  // RVA: 0x8075F0
    void dyn(bool a);  // RVA: 0x808270
    void dyo(bool a);  // RVA: 0x8082F0
    void dyp(bool a);  // RVA: 0x8083D0
    void dyq(ESoundType a, float b);  // RVA: 0x8084B0
    void Update();  // RVA: 0x807590
    void OnDisable();  // RVA: 0x628730
    void OnPointerClick(PointerEventData* eventData);  // RVA: 0x8073C0
    void OnPointerEnter(PointerEventData* eventData);  // RVA: 0x807580
    void OnPointerExit(PointerEventData* eventData);  // RVA: 0x628730
    void .ctor();  // RVA: 0x628740
    void dyr();  // RVA: 0x8085E0
};

// Namespace: <global>
class StageTooltip : public MonoBehaviour
{
public:
    // Static fields
    // static int32_t bayw;
    // static int32_t bayx;

    uint8_t pad_0000[0x20]; // 0x0000
    TextMeshProUGUI* m_titleText; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* m_stageTypeText; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    TextMeshProUGUI* m_stageLevelText; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Image* m_BG; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Sprite[][] m_bgSprites; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    GameObject* m_soulStoneBG; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Image* m_soulStoneIcon; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    TextMeshProUGUI* m_soulStoneAmountText; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    SpriteAnimation_Image* m_bluePortalAnim; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    SpriteAnimation_Image* m_redPortalAnim; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    GameObject* m_lockIcon; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    GameObject* m_bottomText; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    TextMeshProUGUI* m_bottomTextLabel; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    GameObject* m_mouseIcon; // 0x0088
    uint8_t pad_0089[0x7]; // 0x0089
    TextMeshProUGUI* m_enterText; // 0x0090
    uint8_t pad_0091[0x7]; // 0x0091
    Color m_normalColor; // 0x0098
    uint8_t pad_0099[0xF]; // 0x0099
    Color m_actBossColor; // 0x00A8

    // Methods
    void Show(StageCache* cache);  // RVA: 0x80F040
    void Hide();  // RVA: 0x747870
    void dys();  // RVA: 0x80F500
    void dyt(StageCache* a, int32_t b);  // RVA: 0x80F660
    void dyu(bool a, bool b);  // RVA: 0x80F910
    void dyv(SpriteAnimation_Image* a, SpriteAnimation_Image* b, bool c);  // RVA: 0x80F940
    void dyw(StageCache* a, bool b, bool c, bool d, int32_t e);  // RVA: 0x80FA60
    void dyx(bool a, Il2CppString* b, Color c);  // RVA: 0x80FDA0
    void .ctor();  // RVA: 0x628740
};

// Namespace: <global>
class OfflineHeroSlot
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    GameObject* slotObject; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    TextMeshProUGUI* nameText; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    TextMeshProUGUI* levelText; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* expText; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Image* baseExp; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Image* addedExp; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    GameObject* levelUpFX; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    System.Collections.Generic.List<UnityEngine.GameObject> heroList; // 0x0048

    // Methods
    void .ctor();  // RVA: 0x80B770
};

// Namespace: <global>
struct <ShowLevelUpFX>d__21
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    UI_OfflineReward* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    System.Collections.Generic.List<UI_OfflineReward.OfflineHeroSlot> list; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Awaiter <>u__1; // 0x0030

    // Methods
    void MoveNext();  // RVA: 0x810870
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x8103A0
};

// Namespace: <global>
class UI_OfflineReward : public MonoBehaviour
{
public:
    // Static fields
    // static float bayy;
    // static float bayz;
    // static EEquipClassType[][] baza;

    uint8_t pad_0000[0x20]; // 0x0000
    TextMeshProUGUI* m_lastLoginText; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* m_offlineTimeText; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Slider* m_timeSlider; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    TextMeshProUGUI* m_goldText; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    GameObject* m_blockBG; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    OfflineHeroSlot[][] heroSlots; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    CanvasGroup* m_parentCanvasGroup; // 0x0050

    // Methods
    void dyy(OfflineRewardResult a);  // RVA: 0x8128B0
    void dyz(bool a);  // RVA: 0x812B90
    void dza(OfflineRewardResult a);  // RVA: 0x812BB0
    void dzb(OfflineRewardResult a);  // RVA: 0x812E30
    void dzc(OfflineRewardResult a);  // RVA: 0x812EF0
    void dzd(OfflineHeroSlot* a, OfflineRewardHeroResult b);  // RVA: 0x813270
    void dze(OfflineHeroSlot* a, HeroInfoData* b);  // RVA: 0x813790
    int32_t dzf(HeroInfoData* a);  // RVA: 0x813950
    HeroInfoData* dzg(int32_t a);  // RVA: 0x813A30
    float dzh(float a, float b);  // RVA: 0x813B20
    UniTaskVoid dzi(System.Collections.Generic.List<UI_OfflineReward.OfflineHeroSlot> a);  // RVA: 0x813B50
    void OnDisable();  // RVA: 0x812670
    void .ctor();  // RVA: 0x628740
    static void .cctor();  // RVA: 0x812820
    bool dzj();  // RVA: 0x813C00
};

// Namespace: <global>
struct EStatusUIState
{
public:
    // Static fields
    // static EStatusUIState Default;
    // static EStatusUIState StatDetail;
    // static EStatusUIState AttributeDetail;
    // static EStatusUIState SkillEquip;
    // static EStatusUIState SkillSlot;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
struct EWorldUILocation
{
public:
    // Static fields
    // static EWorldUILocation Left;
    // static EWorldUILocation Center;
    // static EWorldUILocation Right;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
class UI_Main : public MonoBehaviour
{
public:
    // Static fields
    // static float bazc;
    // static float bazd;
    // static float baze;
    // static float bazf;

    uint8_t pad_0000[0x20]; // 0x0000
    UIManager* bazb; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    UiStateMachineBehaviour* _usm; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    RectTransform* panel_left; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    RectTransform* panel_right; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    RectTransform* panel_center; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    xr* button_Stash; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    xr* button_Stat; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    xr* button_Cube; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    xr* button_Rune; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    xr* button_Portal; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    System.Collections.Generic.List<xr> ContentButtons; // 0x0070

    // Methods
    void Awake();  // RVA: 0x811560
    void dzk();  // RVA: 0x811930
    void Start();  // RVA: 0x811800
    void OnEnable();  // RVA: 0x811800
    void dzl();  // RVA: 0x811A40
    EWorldUILocation dzm(float a);  // RVA: 0x811CB0
    bool dzn();  // RVA: 0x811CD0
    bool dzo();  // RVA: 0x811D50
    void dzp();  // RVA: 0x811DD0
    void dzq(float a);  // RVA: 0x811E10
    void dzr(float a);  // RVA: 0x811EC0
    void dzs(float a);  // RVA: 0x811F70
    void dzt();  // RVA: 0x812020
    void dzu();  // RVA: 0x812020
    void dzv();  // RVA: 0x812180
    void dzw();  // RVA: 0x812260
    void dzx();  // RVA: 0x812270
    void dzy();  // RVA: 0x8124C0
    void dzz();  // RVA: 0x812640
    void eaa();  // RVA: 0x812640
    void .ctor();  // RVA: 0x8118B0
};

// Namespace: <global>
class bg : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Vector2 bazg; // 0x0020

    // Methods
    void jnx(Vector2 a);  // RVA: 0x814D00
    void eab(Vector2 a);  // RVA: 0x814D00
    void ead(float a);  // RVA: 0x814D10
    void .ctor();  // RVA: 0x628740
    void eac(Vector2 a);  // RVA: 0x814D10
    void cug(Vector2 a);  // RVA: 0x814D00
    void eyu(Vector2 a);  // RVA: 0x814D00
    void hsb(Vector2 a);  // RVA: 0x814D00
    void fca(float a);  // RVA: 0x814D10
    void xp(float a);  // RVA: 0x814D10
};

// Namespace: <global>
struct <UpdateCoolTimeAsync>d__11
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bh* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x811120
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x8103A0
};

// Namespace: <global>
class bh
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    float bazh; // 0x0010
    uint8_t pad_0011[0x3]; // 0x0011
    int32_t bazi; // 0x0014
    uint8_t pad_0015[0x3]; // 0x0015
    System.Action<System.Int32> bazj; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    CancellationTokenSource* bazk; // 0x0020

    // Methods
    void eah();  // RVA: 0x814E70
    void nfv();  // RVA: 0x815150
    void eag();  // RVA: 0x814D70
    void .ctor(int32_t a);  // RVA: 0x814D20
    bool eaf();  // RVA: 0x814D60
    void omf();  // RVA: 0x815250
    UniTaskVoid eai();  // RVA: 0x814EC0
    float eae();  // RVA: 0x814D50
    void hjs();  // RVA: 0x814F50
    void kef();  // RVA: 0x815050
    void hyc();  // RVA: 0x814E70
    void mqu();  // RVA: 0x814E70
};

// Namespace: <global>
class bi
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bazl; // 0x0010

    // Methods
    void .ctor();  // RVA: 0x628390
};

// Namespace: <global>
class bj
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bazm; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* bazn; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    DeadUnitData* bazo; // 0x0020

    // Methods
    void .ctor(int32_t a);  // RVA: 0x6856C0
    void eaj();  // RVA: 0x63E5A0
    bool MoveNext();  // RVA: 0x815350
    Il2CppObject* eak();  // RVA: 0x69B000
    void eal();  // RVA: 0x8154E0
    Il2CppObject* eam();  // RVA: 0x69B000
};

// Namespace: <global>
class DeadUnitData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    uf* cache; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    float currentResurrectionTime; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    System.Action<System.Single> OnProcessChange; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Coroutine* resurrectionCoroutine; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    int32_t bazp; // 0x0030

    // Methods
    int32_t ean();  // RVA: 0x808FD0
    void .ctor(uf* cache, int32_t dieOrder);  // RVA: 0x808E80
    void eao();  // RVA: 0x808FE0
    void eap();  // RVA: 0x8090B0
    IEnumerator* eaq();  // RVA: 0x809130
};

// Namespace: <global>
class ObstacleScriptableObject : public ScriptableObject
{
public:
    uint8_t pad_0000[0x18]; // 0x0000
    System.Collections.Generic.List<System.Single> ObstacleMoveSpeeds; // 0x0018

    // Methods
    void .ctor();  // RVA: 0x6CB480
};

// Namespace: <global>
class SkillSO : public ScriptableObject
{
public:
    uint8_t pad_0000[0x18]; // 0x0000
    SKILLTYPE skillTYPE; // 0x0018
    uint8_t pad_0019[0x3]; // 0x0019
    float preTime; // 0x001C
    uint8_t pad_001D[0x3]; // 0x001D
    float actionTime; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    float postTime; // 0x0024
    uint8_t pad_0025[0x3]; // 0x0025
    bool KeepActivateOnRecast; // 0x0028
    bool CanMultiCastSkill; // 0x0029
    uint8_t pad_002A[0x6]; // 0x002A
    PrefabAndOffSetEffect* SkillEf_StartEf_Me; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    PrefabAndOffSetEffect* SkillEf_Direct_Other; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    PrefabAndOffSetEffect* AreaOfEffect_Other_Hitted; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    PrefabAndOffSetProjecTile* SkillProjecTile; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    AreaOfEffectData AreaOfEffectObject; // 0x0050
    uint8_t pad_0051[0x17]; // 0x0051
    bco* WillSpawnTurret; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    bl* WillSpawnTrap; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    float WillSpawnTrapFixedY; // 0x0078
    uint8_t pad_0079[0x3]; // 0x0079
    float WillSpawnTrapSpeed; // 0x007C
    uint8_t pad_007D[0x3]; // 0x007D
    float WillSpawnTrapRandPosOffsetDividedRange; // 0x0080
    uint8_t pad_0081[0x3]; // 0x0081
    float WillSpawnTrapRandPosOffsetIncrementDividedRange; // 0x0084
    uint8_t pad_0085[0x3]; // 0x0085
    float WillSpawnTrapRandPosMaxOffsetDividedRange; // 0x0088
    uint8_t pad_0089[0x3]; // 0x0089
    float WillFinalOffsetXDividedRange_Move; // 0x008C
    uint8_t pad_008D[0x3]; // 0x008D
    float WillFinalOffsetXDividedRange_NotMove; // 0x0090
    uint8_t pad_0091[0x7]; // 0x0091
    SpawnSomethingData SpawnSomethingData; // 0x0098
    uint8_t pad_0099[0x17]; // 0x0099
    MonsterRandomSpawnData RandomMonsterSpawnData; // 0x00B0
    uint8_t pad_00B1[0x17]; // 0x00B1
    Sprite* SkillSprite; // 0x00C8
    uint8_t pad_00C9[0x7]; // 0x00C9
    AnimationClip* SkillClip1; // 0x00D0
    uint8_t pad_00D1[0x7]; // 0x00D1
    AnimationClip* SkillClip2; // 0x00D8
    uint8_t pad_00D9[0x7]; // 0x00D9
    AnimationClip* SkillClip3; // 0x00E0

    // Methods
    bool ear();  // RVA: 0x80D5F0
    bool eas();  // RVA: 0x80D600
    bool eat();  // RVA: 0x80D610
    bool eau();  // RVA: 0x80D620
    bool eav();  // RVA: 0x80D630
    bool eaw();  // RVA: 0x80D640
    bool eax();  // RVA: 0x80D650
    void .ctor();  // RVA: 0x80D5E0
};

// Namespace: <global>
struct SpawnSomethingData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    GameObject* SpawnPrefab; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector3 Offset; // 0x0018
};

// Namespace: <global>
struct MonsterRandomSpawnData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    System.Collections.Generic.List<System.Int32> RandomSpawnMonsterKey; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    int32_t SpawnCount; // 0x0018
    uint8_t pad_0019[0x3]; // 0x0019
    float RandomSpawnPosOffsetMin; // 0x001C
    uint8_t pad_001D[0x3]; // 0x001D
    float RandomSpawnPosOffsetMax; // 0x0020
};

// Namespace: <global>
struct AreaOfEffectData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    GameObject* Prefab; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector3 OffSet; // 0x0018
};

// Namespace: <global>
class PrefabAndOffSetEffect
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    GameObject* Go_Prefab; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector3 OffSet; // 0x0018

    // Methods
    void .ctor();  // RVA: 0x80B7F0
};

// Namespace: <global>
class PrefabAndOffSetProjecTile
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    bdb* Go_Prefab; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector3 OffSet; // 0x0018

    // Methods
    void .ctor();  // RVA: 0x80B7F0
};

// Namespace: <global>
class TrapExplosionData : public ScriptableObject
{
public:
    uint8_t pad_0000[0x18]; // 0x0000
    EDamageAttribute ReactDamageType; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bbi* AreaOfEffect; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Il2CppString* ExplosionTriggerName; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float DividedExplosionDelayTime; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    int32_t DamageIncreaseValue; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    StatusEffectType StatusEffectType; // 0x0038
    uint8_t pad_0039[0x3]; // 0x0039
    float StatusEffectChance; // 0x003C

    // Methods
    void .ctor();  // RVA: 0x6CB480
};

// Namespace: <global>
struct <ActivatingExplosion>d__31
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bk* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TrapExplosionData* data; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Awaiter <>u__1; // 0x0030

    // Methods
    void MoveNext();  // RVA: 0x80FED0
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x8103A0
};

// Namespace: <global>
class bk : public bl
{
public:
    uint8_t pad_0000[0x48]; // 0x0000
    TrapExplosionData[][] ExplosionData; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Unit* bazq; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    System.Collections.Generic.Dictionary<TaskbarHero.Data.EDamageAttribute,TrapExplosionData> bazr; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    float bazs; // 0x0060
    uint8_t pad_0061[0x3]; // 0x0061
    EDamageAttribute bazt; // 0x0064
    uint8_t pad_0065[0x3]; // 0x0065
    EDamageType bazu; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    TrapExplosionData* bazv; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    bool bazw; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    CancellationTokenSource* bazx; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    Action* bazy; // 0x0088
    uint8_t pad_0089[0x7]; // 0x0089
    int32_t bazz; // 0x0090
    uint8_t pad_0091[0x3]; // 0x0091
    int32_t bbaa; // 0x0094
    uint8_t pad_0095[0x3]; // 0x0095
    int32_t bbab; // 0x0098

    // Methods
    Vector3 eay();  // RVA: 0x815750
    bool eaz();  // RVA: 0x67E0F0
    DamageableType eba();  // RVA: 0x8157A0
    void .ctor();  // RVA: 0x815520
    void cdy(float a);  // RVA: 0x815600
    void bky();  // RVA: 0x8155A0
    Vector3 ebp();  // RVA: 0x62EA40
    void gov();  // RVA: 0x8155A0
    void jta(EDamageAttribute a);  // RVA: 0x815FC0
    float ebn();  // RVA: 0x815EC0
    void ebi(DamageInfo a, bool b);  // RVA: 0x815A10
    void ebd(float a, Unit* b, EDamageType c, Action* d);  // RVA: 0x815650
    void ebk();  // RVA: 0x8155A0
    int32_t ebq();  // RVA: 0x815FB0
    Bounds ebo();  // RVA: 0x815EF0
    Unit* ebb();  // RVA: 0x66B2E0
    void ebj();  // RVA: 0x815BC0
    Transform* ebc();  // RVA: 0x8157B0
    void hlu(float a);  // RVA: 0x815600
    DamageInfo ebm();  // RVA: 0x815D00
    void dfr(float a, Unit* b, EDamageType c, Action* d);  // RVA: 0x815650
    void ikj(float a, Unit* b, EDamageType c, Action* d);  // RVA: 0x815650
    void mbs(int32_t a, int32_t b, int32_t c);  // RVA: 0x8157C0
    void ebh(Vector3 a, Vector3 b, float c, float d);  // RVA: 0x815890
    void czr(float a, Unit* b, EDamageType c, Action* d);  // RVA: 0x815650
    void duo(EDamageAttribute a);  // RVA: 0x8156A0
    void ebe(int32_t a, int32_t b, int32_t c);  // RVA: 0x8157C0
    UniTaskVoid ebl(TrapExplosionData* a);  // RVA: 0x815C50
    void cdd(float a);  // RVA: 0x815600
    void dkk();  // RVA: 0x8155A0
    void ebf(EDamageAttribute a);  // RVA: 0x8157E0
    void gms();  // RVA: 0x8155A0
    void ebg(float a);  // RVA: 0x815600
};

// Namespace: <global>
struct <UpdateTrapLifeTime>d__11
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bl* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x811320
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x8103A0
};

// Namespace: <global>
class bl : public bch
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Animator* TrapAnimator; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    bdg* TrapMover; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float LifeTime; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float TrapMoveSpeed; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    float TrapMoveHeight; // 0x0038
    uint8_t pad_0039[0x3]; // 0x0039
    bool bbac; // 0x003C
    uint8_t pad_003D[0x3]; // 0x003D
    CancellationTokenSource* bbad; // 0x0040

    // Methods
    void OnDisable();  // RVA: 0x816070
    void mcc();  // RVA: 0x816070
    void ort();  // RVA: 0x816070
    void imx();  // RVA: 0x8166A0
    void ebr();  // RVA: 0x816450
    void ebt();  // RVA: 0x816560
    UniTaskVoid ebs();  // RVA: 0x8164D0
    void .ctor();  // RVA: 0x816090
    void mnj();  // RVA: 0x816720
    void nqa();  // RVA: 0x8167A0
    void ebh(Vector3 a, Vector3 b, float c, float d);  // RVA: 0x8160A0
    void jtx();  // RVA: 0x816070
    void ebu();  // RVA: 0x8165E0
    void ebj();  // RVA: 0x816400
    void gtq();  // RVA: 0x816620
};

// Namespace: <global>
struct <UpdateAsync>d__15
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    LineController* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x810CC0
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x8103A0
};

// Namespace: <global>
class LineController : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    bool OnlyOneLoop; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    LineRenderer* LineRenderer; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Texture[][] lineTextures; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    float Fps; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    SpriteRenderer* m_headCap; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    SpriteRenderer* m_tailCap; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    float bbae; // 0x0050
    uint8_t pad_0051[0x3]; // 0x0051
    int32_t bbaf; // 0x0054
    uint8_t pad_0055[0x3]; // 0x0055
    bool bbag; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    Transform* bbah; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    Transform* bbai; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    Vector3 bbaj; // 0x0070
    uint8_t pad_0071[0xB]; // 0x0071
    Vector3 bbak; // 0x007C

    // Methods
    void ebv();  // RVA: 0x80AE00
    void ebw(Transform* a, Transform* b, Vector3 c, Vector3 d);  // RVA: 0x80AE60
    UniTaskVoid ebx();  // RVA: 0x80B110
    void eby(Vector3 a, Vector3 b);  // RVA: 0x80B190
    void .ctor();  // RVA: 0x628740
};

// Namespace: <global>
class bm : public bz
{
public:
    uint8_t pad_0000[0x38]; // 0x0000
    float FloorHalfSize; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    System.Collections.Generic.List<UnityEngine.GameObject> Presets; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    FollowCamera* FollowCamera; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    float ObstacleMoveSpeed; // 0x0050
    uint8_t pad_0051[0x3]; // 0x0051
    float TimeCorrectionValue; // 0x0054
    uint8_t pad_0055[0x3]; // 0x0055
    float bbal; // 0x0058
    uint8_t pad_0059[0x3]; // 0x0059
    int32_t bbam; // 0x005C
    uint8_t pad_005D[0x3]; // 0x005D
    System.Collections.Generic.List<bo> ChildLayers; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    int32_t bban; // 0x0068
    uint8_t pad_0069[0x3]; // 0x0069
    float bbao; // 0x006C
    uint8_t pad_006D[0x3]; // 0x006D
    Transform* bbap; // 0x0070

    // Methods
    void iod();  // RVA: 0x817D70
    void ecb(Transform* a);  // RVA: 0x8174F0
    void Hide();  // RVA: 0x816A10
    void End();  // RVA: 0x816820
    void eca();  // RVA: 0x817360
    void fwc();  // RVA: 0x8179F0
    void ym();  // RVA: 0x818D60
    void lwb(Transform* a);  // RVA: 0x818630
    void cfj();  // RVA: 0x816E10
    void Update();  // RVA: 0x816A70
    void ebz(Vector3 a, float b, int32_t c);  // RVA: 0x817000
    void ecc(Transform* a);  // RVA: 0x817770
    void nhz();  // RVA: 0x818A40
    void ivn();  // RVA: 0x818090
    void ny();  // RVA: 0x816A10
    void lbh();  // RVA: 0x816A10
    void Show();  // RVA: 0x816A40
    void hkq();  // RVA: 0x817B80
    void .ctor();  // RVA: 0x816D90
    void mum();  // RVA: 0x8188B0
    void jy(Transform* a);  // RVA: 0x8183B0
};

// Namespace: <global>
class bn : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Camera* bbaq; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    UI_Stage* bbar; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    bool OnHover; // 0x0030

    // Methods
    void nph();  // RVA: 0x819160
    void Update();  // RVA: 0x818F80
    void bqd();  // RVA: 0x818FB0
    void .ctor();  // RVA: 0x628740
    void bbo();  // RVA: 0x818F80
    void fcu();  // RVA: 0x8190D0
    void lyv();  // RVA: 0x818F80
    void Start();  // RVA: 0x818EF0
    void djv();  // RVA: 0x819040
};

// Namespace: <global>
class bo : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    System.Collections.Generic.List<SpriteAnimation_SpriteRenderer> SpriteAnimationList; // 0x0020

    // Methods
    void dih();  // RVA: 0x8191F0
    void ece();  // RVA: 0x819470
    void .ctor();  // RVA: 0x628740
    void ecd();  // RVA: 0x819330
    void kpa();  // RVA: 0x8197A0
    void gzi();  // RVA: 0x819690
    void gfg();  // RVA: 0x819580
};

// Namespace: <global>
class bp : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    System.Collections.Generic.List<UnityEngine.GameObject> BackGroundPresets; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    FollowCamera* FollowCamera; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float ObstacleMoveSpeed; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    System.Collections.Generic.List<SpriteAnimation_SpriteRenderer> SpriteAnimationList; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Vector3 bbas; // 0x0040

    // Methods
    void frq(Vector3 a);  // RVA: 0x81A640
    void hqt();  // RVA: 0x81ADE0
    void Update();  // RVA: 0x819A40
    void ha(Vector3 a);  // RVA: 0x81AA10
    void .ctor();  // RVA: 0x628740
    void ecf(Vector3 a);  // RVA: 0x819C70
    void Awake();  // RVA: 0x8198B0
    void emv(Vector3 a);  // RVA: 0x81A040
    void End();  // RVA: 0x8198F0
    void eoe();  // RVA: 0x81A410
};

// Namespace: <global>
class bq
{
public:
    // Static fields
    // static Il2CppString* bbat;
    // static Il2CppString* bbau;
    // static Il2CppString* bbav;
    // static Il2CppString* bbaw;
    // static Il2CppString* bbax;
    // static Il2CppString* bbay;
    // static Il2CppString* bbaz;


    // Methods
    static void .cctor();  // RVA: 0x81B010
};

// Namespace: <global>
class br
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Il2CppString* bbba; // 0x0010

    // Methods
    void .ctor();  // RVA: 0x628390
    bool ecg(Il2CppString* a);  // RVA: 0x81B1C0
    bool dco(Il2CppString* a);  // RVA: 0x81B1C0
    bool kwo(Il2CppString* a);  // RVA: 0x81B1C0
};

// Namespace: <global>
class CsvManager : public MonoBehaviour
{
public:
    // Static fields
    // static CsvManager* bbbb;

    uint8_t pad_0000[0x20]; // 0x0000
    Il2CppString* m_csvFolderPath; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    System.Collections.Generic.List<UnityEngine.TextAsset> m_csvTextAssets; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    System.Collections.Generic.Dictionary<System.String,UnityEngine.TextAsset> bbbc; // 0x0030

    // Methods
    static CsvManager* ech();  // RVA: 0x808B40
    void Awake();  // RVA: 0x8089E0
    void eci();  // RVA: 0x808B80
    System.Collections.Generic.List<a> ecj(Il2CppString* a);  // RVA: 0x4193D0
    TextAsset* eck(Il2CppString* a);  // RVA: 0x808D10
    String[][] ecl(Il2CppString* a);  // RVA: 0x808D70
    void .ctor();  // RVA: 0x808A40
};

// Namespace: <global>
class FollowCamera : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    StageManager* _stageController; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Unit[][] _targets; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Vector3 _battleModeOffset; // 0x0030
    uint8_t pad_0031[0xF]; // 0x0031
    RectTransform* m_stageUIRect; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    BoxCollider2D* m_collider2D; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Vector3 windowFrameOffset; // 0x0050
    uint8_t pad_0051[0xB]; // 0x0051
    Vector3 bbbd; // 0x005C
    uint8_t pad_005D[0xB]; // 0x005D
    float bbbe; // 0x0068
    uint8_t pad_0069[0x3]; // 0x0069
    float bbbf; // 0x006C
    uint8_t pad_006D[0x3]; // 0x006D
    float m_monsterTargetOffsetValue; // 0x0070
    uint8_t pad_0071[0x3]; // 0x0071
    float m_monsterFollowCameraCenterOffset; // 0x0074
    uint8_t pad_0075[0x3]; // 0x0075
    Vector3 m_windowFrameMonsterBattleFollowOffset; // 0x0078
    uint8_t pad_0079[0xB]; // 0x0079
    Vector3 m_windowFrameCorrectionOffset; // 0x0084
    uint8_t pad_0085[0xB]; // 0x0085
    float m_heroSpreadMaxDistance; // 0x0090
    uint8_t pad_0091[0x3]; // 0x0091
    float m_heroSpreadTargetOffsetX; // 0x0094
    uint8_t pad_0095[0x3]; // 0x0095
    float m_maxFollowDistance; // 0x0098
    uint8_t pad_0099[0x3]; // 0x0099
    float m_catchUpSpeedMultiplier; // 0x009C
    uint8_t pad_009D[0x3]; // 0x009D
    float bbbg; // 0x00A0
    uint8_t pad_00A1[0x7]; // 0x00A1
    TMP_InputField* m_debugCorrectionOffsetXInput; // 0x00A8
    uint8_t pad_00A9[0x7]; // 0x00A9
    TMP_InputField* m_debugCorrectionOffsetYInput; // 0x00B0
    uint8_t pad_00B1[0x7]; // 0x00B1
    TMP_InputField* m_debugCorrectionOffsetZInput; // 0x00B8

    // Methods
    Transform* ecm();  // RVA: 0x8095D0
    Vector3 ecn();  // RVA: 0x809600
    float eco();  // RVA: 0x809640
    void Start();  // RVA: 0x809510
    void ecp();  // RVA: 0x809650
    void ecq(Il2CppString* a);  // RVA: 0x809950
    void ecr(Il2CppString* a);  // RVA: 0x809990
    void ecs(Il2CppString* a);  // RVA: 0x8099D0
    void Update();  // RVA: 0x809520
    void ect();  // RVA: 0x809A10
    void ecu(float a);  // RVA: 0x809CE0
    void ecv(Unit[][] a);  // RVA: 0x809CF0
    Vector3 ecw();  // RVA: 0x809FB0
    Vector3 ecx();  // RVA: 0x80A0C0
    Vector3 ecy();  // RVA: 0x80A1D0
    void ecz(Vector3 a);  // RVA: 0x80A6D0
    void .ctor();  // RVA: 0x809530
};

// Namespace: <global>
class TestFollowScript : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Transform* m_stageUIRect; // 0x0020

    // Methods
    void Update();  // RVA: 0x822C80
    void .ctor();  // RVA: 0x628740
};

// Namespace: <global>
class AnimationEf : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    SpriteRenderer* spr; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    SpriteAnimation_SpriteRenderer* sprite_Animation; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    System.Collections.Generic.List<SpriteAnimation_SpriteRenderer> additionalAnimations; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Action* bbbh; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    bool EndDestroy; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    SpriteAnimation_SpriteRenderer* bbbi; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    SpriteRenderer* bbbj; // 0x0050

    // Methods
    void eda(Action* a);  // RVA: 0x81E340
    void Awake();  // RVA: 0x81DCD0
    void edb();  // RVA: 0x81E3E0
    void edc();  // RVA: 0x81E810
    void edd(int32_t a);  // RVA: 0x63E5A0
    void ede();  // RVA: 0x81E830
    void .ctor();  // RVA: 0x81E330
};

// Namespace: <global>
class bs`1 : public bw
{
public:
    // Static fields
    // static a bbbk;


    // Methods
    static a edf();  // RVA: 0x563BC0
