// ============================================================
// Image: Assembly-CSharp.dll
// ============================================================

// Namespace: <global>
class b : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Unit* OwnerUnit; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Animator* Animatior; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    EUNITSTATE bawd; // 0x0030

    // Methods
    void Awake();  // RVA: 0x7E48E0
    void max(float a);  // RVA: 0x7E49A0
    void dtn(Il2CppString* a);  // RVA: 0x7E49C0
    void jyq();  // RVA: 0x7E49E0
    void erb(Il2CppString* a);  // RVA: 0x7E49C0
    void nuo(Il2CppString* a);  // RVA: 0x7E49C0
    void dtl(EUNITSTATE a);  // RVA: 0x418140
    void Update();  // RVA: 0x630C10
    void ort(float a);  // RVA: 0x7E49A0
    void fki(float a);  // RVA: 0x7E49A0
    void dtm(float a);  // RVA: 0x7E49A0
    void dep(float a);  // RVA: 0x7E49A0
    void dxk(Il2CppString* a);  // RVA: 0x7E49C0
    void .ctor();  // RVA: 0x626760
};

// Namespace: <global>
class c : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Action* OnACTIVE; // 0x0020

    // Methods
    void .ctor();  // RVA: 0x626760
    void jrb(Action* a);  // RVA: 0x7EBAE0
    void dto(Action* a);  // RVA: 0x7EB980
    void nhj(Action* a);  // RVA: 0x7EBB80
    void drt(Action* a);  // RVA: 0x7EB8E0
    void dtp();  // RVA: 0x7EBA20
    void hep(Action* a);  // RVA: 0x7EBA40
};

// Namespace: <global>
class g
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bawe; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* bawf; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    FlickerController* bawg; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float bawh; // 0x0028

    // Methods
    void .ctor(int32_t a);  // RVA: 0x668880
    void dtq();  // RVA: 0x630C10
    bool MoveNext();  // RVA: 0x7EBC20
    Il2CppObject* dtr();  // RVA: 0x67B9A0
    void dts();  // RVA: 0x7EBD60
    Il2CppObject* dtt();  // RVA: 0x67B9A0
};

// Namespace: <global>
class FlickerController : public MonoBehaviour
{
public:
    // Static fields
    // static MaterialPropertyBlock* bawi;
    // static int32_t bawj;

    uint8_t pad_0000[0x20]; // 0x0000
    SpriteRenderer* m_spriteRenderer; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float m_targetValue; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    float m_flickTime; // 0x002C
    uint8_t pad_002D[0x3]; // 0x002D
    Coroutine* bawk; // 0x0030

    // Methods
    void Awake();  // RVA: 0x7D9E50
    void dtu();  // RVA: 0x7D9F90
    void dtv();  // RVA: 0x7DA030
    IEnumerator* dtw();  // RVA: 0x7DA080
    void dtx(float a);  // RVA: 0x7DA0F0
    void .ctor();  // RVA: 0x626760
    static void .cctor();  // RVA: 0x7D9F20
};

// Namespace: <global>
class h : public MonoBehaviour
{
public:

    // Methods
    void Update();  // RVA: 0x630C10
    void .ctor();  // RVA: 0x626760
    void Start();  // RVA: 0x630C10
    void jzu();  // RVA: 0x630C10
    void ksm();  // RVA: 0x630C10
    void jma();  // RVA: 0x630C10
    void lyf();  // RVA: 0x630C10
};

// Namespace: <global>
class k : public b
{
public:

    // Methods
    void Update();  // RVA: 0x7EBDA0
    void dtl(EUNITSTATE a);  // RVA: 0x7EBE70
    void .ctor();  // RVA: 0x626760
};

// Namespace: <global>
class m : public MonoBehaviour
{
public:

    // Methods
    void .ctor();  // RVA: 0x626760
    void jcc();  // RVA: 0x630C10
    void lhs();  // RVA: 0x630C10
    void lbm();  // RVA: 0x630C10
    void Start();  // RVA: 0x630C10
    void cpz();  // RVA: 0x630C10
    void Update();  // RVA: 0x630C10
    void cgh();  // RVA: 0x630C10
};

// Namespace: <global>
class HpBar : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    RectTransform* rect_m; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Slider* slider; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Image* image_Fillarea; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Unit* unit_Attach; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Vector3 monsterOffset; // 0x0040
    uint8_t pad_0041[0xB]; // 0x0041
    Vector3 heroOffset; // 0x004C
    uint8_t pad_004D[0xB]; // 0x004D
    Color color_Monster; // 0x0058
    uint8_t pad_0059[0xF]; // 0x0059
    Color color_Hero; // 0x0068

    // Methods
    void dty(Unit* a);  // RVA: 0x7DB690
    void Update();  // RVA: 0x7DB590
    void dtz();  // RVA: 0x7DB7C0
    void dua(float a);  // RVA: 0x7DB8F0
    void dub();  // RVA: 0x7DB940
    void .ctor();  // RVA: 0x7DB5E0
};

// Namespace: <global>
class n : public b
{
public:

    // Methods
    void dtl(EUNITSTATE a);  // RVA: 0x7EC030
    void .ctor();  // RVA: 0x626760
};

// Namespace: <global>
struct EUNITSTATE
{
public:
    // Static fields
    // static EUNITSTATE NONE;
    // static EUNITSTATE IDLE;
    // static EUNITSTATE MOVE;
    // static EUNITSTATE RETURN_TO_POSITION;
    // static EUNITSTATE ATTACK;
    // static EUNITSTATE REVIVE;
    // static EUNITSTATE DIE;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
struct EATTACKSTATE
{
public:
    // Static fields
    // static EATTACKSTATE PREDELAY;
    // static EATTACKSTATE ACTIONTIME;
    // static EATTACKSTATE POSTDELAY;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
struct TextDisplayPosition
{
public:
    // Static fields
    // static TextDisplayPosition Center;
    // static TextDisplayPosition Top;
    // static TextDisplayPosition Bottom;
    // static TextDisplayPosition TopOffset;
    // static TextDisplayPosition CenterUp;
    // static TextDisplayPosition CenterDown;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
class o
{
public:
    // Static fields
    // static intptr_t bawl;
    // static int32_t bawm;
    // static int32_t bawn;


    // Methods
    static int32_t RegOpenKeyEx(intptr_t hKey, Il2CppString* lpSubKey, int32_t ulOptions, int32_t samDesired, intptr_t phkResult);  // RVA: 0x7EC360
    static uint32_t GetModuleFileName(intptr_t hModule, StringBuilder* lpFilename, int32_t nSize);  // RVA: 0x7EC170
    static int32_t RegDeleteValue(intptr_t hKey, Il2CppString* lpValueName);  // RVA: 0x7EC2C0
    static void lvh(Il2CppString* a, bool b);  // RVA: 0x7ECD00
    static int32_t RegCloseKey(intptr_t hKey);  // RVA: 0x7EC240
    static int32_t RegSetValueEx(intptr_t hKey, Il2CppString* lpValueName, int32_t Reserved, int32_t dwType, Il2CppString* lpData, int32_t cbData);  // RVA: 0x7EC430
    void .ctor();  // RVA: 0x626570
    static void .cctor();  // RVA: 0x7EC520
    static void baj(Il2CppString* a, bool b);  // RVA: 0x7EC580
    static void duc(Il2CppString* a, bool b);  // RVA: 0x7EC940
};

// Namespace: <global>
class MonitorEnumDelegate : public MulticastDelegate
{
public:

    // Methods
    void .ctor(Il2CppObject* object, intptr_t method);  // RVA: 0x7DC370
    bool Invoke(intptr_t hMonitor, intptr_t hdcMonitor, intptr_t lprcMonitor, intptr_t dwData);  // RVA: 0x7DC350
    IAsyncResult* BeginInvoke(intptr_t hMonitor, intptr_t hdcMonitor, intptr_t lprcMonitor, intptr_t dwData, AsyncCallback* callback, Il2CppObject* object);  // RVA: 0x7DC270
    bool EndInvoke(IAsyncResult* result);  // RVA: 0x7DC320
};

// Namespace: <global>
class p : public MonoBehaviour
{
public:
    // Static fields
    // static uint32_t bawo;
    // static int32_t bawp;
    // static int32_t bawq;
    // static RECT bawr;


    // Methods
    static bool due(intptr_t a, intptr_t b, intptr_t c, intptr_t d);  // RVA: 0x7ED5F0
    static bool GetMonitorInfo(intptr_t hMonitor, MONITORINFO lpmi);  // RVA: 0x7ED180
    void hcu();  // RVA: 0x7EDC50
    void kln(bool hasFocus);  // RVA: 0x7ED330
    void dud();  // RVA: 0x7ED410
    void bln();  // RVA: 0x7ED340
    static bool EnumDisplayMonitors(intptr_t hdc, intptr_t lprcClip, MonitorEnumDelegate* lpfnEnum, intptr_t dwData);  // RVA: 0x7ED0C0
    void duf();  // RVA: 0x7ED800
    static intptr_t MonitorFromWindow(intptr_t hwnd, uint32_t dwFlags);  // RVA: 0x7ED2A0
    void eui();  // RVA: 0x7ED8D0
    void .ctor();  // RVA: 0x626760
    void guo();  // RVA: 0x7EDA70
    static bool GetWindowRect(intptr_t hwnd, RECT rect);  // RVA: 0x7ED210
    void jqu();  // RVA: 0x7EDD20
    void ju(bool hasFocus);  // RVA: 0x7ED330
    void gke();  // RVA: 0x7ED9A0
    void OnApplicationFocus(bool hasFocus);  // RVA: 0x7ED330
    void ncu(bool hasFocus);  // RVA: 0x7ED330
};

// Namespace: <global>
class BoxEffectController : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    System.Collections.Generic.List<SpriteAnimation_Image> animationLists; // 0x0020

    // Methods
    void dug(int32_t a);  // RVA: 0x7D93B0
    bool duh();  // RVA: 0x7D95B0
    void OnDisable();  // RVA: 0x7D92C0
    void .ctor();  // RVA: 0x626760
};

// Namespace: <global>
class q : public MonoBehaviour
{
public:

    // Methods
    void OnPointerDown(PointerEventData* eventData);  // RVA: 0x630C10
    void OnPointerUp(PointerEventData* eventData);  // RVA: 0x630C10
    void .ctor();  // RVA: 0x626760
};

// Namespace: <global>
class ItemSlotDirectMovePreview : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    RectTransform* RectTransform; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Image* m_hoverTargetImage; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Sprite* m_moveToTradingStashIcon; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Sprite* m_moveToCubeIcon; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Sprite* m_moveToInventoryIcon; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    Sprite* m_moveToStashIcon; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Sprite* m_moveToGearIcon; // 0x0050

    // Methods
    void dui(ESlotType a, ESlotType b);  // RVA: 0x7DB960
    void .ctor();  // RVA: 0x626760
};

// Namespace: <global>
struct <DelayedAnimation>d__7
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    SelectHeroEffectController* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x7E1060
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7E1050
};

// Namespace: <global>
class SelectHeroEffectController : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    SpriteAnimation_Image* spriteAnimationImage; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    SpriteAnimation_Image[][] effectObjects; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    int32_t targetFrame; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float delay; // 0x0034

    // Methods
    void Awake();  // RVA: 0x7DC500
    void OnDestroy();  // RVA: 0x7DC600
    void duj(int32_t a);  // RVA: 0x7DC740
    UniTaskVoid duk();  // RVA: 0x7DC800
    void dul();  // RVA: 0x7DC890
    void .ctor();  // RVA: 0x626760
};

// Namespace: <global>
struct <DelayedAnimation>d__9
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    SelectHeroShakeFlashController* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x7E12C0
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7E1050
};

// Namespace: <global>
class SelectHeroShakeFlashController : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    SpriteAnimation_Image* spriteAnimationImage; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    int32_t targetFrame; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    SelectHeroOption* selectHeroOption; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    bool hasFlash; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Il2CppString* otherAnimKey; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    bool hasShake; // 0x0048
    uint8_t pad_0049[0x3]; // 0x0049
    float delay; // 0x004C

    // Methods
    void Awake();  // RVA: 0x7DCAD0
    void OnDestroy();  // RVA: 0x7DCBD0
    UniTaskVoid dum();  // RVA: 0x7DCE70
    void Play(int32_t frame);  // RVA: 0x7DCD10
    void Play();  // RVA: 0x7DCDD0
    void .ctor();  // RVA: 0x626760
};

// Namespace: <global>
class r
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    SkillPointAnimationController* baws; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    RectTransform* bawt; // 0x0018

    // Methods
    void .ctor();  // RVA: 0x626570
    void dun();  // RVA: 0x7EDF00
    void lld();  // RVA: 0x7EDF00
};

// Namespace: <global>
class SkillPointAnimationController : public MonoBehaviour
{
public:
    // Static fields
    // static Color bawu;
    // static Color bawv;

    uint8_t pad_0000[0x20]; // 0x0000
    Image* m_sliderBarCover; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    GameObject* prefab; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Transform* poolHolder; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Transform[][] m_iconTargetPos; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    float m_animDurationTime; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    System.Collections.Generic.Queue<UnityEngine.RectTransform> baww; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    System.Collections.Generic.List<UnityEngine.RectTransform> bawx; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    Tweener* bawy; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    ActiveSkillSlotDetail* bawz; // 0x0060

    // Methods
    void Awake();  // RVA: 0x7DCF00
    void duo();  // RVA: 0x7DD2B0
    void dup();  // RVA: 0x7DD3A0
    void duq(bool a);  // RVA: 0x7DD5C0
    void dur();  // RVA: 0x7DD820
    void dus();  // RVA: 0x7DD960
    void dut(Color a);  // RVA: 0x7DDAA0
    void duu(int32_t a, int32_t b);  // RVA: 0x7DDB80
    RectTransform* duv();  // RVA: 0x7DE0B0
    void duw(RectTransform* a);  // RVA: 0x7DE1F0
    void OnDisable();  // RVA: 0x7DD030
    void .ctor();  // RVA: 0x7DD1E0
    static void .cctor();  // RVA: 0x7DD180
};

// Namespace: <global>
class ActSlot : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    int32_t act; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* text_ActName; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Button* btn; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    ToggleButton* button_toggle; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    float m_selectedCorrectionY; // 0x0040
    uint8_t pad_0041[0x3]; // 0x0041
    float m_unSelectedCorrectionY; // 0x0044
    uint8_t pad_0045[0x3]; // 0x0045
    Color m_selectedColor; // 0x0048
    uint8_t pad_0049[0xF]; // 0x0049
    Color m_unSelectedColor; // 0x0058
    uint8_t pad_0059[0xF]; // 0x0059
    System.Action<System.Int32> baxa; // 0x0068

    // Methods
    void dux(int32_t a, System.Action<System.Int32> b);  // RVA: 0x7D66E0
    void duy();  // RVA: 0x7D6840
    void duz(bool a);  // RVA: 0x7D6920
    void dva();  // RVA: 0x7D6A00
    void .ctor();  // RVA: 0x626760
};

// Namespace: <global>
class u : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    System.Collections.Generic.List<TaskbarHero.UI.AttributeSlot> attributeSlots; // 0x0020

    // Methods
    void .ctor();  // RVA: 0x7EDFB0
};

// Namespace: <global>
class LogSlot : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    RectTransform* rt; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* Text_LogText; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Animator* animator; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    caq* feedback1; // 0x0038

    // Methods
    void dvb(Il2CppString* a, Vector2 b, GradeSO* c);  // RVA: 0x7DC0A0
    void offObject();  // RVA: 0x630C10
    void dvc();  // RVA: 0x7DC210
    void .ctor();  // RVA: 0x626760
};

// Namespace: <global>
class ba : public MonoBehaviour
{
public:

    // Methods
    void Start();  // RVA: 0x630C10
    void hlw();  // RVA: 0x630C10
    void .ctor();  // RVA: 0x626760
    void fki();  // RVA: 0x630C10
    void Update();  // RVA: 0x630C10
    void nbu();  // RVA: 0x630C10
};

// Namespace: <global>
class bb
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t baxb; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* baxc; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BlinkAnimation* baxd; // 0x0020

    // Methods
    void .ctor(int32_t a);  // RVA: 0x668880
    void dvd();  // RVA: 0x630C10
    bool MoveNext();  // RVA: 0x7E4AA0
    Il2CppObject* dve();  // RVA: 0x67B9A0
    void dvf();  // RVA: 0x7E4CC0
    Il2CppObject* dvg();  // RVA: 0x67B9A0
};

// Namespace: <global>
class bc
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t baxe; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* baxf; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BlinkAnimation* baxg; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float baxh; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    float baxi; // 0x002C
    uint8_t pad_002D[0x3]; // 0x002D
    float baxj; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float baxk; // 0x0034

    // Methods
    void .ctor(int32_t a);  // RVA: 0x668880
    void dvh();  // RVA: 0x630C10
    bool MoveNext();  // RVA: 0x7E4D00
    Il2CppObject* dvi();  // RVA: 0x67B9A0
    void dvj();  // RVA: 0x7E4E40
    Il2CppObject* dvk();  // RVA: 0x67B9A0
};

// Namespace: <global>
class bd
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t baxl; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* baxm; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BlinkAnimation* baxn; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float baxo; // 0x0028

    // Methods
    void .ctor(int32_t a);  // RVA: 0x668880
    void dvl();  // RVA: 0x630C10
    bool MoveNext();  // RVA: 0x7E4E80
    Il2CppObject* dvm();  // RVA: 0x67B9A0
    void dvn();  // RVA: 0x7E4F90
    Il2CppObject* dvo();  // RVA: 0x67B9A0
};

// Namespace: <global>
class BlinkAnimation : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    float blinkSpeed; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    float minAlpha; // 0x0024
    uint8_t pad_0025[0x3]; // 0x0025
    float maxAlpha; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    bool smoothBlink; // 0x002C
    bool playOnStart; // 0x002D
    bool loop; // 0x002E
    bool unscaledTime; // 0x002F
    SpriteRenderer* baxp; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Image* baxq; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    CanvasGroup* baxr; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    TextMesh* baxs; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    MeshRenderer* baxt; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    TextMeshProUGUI* baxu; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    TextMeshPro* baxv; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    bool baxw; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    Coroutine* baxx; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    float baxy; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    Action* OnBlinkStart; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    Action* OnBlinkEnd; // 0x0088
    uint8_t pad_0089[0x7]; // 0x0089
    Action* OnBlinkCycle; // 0x0090

    // Methods
    bool dvp();  // RVA: 0x7D6AE0
    float dvq();  // RVA: 0x7D6AF0
    void dvr(float a);  // RVA: 0x7D6B00
    float dvs();  // RVA: 0x7D6B20
    float dvt();  // RVA: 0x7D6B30
    void Awake();  // RVA: 0x7D6A20
    void Start();  // RVA: 0x7D6AB0
    void OnValidate();  // RVA: 0x7D6A40
    void dvu();  // RVA: 0x7D6B40
    void dvv();  // RVA: 0x7D6E10
    void dvw();  // RVA: 0x7D7080
    void dvx();  // RVA: 0x7D7130
    void dvy();  // RVA: 0x7D7180
    void dvz();  // RVA: 0x7D7270
    void dwa(float a);  // RVA: 0x7D7280
    float dwb();  // RVA: 0x7D7690
    void dwc(float a, float b, float c, bool d);  // RVA: 0x7D7900
    IEnumerator* dwd();  // RVA: 0x7D7A70
    IEnumerator* dwe(float a);  // RVA: 0x7D7AE0
    IEnumerator* dwf(float a);  // RVA: 0x7D7B60
    void dwg();  // RVA: 0x7D7BE0
    void .ctor();  // RVA: 0x7D6AC0
};

// Namespace: <global>
struct SpriteAnimClip
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Il2CppString* ClipName; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Sprite[][] Sprites; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bool Loop; // 0x0020
};

// Namespace: <global>
class be
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t baxz; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* baya; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    SpriteAnimation_Image* bayb; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float bayc; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    int32_t bayd; // 0x002C

    // Methods
    void .ctor(int32_t a);  // RVA: 0x668880
    void dwh();  // RVA: 0x630C10
    bool MoveNext();  // RVA: 0x7E4FD0
    Il2CppObject* dwi();  // RVA: 0x67B9A0
    void dwj();  // RVA: 0x7E5210
    Il2CppObject* dwk();  // RVA: 0x67B9A0
};

// Namespace: <global>
class SpriteAnimation_Image : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Image* image; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    System.Collections.Generic.List<UnityEngine.Sprite> sprites; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float duration; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float speed; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    bool playOnStart; // 0x0038
    bool PlayOnEnable; // 0x0039
    bool loop; // 0x003A
    bool unscaledTime; // 0x003B
    bool m_deactivateOnComplete; // 0x003C
    uint8_t pad_003D[0x3]; // 0x003D
    Coroutine* baye; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    bool bayf; // 0x0048
    uint8_t pad_0049[0x3]; // 0x0049
    int32_t bayg; // 0x004C
    uint8_t pad_004D[0x3]; // 0x004D
    Action* OnAnimationStart; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    Action* OnAnimationComplete; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    System.Action<System.Int32> OnFrameChanged; // 0x0060

    // Methods
    Image* dwl();  // RVA: 0x638FA0
    System.Collections.Generic.List<UnityEngine.Sprite> dwm();  // RVA: 0x66AE70
    float dwn();  // RVA: 0x7DE510
    float dwo();  // RVA: 0x7DE520
    bool dwp();  // RVA: 0x7DE530
    bool dwq();  // RVA: 0x7DE540
    int32_t dwr();  // RVA: 0x7DE550
    int32_t dws();  // RVA: 0x7DE560
    float dwt();  // RVA: 0x7DE5A0
    void Start();  // RVA: 0x7DE420
    void OnEnable();  // RVA: 0x7DE310
    void OnValidate();  // RVA: 0x7DE370
    void dwu();  // RVA: 0x7DE5F0
    void dwv();  // RVA: 0x7DE7D0
    void dww();  // RVA: 0x7DE820
    void dwx(int32_t a);  // RVA: 0x7DE8B0
    void dwy();  // RVA: 0x7DE9B0
    void dwz();  // RVA: 0x7DEA00
    IEnumerator* dxa();  // RVA: 0x7DEA60
    void dxb(float a, float b, bool c);  // RVA: 0x7DEAD0
    void dxc(System.Collections.Generic.List<UnityEngine.Sprite> a);  // RVA: 0x7DEB70
    void dxd(Sprite* a);  // RVA: 0x7DECF0
    void dxe(int32_t a);  // RVA: 0x7DED80
    void dxf();  // RVA: 0x7DEE10
    void dxg();  // RVA: 0x630C10
    void .ctor();  // RVA: 0x7DE480
};

// Namespace: <global>
class bf
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bayh; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* bayi; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    SpriteAnimation_SpriteRenderer* bayj; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float bayk; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    int32_t bayl; // 0x002C

    // Methods
    void .ctor(int32_t a);  // RVA: 0x668880
    void dxh();  // RVA: 0x630C10
    bool MoveNext();  // RVA: 0x7E5250
    Il2CppObject* dxi();  // RVA: 0x67B9A0
    void dxj();  // RVA: 0x7E5730
    Il2CppObject* dxk();  // RVA: 0x67B9A0
};

// Namespace: <global>
class SpriteAnimation_SpriteRenderer : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    SpriteRenderer* spriteRenderer; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    System.Collections.Generic.List<UnityEngine.Sprite> sprites; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float duration; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float delay; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    bool playOnStart; // 0x0038
    bool PlayOnEnable; // 0x0039
    bool DisableObjectWhenPlayEnd; // 0x003A
    bool m_disableRendererWhenPlayEnd; // 0x003B
    bool loop; // 0x003C
    bool unscaledTime; // 0x003D
    bool randomZRotation; // 0x003E
    uint8_t pad_003F[0x1]; // 0x003F
    Coroutine* baym; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    bool bayn; // 0x0048
    uint8_t pad_0049[0x3]; // 0x0049
    int32_t bayo; // 0x004C
    uint8_t pad_004D[0x3]; // 0x004D
    Color bayp; // 0x0050
    uint8_t pad_0051[0xF]; // 0x0051
    bool bayq; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    WaitForSeconds* bayr; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    WaitForSecondsRealtime* bays; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    float bayt; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    Action* OnAnimationStart; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    Action* OnAnimationComplete; // 0x0088
    uint8_t pad_0089[0x7]; // 0x0089
    System.Action<System.Int32> OnFrameChanged; // 0x0090
    uint8_t pad_0091[0x7]; // 0x0091
    Action* OnDelayStart; // 0x0098
    uint8_t pad_0099[0x7]; // 0x0099
    Action* OnDelayComplete; // 0x00A0

    // Methods
    SpriteRenderer* dxl();  // RVA: 0x638FA0
    System.Collections.Generic.List<UnityEngine.Sprite> dxm();  // RVA: 0x66AE70
    float dxn();  // RVA: 0x7DE510
    float dxo();  // RVA: 0x7DE520
    bool dxp();  // RVA: 0x7DF180
    bool dxq();  // RVA: 0x7DE540
    int32_t dxr();  // RVA: 0x7DE550
    int32_t dxs();  // RVA: 0x7DF190
    float dxt();  // RVA: 0x7DF1D0
    void Start();  // RVA: 0x7DF060
    void OnEnable();  // RVA: 0x7DEF40
    void OnDisable();  // RVA: 0x7DEEA0
    void dxu();  // RVA: 0x7DF220
    void dxv();  // RVA: 0x7DF2B0
    void OnValidate();  // RVA: 0x7DEFB0
    void dxw();  // RVA: 0x7DF3B0
    void dxx();  // RVA: 0x7DF4B0
    void dxy();  // RVA: 0x7DF560
    void dxz(int32_t a);  // RVA: 0x7DF5D0
    void dya();  // RVA: 0x7DF6D0
    void dyb();  // RVA: 0x7DF720
    WaitForSeconds* dyc(float a);  // RVA: 0x7DF780
    WaitForSecondsRealtime* dyd(float a);  // RVA: 0x7DF850
    IEnumerator* dye();  // RVA: 0x7DF920
    void dyf(float a, float b, bool c);  // RVA: 0x7DF990
    void dyg(System.Collections.Generic.List<UnityEngine.Sprite> a);  // RVA: 0x7DFA10
    void dyh(Sprite* a);  // RVA: 0x7DFB60
    void dyi(int32_t a);  // RVA: 0x7DFBF0
    void dyj();  // RVA: 0x7DFC80
    void dyk();  // RVA: 0x630C10
    void .ctor();  // RVA: 0x7DF0F0
};

// Namespace: <global>
class <>c
{
public:
    // Static fields
    // static <>c* <>9;
    // static UnityAction* <>9__15_0;


    // Methods
    static void .cctor();  // RVA: 0x7E18D0
    void .ctor();  // RVA: 0x626570
    void dyl();  // RVA: 0x7E1940
};

// Namespace: <global>
class BottomStageQuickMenu : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    bool bayu; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    RectTransform* m_quickMenu; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    ScreenBoundsCorrector* m_screenBoundsCorrector; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    float m_bottomOnTopPos; // 0x0038
    uint8_t pad_0039[0x3]; // 0x0039
    float m_bottomOnBottomPos; // 0x003C
    uint8_t pad_003D[0x3]; // 0x003D
    oi* m_quickMenuHoverCheck; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    Button* m_nonPresetButton; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Button* m_pinBattleScreenButton; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    TextMeshProUGUI* m_pinBattleScreenText; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    Button* m_muteButton; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    TextMeshProUGUI* m_muteText; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    Button* m_alwaysOnTopButton; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    TextMeshProUGUI* m_alwaysOnTopText; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    System.Collections.Generic.List<TaskbarHero.UI.LayoutPresetButton> m_layoutPresetButtons; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    bool bayv; // 0x0088

    // Methods
    void dym();  // RVA: 0x7D82A0
    void dyn(bool a);  // RVA: 0x7D8F20
    void dyo(bool a);  // RVA: 0x7D8FA0
    void dyp(bool a);  // RVA: 0x7D9080
    void dyq(ESoundType a, float b);  // RVA: 0x7D9160
    void Update();  // RVA: 0x7D8240
    void OnDisable();  // RVA: 0x626750
    void OnPointerClick(PointerEventData* eventData);  // RVA: 0x7D8070
    void OnPointerEnter(PointerEventData* eventData);  // RVA: 0x7D8230
    void OnPointerExit(PointerEventData* eventData);  // RVA: 0x626750
    void .ctor();  // RVA: 0x626760
    void dyr();  // RVA: 0x7D9290
};

// Namespace: <global>
class StageTooltip : public MonoBehaviour
{
public:
    // Static fields
    // static int32_t bayw;
    // static int32_t bayx;

    uint8_t pad_0000[0x20]; // 0x0000
    TextMeshProUGUI* m_titleText; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* m_stageTypeText; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    TextMeshProUGUI* m_stageLevelText; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Image* m_BG; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Sprite[][] m_bgSprites; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    GameObject* m_soulStoneBG; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Image* m_soulStoneIcon; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    TextMeshProUGUI* m_soulStoneAmountText; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    SpriteAnimation_Image* m_bluePortalAnim; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    SpriteAnimation_Image* m_redPortalAnim; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    GameObject* m_lockIcon; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    GameObject* m_bottomText; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    TextMeshProUGUI* m_bottomTextLabel; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    GameObject* m_mouseIcon; // 0x0088
    uint8_t pad_0089[0x7]; // 0x0089
    TextMeshProUGUI* m_enterText; // 0x0090
    uint8_t pad_0091[0x7]; // 0x0091
    Color m_normalColor; // 0x0098
    uint8_t pad_0099[0xF]; // 0x0099
    Color m_actBossColor; // 0x00A8

    // Methods
    void Show(StageCache* cache);  // RVA: 0x7DFCF0
    void Hide();  // RVA: 0x71E5E0
    void dys();  // RVA: 0x7E01B0
    void dyt(StageCache* a, int32_t b);  // RVA: 0x7E0310
    void dyu(bool a, bool b);  // RVA: 0x7E05C0
    void dyv(SpriteAnimation_Image* a, SpriteAnimation_Image* b, bool c);  // RVA: 0x7E05F0
    void dyw(StageCache* a, bool b, bool c, bool d, int32_t e);  // RVA: 0x7E0710
    void dyx(bool a, Il2CppString* b, Color c);  // RVA: 0x7E0A50
    void .ctor();  // RVA: 0x626760
};

// Namespace: <global>
class OfflineHeroSlot
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    GameObject* slotObject; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    TextMeshProUGUI* nameText; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    TextMeshProUGUI* levelText; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* expText; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Image* baseExp; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Image* addedExp; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    GameObject* levelUpFX; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    System.Collections.Generic.List<UnityEngine.GameObject> heroList; // 0x0048

    // Methods
    void .ctor();  // RVA: 0x7DC420
};

// Namespace: <global>
struct <ShowLevelUpFX>d__21
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    UI_OfflineReward* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    System.Collections.Generic.List<UI_OfflineReward.OfflineHeroSlot> list; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Awaiter <>u__1; // 0x0030

    // Methods
    void MoveNext();  // RVA: 0x7E1520
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7E1050
};

// Namespace: <global>
class UI_OfflineReward : public MonoBehaviour
{
public:
    // Static fields
    // static float bayy;
    // static float bayz;
    // static EEquipClassType[][] baza;

    uint8_t pad_0000[0x20]; // 0x0000
    TextMeshProUGUI* m_lastLoginText; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* m_offlineTimeText; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Slider* m_timeSlider; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    TextMeshProUGUI* m_goldText; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    GameObject* m_blockBG; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    OfflineHeroSlot[][] heroSlots; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    CanvasGroup* m_parentCanvasGroup; // 0x0050

    // Methods
    void dyy(OfflineRewardResult a);  // RVA: 0x7E3560
    void dyz(bool a);  // RVA: 0x7E3840
    void dza(OfflineRewardResult a);  // RVA: 0x7E3860
    void dzb(OfflineRewardResult a);  // RVA: 0x7E3AE0
    void dzc(OfflineRewardResult a);  // RVA: 0x7E3BA0
    void dzd(OfflineHeroSlot* a, OfflineRewardHeroResult b);  // RVA: 0x7E3F20
    void dze(OfflineHeroSlot* a, HeroInfoData* b);  // RVA: 0x7E4440
    int32_t dzf(HeroInfoData* a);  // RVA: 0x7E4600
    HeroInfoData* dzg(int32_t a);  // RVA: 0x7E46E0
    float dzh(float a, float b);  // RVA: 0x7E47D0
    UniTaskVoid dzi(System.Collections.Generic.List<UI_OfflineReward.OfflineHeroSlot> a);  // RVA: 0x7E4800
    void OnDisable();  // RVA: 0x7E3320
    void .ctor();  // RVA: 0x626760
    static void .cctor();  // RVA: 0x7E34D0
    bool dzj();  // RVA: 0x7E48B0
};

// Namespace: <global>
struct EStatusUIState
{
public:
    // Static fields
    // static EStatusUIState Default;
    // static EStatusUIState StatDetail;
    // static EStatusUIState AttributeDetail;
    // static EStatusUIState SkillEquip;
    // static EStatusUIState SkillSlot;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
struct EWorldUILocation
{
public:
    // Static fields
    // static EWorldUILocation Left;
    // static EWorldUILocation Center;
    // static EWorldUILocation Right;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
class UI_Main : public MonoBehaviour
{
public:
    // Static fields
    // static float bazc;
    // static float bazd;
    // static float baze;
    // static float bazf;

    uint8_t pad_0000[0x20]; // 0x0000
    UIManager* bazb; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    UiStateMachineBehaviour* _usm; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    RectTransform* panel_left; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    RectTransform* panel_right; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    RectTransform* panel_center; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    xr* button_Stash; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    xr* button_Stat; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    xr* button_Cube; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    xr* button_Rune; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    xr* button_Portal; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    System.Collections.Generic.List<xr> ContentButtons; // 0x0070

    // Methods
    void Awake();  // RVA: 0x7E2210
    void dzk();  // RVA: 0x7E25E0
    void Start();  // RVA: 0x7E24B0
    void OnEnable();  // RVA: 0x7E24B0
    void dzl();  // RVA: 0x7E26F0
    EWorldUILocation dzm(float a);  // RVA: 0x7E2960
    bool dzn();  // RVA: 0x7E2980
    bool dzo();  // RVA: 0x7E2A00
    void dzp();  // RVA: 0x7E2A80
    void dzq(float a);  // RVA: 0x7E2AC0
    void dzr(float a);  // RVA: 0x7E2B70
    void dzs(float a);  // RVA: 0x7E2C20
    void dzt();  // RVA: 0x7E2CD0
    void dzu();  // RVA: 0x7E2CD0
    void dzv();  // RVA: 0x7E2E30
    void dzw();  // RVA: 0x7E2F10
    void dzx();  // RVA: 0x7E2F20
    void dzy();  // RVA: 0x7E3170
    void dzz();  // RVA: 0x7E32F0
    void eaa();  // RVA: 0x7E32F0
    void .ctor();  // RVA: 0x7E2560
};

// Namespace: <global>
class bg : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Vector2 bazg; // 0x0020

    // Methods
    void bnn(float a);  // RVA: 0x7E5770
    void eac(Vector2 a);  // RVA: 0x7E5770
    void jcl(float a);  // RVA: 0x7E5770
    void ga(Vector2 a);  // RVA: 0x7E5770
    void eab(Vector2 a);  // RVA: 0x7E5780
    void ddz(Vector2 a);  // RVA: 0x7E5770
    void mng(Vector2 a);  // RVA: 0x7E5780
    void gku(Vector2 a);  // RVA: 0x7E5770
    void .ctor();  // RVA: 0x626760
    void ive(Vector2 a);  // RVA: 0x7E5780
    void lkr(float a);  // RVA: 0x7E5770
    void bcq(float a);  // RVA: 0x7E5770
    void bie(Vector2 a);  // RVA: 0x7E5780
    void ead(float a);  // RVA: 0x7E5770
};

// Namespace: <global>
struct <UpdateCoolTimeAsync>d__11
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bh* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x7E1DD0
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7E1050
};

// Namespace: <global>
class bh
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    float bazh; // 0x0010
    uint8_t pad_0011[0x3]; // 0x0011
    int32_t bazi; // 0x0014
    uint8_t pad_0015[0x3]; // 0x0015
    System.Action<System.Int32> bazj; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    CancellationTokenSource* bazk; // 0x0020

    // Methods
    void hoz();  // RVA: 0x7E5AC0
    void eag();  // RVA: 0x7E5930
    void eah();  // RVA: 0x7E58C0
    UniTaskVoid eai();  // RVA: 0x7E5A30
    bool eaf();  // RVA: 0x7E5920
    void bfw();  // RVA: 0x7E57C0
    void .ctor(int32_t a);  // RVA: 0x7E5790
    float eae();  // RVA: 0x7E5910
    void dly();  // RVA: 0x7E58C0
};

// Namespace: <global>
class bi
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bazl; // 0x0010

    // Methods
    void .ctor();  // RVA: 0x626570
};

// Namespace: <global>
class bj
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bazm; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* bazn; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    DeadUnitData* bazo; // 0x0020

    // Methods
    void .ctor(int32_t a);  // RVA: 0x668880
    void eaj();  // RVA: 0x630C10
    bool MoveNext();  // RVA: 0x7E5BC0
    Il2CppObject* eak();  // RVA: 0x67B9A0
    void eal();  // RVA: 0x7E5D50
    Il2CppObject* eam();  // RVA: 0x67B9A0
};

// Namespace: <global>
class DeadUnitData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    uf* cache; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    float currentResurrectionTime; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    System.Action<System.Single> OnProcessChange; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Coroutine* resurrectionCoroutine; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    int32_t bazp; // 0x0030

    // Methods
    int32_t ean();  // RVA: 0x7D9C80
    void .ctor(uf* cache, int32_t dieOrder);  // RVA: 0x7D9B30
    void eao();  // RVA: 0x7D9C90
    void eap();  // RVA: 0x7D9D60
    IEnumerator* eaq();  // RVA: 0x7D9DE0
};

// Namespace: <global>
class ObstacleScriptableObject : public ScriptableObject
{
public:
    uint8_t pad_0000[0x18]; // 0x0000
    System.Collections.Generic.List<System.Single> ObstacleMoveSpeeds; // 0x0018

    // Methods
    void .ctor();  // RVA: 0x6AB1C0
};

// Namespace: <global>
class SkillSO : public ScriptableObject
{
public:
    uint8_t pad_0000[0x18]; // 0x0000
    SKILLTYPE skillTYPE; // 0x0018
    uint8_t pad_0019[0x3]; // 0x0019
    float preTime; // 0x001C
    uint8_t pad_001D[0x3]; // 0x001D
    float actionTime; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    float postTime; // 0x0024
    uint8_t pad_0025[0x3]; // 0x0025
    bool KeepActivateOnRecast; // 0x0028
    bool CanMultiCastSkill; // 0x0029
    uint8_t pad_002A[0x6]; // 0x002A
    PrefabAndOffSetEffect* SkillEf_StartEf_Me; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    PrefabAndOffSetEffect* SkillEf_Direct_Other; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    PrefabAndOffSetEffect* AreaOfEffect_Other_Hitted; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    PrefabAndOffSetProjecTile* SkillProjecTile; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    AreaOfEffectData AreaOfEffectObject; // 0x0050
    uint8_t pad_0051[0x17]; // 0x0051
    bco* WillSpawnTurret; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    bl* WillSpawnTrap; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    float WillSpawnTrapFixedY; // 0x0078
    uint8_t pad_0079[0x3]; // 0x0079
    float WillSpawnTrapSpeed; // 0x007C
    uint8_t pad_007D[0x3]; // 0x007D
    float WillSpawnTrapRandPosOffsetDividedRange; // 0x0080
    uint8_t pad_0081[0x3]; // 0x0081
    float WillSpawnTrapRandPosOffsetIncrementDividedRange; // 0x0084
    uint8_t pad_0085[0x3]; // 0x0085
    float WillSpawnTrapRandPosMaxOffsetDividedRange; // 0x0088
    uint8_t pad_0089[0x3]; // 0x0089
    float WillFinalOffsetXDividedRange_Move; // 0x008C
    uint8_t pad_008D[0x3]; // 0x008D
    float WillFinalOffsetXDividedRange_NotMove; // 0x0090
    uint8_t pad_0091[0x7]; // 0x0091
    SpawnSomethingData SpawnSomethingData; // 0x0098
    uint8_t pad_0099[0x17]; // 0x0099
    MonsterRandomSpawnData RandomMonsterSpawnData; // 0x00B0
    uint8_t pad_00B1[0x17]; // 0x00B1
    Sprite* SkillSprite; // 0x00C8
    uint8_t pad_00C9[0x7]; // 0x00C9
    AnimationClip* SkillClip1; // 0x00D0
    uint8_t pad_00D1[0x7]; // 0x00D1
    AnimationClip* SkillClip2; // 0x00D8
    uint8_t pad_00D9[0x7]; // 0x00D9
    AnimationClip* SkillClip3; // 0x00E0

    // Methods
    bool ear();  // RVA: 0x7DE2A0
    bool eas();  // RVA: 0x7DE2B0
    bool eat();  // RVA: 0x7DE2C0
    bool eau();  // RVA: 0x7DE2D0
    bool eav();  // RVA: 0x7DE2E0
    bool eaw();  // RVA: 0x7DE2F0
    bool eax();  // RVA: 0x7DE300
    void .ctor();  // RVA: 0x7DE290
};

// Namespace: <global>
struct SpawnSomethingData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    GameObject* SpawnPrefab; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector3 Offset; // 0x0018
};

// Namespace: <global>
struct MonsterRandomSpawnData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    System.Collections.Generic.List<System.Int32> RandomSpawnMonsterKey; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    int32_t SpawnCount; // 0x0018
    uint8_t pad_0019[0x3]; // 0x0019
    float RandomSpawnPosOffsetMin; // 0x001C
    uint8_t pad_001D[0x3]; // 0x001D
    float RandomSpawnPosOffsetMax; // 0x0020
};

// Namespace: <global>
struct AreaOfEffectData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    GameObject* Prefab; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector3 OffSet; // 0x0018
};

// Namespace: <global>
class PrefabAndOffSetEffect
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    GameObject* Go_Prefab; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector3 OffSet; // 0x0018

    // Methods
    void .ctor();  // RVA: 0x7DC4A0
};

// Namespace: <global>
class PrefabAndOffSetProjecTile
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    bdb* Go_Prefab; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector3 OffSet; // 0x0018

    // Methods
    void .ctor();  // RVA: 0x7DC4A0
};

// Namespace: <global>
class TrapExplosionData : public ScriptableObject
{
public:
    uint8_t pad_0000[0x18]; // 0x0000
    EDamageAttribute ReactDamageType; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bbi* AreaOfEffect; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Il2CppString* ExplosionTriggerName; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float DividedExplosionDelayTime; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    int32_t DamageIncreaseValue; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    StatusEffectType StatusEffectType; // 0x0038
    uint8_t pad_0039[0x3]; // 0x0039
    float StatusEffectChance; // 0x003C

    // Methods
    void .ctor();  // RVA: 0x6AB1C0
};

// Namespace: <global>
struct <ActivatingExplosion>d__31
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bk* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TrapExplosionData* data; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Awaiter <>u__1; // 0x0030

    // Methods
    void MoveNext();  // RVA: 0x7E0B80
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7E1050
};

// Namespace: <global>
class bk : public bl
{
public:
    uint8_t pad_0000[0x48]; // 0x0000
    TrapExplosionData[][] ExplosionData; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Unit* bazq; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    System.Collections.Generic.Dictionary<TaskbarHero.Data.EDamageAttribute,TrapExplosionData> bazr; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    float bazs; // 0x0060
    uint8_t pad_0061[0x3]; // 0x0061
    EDamageAttribute bazt; // 0x0064
    uint8_t pad_0065[0x3]; // 0x0065
    EDamageType bazu; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    TrapExplosionData* bazv; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    bool bazw; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    CancellationTokenSource* bazx; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    Action* bazy; // 0x0088
    uint8_t pad_0089[0x7]; // 0x0089
    int32_t bazz; // 0x0090
    uint8_t pad_0091[0x3]; // 0x0091
    int32_t bbaa; // 0x0094
    uint8_t pad_0095[0x3]; // 0x0095
    int32_t bbab; // 0x0098

    // Methods
    void ebi(DamageInfo a, bool b);  // RVA: 0x7E63E0
    bool eaz();  // RVA: 0x660F00
    void ebe(int32_t a, int32_t b, int32_t c);  // RVA: 0x7E6140
    DamageInfo gew();  // RVA: 0x7E69F0
    void ebh(Vector3 a, Vector3 b, float c, float d);  // RVA: 0x7E6260
    Transform* ebc();  // RVA: 0x7E6130
    DamageableType eba();  // RVA: 0x7E6120
    Unit* ebb();  // RVA: 0x62DA80
    void dhl(EDamageAttribute a);  // RVA: 0x7E5FD0
    Vector3 eay();  // RVA: 0x7E60D0
    void ebj();  // RVA: 0x7E6590
    void ods(float a, Unit* b, EDamageType c, Action* d);  // RVA: 0x7E6080
    UniTaskVoid ebl(TrapExplosionData* a);  // RVA: 0x7E6680
    void ebk();  // RVA: 0x7E6620
    Vector3 ebp();  // RVA: 0x62A360
    float ebn();  // RVA: 0x7E68F0
    void .ctor();  // RVA: 0x7E5D90
    Bounds ebo();  // RVA: 0x7E6920
    void ffs(float a);  // RVA: 0x7E6210
    int32_t ebq();  // RVA: 0x7E69E0
    void mtr(int32_t a, int32_t b, int32_t c);  // RVA: 0x7E6140
    void dnv(float a, Unit* b, EDamageType c, Action* d);  // RVA: 0x7E6080
    void mcr(EDamageAttribute a);  // RVA: 0x7E6C60
    void ncr(int32_t a, int32_t b, int32_t c);  // RVA: 0x7E6140
    DamageInfo bkr();  // RVA: 0x7E5E10
    void hyc(EDamageAttribute a);  // RVA: 0x7E6BB0
    void ebg(float a);  // RVA: 0x7E6210
    void ebf(EDamageAttribute a);  // RVA: 0x7E6160
    void mth(float a);  // RVA: 0x7E6210
    void ebd(float a, Unit* b, EDamageType c, Action* d);  // RVA: 0x7E6080
    DamageInfo ebm();  // RVA: 0x7E6730
    void laq(float a, Unit* b, EDamageType c, Action* d);  // RVA: 0x7E6080
};

// Namespace: <global>
struct <UpdateTrapLifeTime>d__11
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bl* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x7E1FD0
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7E1050
};

// Namespace: <global>
class bl : public bch
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Animator* TrapAnimator; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    bdg* TrapMover; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float LifeTime; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float TrapMoveSpeed; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    float TrapMoveHeight; // 0x0038
    uint8_t pad_0039[0x3]; // 0x0039
    bool bbac; // 0x003C
    uint8_t pad_003D[0x3]; // 0x003D
    CancellationTokenSource* bbad; // 0x0040

    // Methods
    void hgl();  // RVA: 0x7E7340
    void lqu();  // RVA: 0x7E73C0
    void ebr();  // RVA: 0x7E7170
    void OnDisable();  // RVA: 0x7E6D10
    void im();  // RVA: 0x7E6D10
    void ebj();  // RVA: 0x7E7120
    void ebu();  // RVA: 0x7E7300
    void oom();  // RVA: 0x7E6D10
    void ebh(Vector3 a, Vector3 b, float c, float d);  // RVA: 0x7E6DC0
    void cez();  // RVA: 0x7E6D40
    void .ctor();  // RVA: 0x7E6D30
    void ebt();  // RVA: 0x7E7280
    void nhp();  // RVA: 0x7E7440
    UniTaskVoid ebs();  // RVA: 0x7E71F0
    void pm();  // RVA: 0x7E74C0
};

// Namespace: <global>
struct <UpdateAsync>d__15
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    LineController* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x7E1970
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x7E1050
};

// Namespace: <global>
class LineController : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    bool OnlyOneLoop; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    LineRenderer* LineRenderer; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Texture[][] lineTextures; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    float Fps; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    SpriteRenderer* m_headCap; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    SpriteRenderer* m_tailCap; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    float bbae; // 0x0050
    uint8_t pad_0051[0x3]; // 0x0051
    int32_t bbaf; // 0x0054
    uint8_t pad_0055[0x3]; // 0x0055
    bool bbag; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    Transform* bbah; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    Transform* bbai; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    Vector3 bbaj; // 0x0070
    uint8_t pad_0071[0xB]; // 0x0071
    Vector3 bbak; // 0x007C

    // Methods
    void ebv();  // RVA: 0x7DBAB0
    void ebw(Transform* a, Transform* b, Vector3 c, Vector3 d);  // RVA: 0x7DBB10
    UniTaskVoid ebx();  // RVA: 0x7DBDC0
    void eby(Vector3 a, Vector3 b);  // RVA: 0x7DBE40
    void .ctor();  // RVA: 0x626760
};

// Namespace: <global>
class bm : public bz
{
public:
    uint8_t pad_0000[0x38]; // 0x0000
    float FloorHalfSize; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    System.Collections.Generic.List<UnityEngine.GameObject> Presets; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    FollowCamera* FollowCamera; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    float ObstacleMoveSpeed; // 0x0050
    uint8_t pad_0051[0x3]; // 0x0051
    float TimeCorrectionValue; // 0x0054
    uint8_t pad_0055[0x3]; // 0x0055
    float bbal; // 0x0058
    uint8_t pad_0059[0x3]; // 0x0059
    int32_t bbam; // 0x005C
    uint8_t pad_005D[0x3]; // 0x005D
    System.Collections.Generic.List<bo> ChildLayers; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    int32_t bban; // 0x0068
    uint8_t pad_0069[0x3]; // 0x0069
    float bbao; // 0x006C
    uint8_t pad_006D[0x3]; // 0x006D
    Transform* bbap; // 0x0070

    // Methods
    void inh();  // RVA: 0x7E9310
    void ebz(Vector3 a, float b, int32_t c);  // RVA: 0x7E7E90
    void End();  // RVA: 0x7E7540
    void esg(Vector3 a, float b, int32_t c);  // RVA: 0x7E8880
    void lry();  // RVA: 0x7E9860
    void ecb(Transform* a);  // RVA: 0x7E8380
    void Hide();  // RVA: 0x7E7730
    void Show();  // RVA: 0x7E7760
    void drf(Vector3 a, float b, int32_t c);  // RVA: 0x7E7B30
    void Update();  // RVA: 0x7E7790
    void .ctor();  // RVA: 0x7E7AB0
    void iow();  // RVA: 0x7E7730
    void fre();  // RVA: 0x7E8F00
    void fhu();  // RVA: 0x7E8BE0
    void dut();  // RVA: 0x7E7730
    void mtz(Transform* a);  // RVA: 0x7E9A50
    void eca();  // RVA: 0x7E81F0
    void gqu();  // RVA: 0x7E7730
    void ocd();  // RVA: 0x7E7760
    void jxd(Vector3 a, float b, int32_t c);  // RVA: 0x7E9500
    void hxz(Transform* a);  // RVA: 0x7E9090
    void ecc(Transform* a);  // RVA: 0x7E8600
};

// Namespace: <global>
class bn : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Camera* bbaq; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    UI_Stage* bbar; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    bool OnHover; // 0x0030

    // Methods
    void Start();  // RVA: 0x7E9CD0
    void ifo();  // RVA: 0x7E9D90
    void .ctor();  // RVA: 0x626760
    void Update();  // RVA: 0x7E9D60
    void dhg();  // RVA: 0x7E9D60
};

// Namespace: <global>
class bo : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    System.Collections.Generic.List<SpriteAnimation_SpriteRenderer> SpriteAnimationList; // 0x0020

    // Methods
    void .ctor();  // RVA: 0x626760
    void ece();  // RVA: 0x7E9F60
    void opp();  // RVA: 0x7EA070
    void ecd();  // RVA: 0x7E9E20
};

// Namespace: <global>
class bp : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    System.Collections.Generic.List<UnityEngine.GameObject> BackGroundPresets; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    FollowCamera* FollowCamera; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float ObstacleMoveSpeed; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    System.Collections.Generic.List<SpriteAnimation_SpriteRenderer> SpriteAnimationList; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Vector3 bbas; // 0x0040

    // Methods
    void cwq();  // RVA: 0x7EA1B0
    void oos();  // RVA: 0x7EB5B0
    void Awake();  // RVA: 0x7EA1B0
    void End();  // RVA: 0x7EA1F0
    void ecf(Vector3 a);  // RVA: 0x7EACC0
    void zo();  // RVA: 0x7EA1B0
    void .ctor();  // RVA: 0x626760
    void boc(Vector3 a);  // RVA: 0x7EA570
    void bpx();  // RVA: 0x7EA940
    void njb(Vector3 a);  // RVA: 0x7EB1E0
    void Update();  // RVA: 0x7EA340
    void bzw();  // RVA: 0x7EAB70
    void hge();  // RVA: 0x7EB090
};

// Namespace: <global>
class bq
{
public:
    // Static fields
    // static Il2CppString* bbat;
    // static Il2CppString* bbau;
    // static Il2CppString* bbav;
    // static Il2CppString* bbaw;
    // static Il2CppString* bbax;
    // static Il2CppString* bbay;
    // static Il2CppString* bbaz;


    // Methods
    static void .cctor();  // RVA: 0x7EB700
};

// Namespace: <global>
class br
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Il2CppString* bbba; // 0x0010

    // Methods
    bool glu(Il2CppString* a);  // RVA: 0x7EB8B0
    void .ctor();  // RVA: 0x626570
    bool ecg(Il2CppString* a);  // RVA: 0x7EB8B0
};

// Namespace: <global>
class CsvManager : public MonoBehaviour
{
public:
    // Static fields
    // static CsvManager* bbbb;

    uint8_t pad_0000[0x20]; // 0x0000
    Il2CppString* m_csvFolderPath; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    System.Collections.Generic.List<UnityEngine.TextAsset> m_csvTextAssets; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    System.Collections.Generic.Dictionary<System.String,UnityEngine.TextAsset> bbbc; // 0x0030

    // Methods
    static CsvManager* ech();  // RVA: 0x7D97F0
    void Awake();  // RVA: 0x7D9690
    void eci();  // RVA: 0x7D9830
    System.Collections.Generic.List<a> ecj(Il2CppString* a);  // RVA: 0x418490
    TextAsset* eck(Il2CppString* a);  // RVA: 0x7D99C0
    String[][] ecl(Il2CppString* a);  // RVA: 0x7D9A20
    void .ctor();  // RVA: 0x7D96F0
};

// Namespace: <global>
class FollowCamera : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    StageManager* _stageController; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Unit[][] _targets; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Vector3 _battleModeOffset; // 0x0030
    uint8_t pad_0031[0xF]; // 0x0031
    RectTransform* m_stageUIRect; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    BoxCollider2D* m_collider2D; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Vector3 windowFrameOffset; // 0x0050
    uint8_t pad_0051[0xB]; // 0x0051
    Vector3 bbbd; // 0x005C
    uint8_t pad_005D[0xB]; // 0x005D
    float bbbe; // 0x0068
    uint8_t pad_0069[0x3]; // 0x0069
    float bbbf; // 0x006C
    uint8_t pad_006D[0x3]; // 0x006D
    float m_monsterTargetOffsetValue; // 0x0070
    uint8_t pad_0071[0x3]; // 0x0071
    float m_monsterFollowCameraCenterOffset; // 0x0074
    uint8_t pad_0075[0x3]; // 0x0075
    Vector3 m_windowFrameMonsterBattleFollowOffset; // 0x0078
    uint8_t pad_0079[0xB]; // 0x0079
    Vector3 m_windowFrameCorrectionOffset; // 0x0084
    uint8_t pad_0085[0xB]; // 0x0085
    float m_heroSpreadMaxDistance; // 0x0090
    uint8_t pad_0091[0x3]; // 0x0091
    float m_heroSpreadTargetOffsetX; // 0x0094
    uint8_t pad_0095[0x3]; // 0x0095
    float m_maxFollowDistance; // 0x0098
    uint8_t pad_0099[0x3]; // 0x0099
    float m_catchUpSpeedMultiplier; // 0x009C
    uint8_t pad_009D[0x3]; // 0x009D
    float bbbg; // 0x00A0
    uint8_t pad_00A1[0x7]; // 0x00A1
    TMP_InputField* m_debugCorrectionOffsetXInput; // 0x00A8
    uint8_t pad_00A9[0x7]; // 0x00A9
    TMP_InputField* m_debugCorrectionOffsetYInput; // 0x00B0
    uint8_t pad_00B1[0x7]; // 0x00B1
    TMP_InputField* m_debugCorrectionOffsetZInput; // 0x00B8

    // Methods
    Transform* ecm();  // RVA: 0x7DA280
    Vector3 ecn();  // RVA: 0x7DA2B0
    float eco();  // RVA: 0x7DA2F0
    void Start();  // RVA: 0x7DA1C0
    void ecp();  // RVA: 0x7DA300
    void ecq(Il2CppString* a);  // RVA: 0x7DA600
    void ecr(Il2CppString* a);  // RVA: 0x7DA640
    void ecs(Il2CppString* a);  // RVA: 0x7DA680
    void Update();  // RVA: 0x7DA1D0
    void ect();  // RVA: 0x7DA6C0
    void ecu(float a);  // RVA: 0x7DA990
    void ecv(Unit[][] a);  // RVA: 0x7DA9A0
    Vector3 ecw();  // RVA: 0x7DAC60
    Vector3 ecx();  // RVA: 0x7DAD70
    Vector3 ecy();  // RVA: 0x7DAE80
    void ecz(Vector3 a);  // RVA: 0x7DB380
    void .ctor();  // RVA: 0x7DA1E0
};

// Namespace: <global>
class TestFollowScript : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Transform* m_stageUIRect; // 0x0020

    // Methods
    void Update();  // RVA: 0x7F31F0
    void .ctor();  // RVA: 0x626760
};

// Namespace: <global>
class AnimationEf : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    SpriteRenderer* spr; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    SpriteAnimation_SpriteRenderer* sprite_Animation; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    System.Collections.Generic.List<SpriteAnimation_SpriteRenderer> additionalAnimations; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Action* bbbh; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    bool EndDestroy; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    SpriteAnimation_SpriteRenderer* bbbi; // 0x0048
