// ============================================================
// Image: ACTk.Runtime.dll
// ============================================================

namespace Microsoft.CodeAnalysis
{

    // Namespace: Microsoft.CodeAnalysis
    class EmbeddedAttribute : public Attribute
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x65BDD0
    };

} // namespace Microsoft.CodeAnalysis

namespace System.Runtime.CompilerServices
{

    // Namespace: System.Runtime.CompilerServices
    class IsUnmanagedAttribute : public Attribute
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x65BDD0
    };

} // namespace System.Runtime.CompilerServices

// Namespace: <global>
struct MonoScriptData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Byte[][] FilePathsData; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Byte[][] TypesData; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    int32_t TotalTypes; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    int32_t TotalFiles; // 0x0024
    uint8_t pad_0025[0x3]; // 0x0025
    bool IsEditorOnly; // 0x0028
};

// Namespace: <global>
class dam
{
public:

    // Methods
    static MonoScriptData mgv();  // RVA: 0x65CC40
    static MonoScriptData vyt();  // RVA: 0x65CD20
    void .ctor();  // RVA: 0x626570
    static MonoScriptData dxh();  // RVA: 0x65CA80
    static MonoScriptData jvb();  // RVA: 0x65CB60
};

// Namespace: <global>
class dan
{
public:

    // Methods
    static void vyu();  // RVA: 0x630C10
    static void bnd();  // RVA: 0x630C10
    static void ltc();  // RVA: 0x630C10
    static void ewk();  // RVA: 0x630C10
    static void mmp();  // RVA: 0x630C10
    static void olc();  // RVA: 0x630C10
    static void jqx();  // RVA: 0x630C10
    static void dkd();  // RVA: 0x630C10
    static void vyv();  // RVA: 0x630C10
};

// Namespace: <global>
class ApplicationFocusEventHandler : public MulticastDelegate
{
public:

    // Methods
    void .ctor(Il2CppObject* object, intptr_t method);  // RVA: 0x65BCC0
    void Invoke(bool hasFocus);  // RVA: 0x65BCB0
    IAsyncResult* BeginInvoke(bool hasFocus, AsyncCallback* callback, Il2CppObject* object);  // RVA: 0x65BC40
    void EndInvoke(IAsyncResult* result);  // RVA: 0x65BCA0
};

// Namespace: <global>
class ApplicationPauseEventHandler : public MulticastDelegate
{
public:

    // Methods
    void .ctor(Il2CppObject* object, intptr_t method);  // RVA: 0x65BCC0
    void Invoke(bool pauseStatus);  // RVA: 0x65BCB0
    IAsyncResult* BeginInvoke(bool pauseStatus, AsyncCallback* callback, Il2CppObject* object);  // RVA: 0x65BC40
    void EndInvoke(IAsyncResult* result);  // RVA: 0x65BCA0
};

// Namespace: <global>
class dao : public MonoBehaviour
{
public:
    // Static fields
    // static dao* bmni;

    uint8_t pad_0000[0x20]; // 0x0000
    ApplicationFocusEventHandler* bmng; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    ApplicationPauseEventHandler* bmnh; // 0x0028

    // Methods
    void Awake();  // RVA: 0x65CE00
    void OnApplicationFocus(bool hasFocus);  // RVA: 0x65CEA0
    void vyz(ApplicationPauseEventHandler* a);  // RVA: 0x65D2A0
    void meh(bool pauseStatus);  // RVA: 0x65CEC0
    void nny();  // RVA: 0x65CF80
    void ya(bool pauseStatus);  // RVA: 0x65CEC0
    void vyy(ApplicationPauseEventHandler* a);  // RVA: 0x65D200
    void vyx(ApplicationFocusEventHandler* a);  // RVA: 0x65D160
    void OnApplicationPause(bool pauseStatus);  // RVA: 0x65CEC0
    void kfq(bool pauseStatus);  // RVA: 0x65CEC0
    void oau();  // RVA: 0x65D020
    static dao* vza();  // RVA: 0x65D340
    void vyw(ApplicationFocusEventHandler* a);  // RVA: 0x65D0C0
    void .ctor();  // RVA: 0x626760
    void jld();  // RVA: 0x65CEE0
    void ltf(bool pauseStatus);  // RVA: 0x65CEC0
};

// Namespace: <global>
class dap
{
public:

    // Methods
    static Char[][] vzc(Il2CppString* a);  // RVA: 0x65DE50
    static Il2CppString* kqf(Il2CppString* a);  // RVA: 0x65DA30
    static Il2CppString* cxg(Il2CppString* a);  // RVA: 0x65D740
    static Il2CppString* vze(Char[][] a);  // RVA: 0x65E010
    static Il2CppString* mbn(Il2CppString* a);  // RVA: 0x65DC70
    static Il2CppString* vzb(Il2CppString* a);  // RVA: 0x65DDB0
    static Char[][] ijl(Il2CppString* a);  // RVA: 0x65D990
    static Il2CppString* ezd(Il2CppString* a);  // RVA: 0x65D7E0
    static Il2CppString* bcb(Il2CppString* a);  // RVA: 0x65D470
    static Char[][] nko(Il2CppString* a);  // RVA: 0x65DD10
    static Il2CppString* lfv(Il2CppString* a);  // RVA: 0x65DB50
    static Il2CppString* bmj(Il2CppString* a);  // RVA: 0x65D510
    static Il2CppString* bty(Char[][] a);  // RVA: 0x65D630
    static Il2CppString* vzd(Il2CppString* a);  // RVA: 0x65DEF0
    static Il2CppString* feh(Char[][] a);  // RVA: 0x65D880
};

// Namespace: <global>
class daq
{
public:
    // Static fields
    // static int32_t bmnj;
    // static uint8_t bmnk;
    // static uint8_t bmnl;
    // static uint8_t bmnm;
    // static uint8_t bmnn;
    // static uint8_t bmno;


    // Methods
    static void vzf(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x65E5F0
    static void qu(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x65E580
    static void yy(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x65E7B0
    static void hif(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x65E2E0
    static void hwx(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x65E430
    static void jjs(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x65E4A0
    static void vzi(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x65E740
    static void vzg(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x65E660
    static void dwm(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x65E190
    static void kqc(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x65E510
    static void vzk(Stream* a, Stream* b, Byte[][] c, uint8_t d, uint8_t e);  // RVA: 0x417660
    static void vzh(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x65E6D0
    static void byw(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x65E120
    static void vzj(Stream* a, Stream* b, Byte[][] c, uint8_t d);  // RVA: 0x562180
    static void foa(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x65E270
    static void hqd(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x65E350
    static void exn(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x65E200
    static void hww(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x65E3C0
};

// Namespace: <global>
class dar
{
public:
    // Static fields
    // static int32_t bmnp;


    // Methods
    static bool cgc(double a, int32_t b);  // RVA: 0x65E900
    static bool vzr(uint64_t a, int32_t b);  // RVA: 0x65ED40
    static bool vzy(double a, int32_t b);  // RVA: 0x65E900
    static bool duz(uint32_t a, int32_t b);  // RVA: 0x65EAC0
    static int32_t khh(DateTime a);  // RVA: 0x65F940
    static bool jwy(DateTimeOffset a, int32_t b);  // RVA: 0x65F1B0
    static bool vzn(Decimal a, int32_t b);  // RVA: 0x65E880
    static int32_t ira(DateTimeOffset a);  // RVA: 0x65F490
    static bool vzp(int64_t a, int32_t b);  // RVA: 0x65F3E0
    static bool vzu(Vector2Int a, int32_t b);  // RVA: 0x65FF80
    static bool fdo(uint64_t a, int32_t b);  // RVA: 0x65ED40
    static int32_t wav(Il2CppString* a);  // RVA: 0x660E80
    static int32_t hgx(Vector3Int a);  // RVA: 0x65F210
    static int32_t dmb(uint64_t a);  // RVA: 0x65EA20
    static int32_t cwe(Vector2Int a);  // RVA: 0x65E930
    static int32_t kvs(Vector2Int a);  // RVA: 0x65E930
    static int32_t wan(float a);  // RVA: 0x65E8B0
    static int32_t wai(DateTimeOffset a);  // RVA: 0x660750
    static int32_t wad(BigInteger a);  // RVA: 0x660140
    static int32_t wae(bool a);  // RVA: 0x660430
    static int32_t wah(DateTime a);  // RVA: 0x660660
    static int32_t wap(Quaternion a);  // RVA: 0x660BF0
    static bool nsl(uint32_t a, int32_t b);  // RVA: 0x65EAC0
    static int32_t dgi(uint64_t a);  // RVA: 0x65E9D0
    static bool waa(DateTimeOffset a, int32_t b);  // RVA: 0x65F1B0
    static bool eqw(Decimal a, int32_t b);  // RVA: 0x65E880
    static int32_t wal(uint32_t a);  // RVA: 0x660610
    static int32_t el(DateTime a);  // RVA: 0x65EB20
    static int32_t ojc(DateTimeOffset a);  // RVA: 0x65FDD0
    static bool dsn(int32_t a, int32_t b);  // RVA: 0x65EAC0
    static int32_t ff(Vector2 a);  // RVA: 0x65F0E0
    static bool hqw(Quaternion a, int32_t b);  // RVA: 0x65F310
    static bool jqb(uint64_t a, int32_t b);  // RVA: 0x65ED40
    static int32_t was(Vector3 a);  // RVA: 0x65F570
    static bool iqh(int64_t a, int32_t b);  // RVA: 0x65F3E0
    static bool vzm(bool a, int32_t b);  // RVA: 0x65FEB0
    static int32_t mpv(DateTimeOffset a);  // RVA: 0x65FBF0
    static bool oal(uint32_t a, int32_t b);  // RVA: 0x65EAC0
    static bool mpf(Vector3Int a, int32_t b);  // RVA: 0x65F180
    static bool gne(float a, int32_t b);  // RVA: 0x65E820
    static int32_t icv(uint64_t a);  // RVA: 0x65E9D0
    static int32_t wao(double a);  // RVA: 0x660BD0
    static bool hyh(uint32_t a, int32_t b);  // RVA: 0x65EAC0
    static int32_t lbq(bool a);  // RVA: 0x65FB40
    static bool kep(Char[][] a, int32_t b);  // RVA: 0x65F8E0
    static int32_t waj(Guid a);  // RVA: 0x660830
    static int32_t waf(Decimal a);  // RVA: 0x660440
    static int32_t kbx(Vector2 a);  // RVA: 0x65F0E0
    static bool vzx(float a, int32_t b);  // RVA: 0x65E820
    static int32_t wat(Vector3Int a);  // RVA: 0x660D30
    static int32_t war(Vector2Int a);  // RVA: 0x65E930
    static bool vzv(Vector3 a, int32_t b);  // RVA: 0x660030
    static int32_t wag(int32_t a);  // RVA: 0x660610
    static bool fko(Vector3Int a, int32_t b);  // RVA: 0x65F180
    static bool vzl(BigInteger a, int32_t b);  // RVA: 0x65F1E0
    static bool vzq(uint32_t a, int32_t b);  // RVA: 0x65EAC0
    static bool bdv(Decimal a, int32_t b);  // RVA: 0x65E880
    static bool lbc(Decimal a, int32_t b);  // RVA: 0x65E880
    static bool crx(double a, int32_t b);  // RVA: 0x65E900
    static bool dzp(double a, int32_t b);  // RVA: 0x65E900
    static int32_t le(uint64_t a);  // RVA: 0x65FB50
    static bool odl(Guid a, int32_t b);  // RVA: 0x65FB10
    static int32_t jsg(Guid a);  // RVA: 0x65F660
    static bool lhq(Quaternion a, int32_t b);  // RVA: 0x65F310
    static bool kqo(DateTimeOffset a, int32_t b);  // RVA: 0x65F1B0
    static bool fnb(DateTimeOffset a, int32_t b);  // RVA: 0x65F1B0
    static int32_t wam(uint64_t a);  // RVA: 0x660B30
    static bool vzw(Vector3Int a, int32_t b);  // RVA: 0x65F180
    static bool vzt(Vector2 a, int32_t b);  // RVA: 0x65FED0
    static bool vzz(Char[][] a, int32_t b);  // RVA: 0x65F8E0
    static int32_t egj(bool a);  // RVA: 0x65EB10
    static int32_t eyu(Decimal a);  // RVA: 0x65EC10
    static int32_t mul(Vector3 a);  // RVA: 0x65F570
    static int32_t wak(int64_t a);  // RVA: 0x660A90
    static bool jza(int64_t a, int32_t b);  // RVA: 0x65F3E0
    static bool vzo(int32_t a, int32_t b);  // RVA: 0x65EAC0
    static int32_t wau(Char[][] a);  // RVA: 0x660E30
    static bool vzs(Quaternion a, int32_t b);  // RVA: 0x65F310
    static int32_t jnz(Vector3 a);  // RVA: 0x65F570
    static int32_t hux(int64_t a);  // RVA: 0x65F340
    static bool jfq(Decimal a, int32_t b);  // RVA: 0x65E880
    static int32_t fed(BigInteger a);  // RVA: 0x65EDF0
    static bool hbd(DateTimeOffset a, int32_t b);  // RVA: 0x65F1B0
    static bool po(float a, int32_t b);  // RVA: 0x65E820
    static int32_t bn(float a);  // RVA: 0x65E8B0
    static bool wab(Guid a, int32_t b);  // RVA: 0x65FB10
    static int32_t wac(a a);  // RVA: 0x562180
    static bool gdi(BigInteger a, int32_t b);  // RVA: 0x65F1E0
    static int32_t waq(Vector2 a);  // RVA: 0x65F0E0
    static bool bdh(float a, int32_t b);  // RVA: 0x65E820
    static int32_t cmr(float a);  // RVA: 0x65E8B0
    static int32_t ity(Vector3 a);  // RVA: 0x65F570
    static int32_t khp(DateTimeOffset a);  // RVA: 0x65FA30
    static int32_t ohu(float a);  // RVA: 0x65E8B0
    static bool kpp(Guid a, int32_t b);  // RVA: 0x65FB10
    static int32_t nei(Vector3Int a);  // RVA: 0x65FCD0
};

// Namespace: <global>
class das : public CertificateHandler
{
public:

    // Methods
    bool ValidateCertificate(Byte[][] certificateData);  // RVA: 0x660F00
    void .ctor();  // RVA: 0x660F10
};

// Namespace: <global>
class dat
{
public:

    // Methods
    static bool waw(float a, float b, float c);  // RVA: 0x661100
    static bool wax(double a, double b, double c);  // RVA: 0x6611B0
    static bool fuk(float a, float b, float c);  // RVA: 0x661050
    static bool ezz(double a, double b, double c);  // RVA: 0x660F20
};

// Namespace: <global>
class dau
{
public:

    // Methods
    static void way(System.IProgress<CodeStage.AntiCheat.Genuine.CodeHash.FilesProgress> a, int32_t b, int32_t c, int64_t d, Il2CppString* e);  // RVA: 0x6612E0
};

// Namespace: <global>
class dav
{
public:

    // Methods
    static wchar_t mkq();  // RVA: 0x661B50
    static Il2CppString* iwo(int32_t a);  // RVA: 0x661980
    static int8_t wbb();  // RVA: 0x661E00
    static uint8_t wba();  // RVA: 0x661DB0
    static uint32_t gpe();  // RVA: 0x6617F0
    static uint8_t mjy();  // RVA: 0x661B00
    static uint64_t hsc();  // RVA: 0x661840
    static uint64_t jyf();  // RVA: 0x661840
    static int16_t bds();  // RVA: 0x6614A0
    static uint32_t wbg();  // RVA: 0x6617F0
    static int32_t wbf();  // RVA: 0x6617F0
    static int64_t eig();  // RVA: 0x661670
    static uint8_t orb();  // RVA: 0x661C80
    static uint8_t dfw();  // RVA: 0x661540
    static Il2CppString* hzi(int32_t a);  // RVA: 0x6618A0
    static Il2CppString* waz(int32_t a);  // RVA: 0x661CD0
    static uint64_t ia();  // RVA: 0x661840
    static int16_t fnw();  // RVA: 0x6617A0
    static uint8_t ncy();  // RVA: 0x661BA0
    static wchar_t wbc();  // RVA: 0x661E50
    static wchar_t jmf();  // RVA: 0x661A60
    static void edr(Char[][] a);  // RVA: 0x6615E0
    static int32_t ezb();  // RVA: 0x6616C0
    static int16_t dnz();  // RVA: 0x661590
    static void fgo(Char[][] a);  // RVA: 0x661710
    static uint64_t wbi();  // RVA: 0x661840
    static int16_t cdb();  // RVA: 0x6614F0
    static wchar_t lrt();  // RVA: 0x661AB0
    static uint32_t ly();  // RVA: 0x6617F0
    static int16_t wbd();  // RVA: 0x661EA0
    static void wbj(Char[][] a);  // RVA: 0x661F40
    static int64_t wbh();  // RVA: 0x661840
    static uint16_t wbe();  // RVA: 0x661EF0
    static void bcw(Char[][] a);  // RVA: 0x661410
    static void njt(Char[][] a);  // RVA: 0x661BF0
    static uint64_t mmc();  // RVA: 0x661840
};

// Namespace: <global>
class daw
{
public:
    // Static fields
    // static Char[][] bmnq;


    // Methods
    static Byte[][] wbl(Il2CppString* a);  // RVA: 0x6621E0
    static Il2CppString* msr(Byte[][] a);  // RVA: 0x662650
    static Byte[][] lyd(Char[][] a);  // RVA: 0x662230
    static Char[][] gsg(Byte[][] a);  // RVA: 0x662310
    static Byte[][] cqc(Char[][] a);  // RVA: 0x662230
    static Il2CppString* ljs(Byte[][] a);  // RVA: 0x6622D0
    static Il2CppString* nok(Byte[][] a, int32_t b, int32_t c);  // RVA: 0x662270
    static Byte[][] cpz(Il2CppString* a);  // RVA: 0x6621E0
    static Il2CppString* idz(Byte[][] a);  // RVA: 0x662350
    static Char[][] hvp(Byte[][] a);  // RVA: 0x662310
    static Byte[][] ekj(Char[][] a);  // RVA: 0x662230
    static Byte[][] wbk(Char[][] a);  // RVA: 0x662230
    static Il2CppString* fkf(Byte[][] a);  // RVA: 0x6622D0
    static void .cctor();  // RVA: 0x661FD0
    static Il2CppString* mmt(Byte[][] a);  // RVA: 0x6624D0
    static Il2CppString* jxz(Byte[][] a);  // RVA: 0x6622D0
    static Il2CppString* wbp(Byte[][] a);  // RVA: 0x6627D0
    static Il2CppString* iql(Byte[][] a, int32_t b, int32_t c);  // RVA: 0x662270
    static Il2CppString* wbn(Byte[][] a);  // RVA: 0x6622D0
    static Char[][] kdl(Byte[][] a);  // RVA: 0x662310
    static Il2CppString* chq(Byte[][] a);  // RVA: 0x662060
    static Il2CppString* eoy(Byte[][] a, int32_t b, int32_t c);  // RVA: 0x662270
    static Il2CppString* wbo(Byte[][] a, int32_t b, int32_t c);  // RVA: 0x662270
    static Byte[][] dcw(Char[][] a);  // RVA: 0x662230
    static Char[][] hjs(Byte[][] a);  // RVA: 0x662310
    static Char[][] wbm(Byte[][] a);  // RVA: 0x662310
};

// Namespace: <global>
class dax`1
{
public:
    System.Collections.Concurrent.ConcurrentBag<a> bmnr; // 0x0000
    System.Func<a> bmns; // 0x0000

    // Methods
    void .ctor(System.Func<a> a);  // RVA: 0x417510
    a wbq();  // RVA: 0x562180
    void gca();  // RVA: 0x42D760
    void hrt();  // RVA: 0x42D760
    void wbr(a a);  // RVA: 0x562180
    void boj();  // RVA: 0x42D760
    void wbs();  // RVA: 0x42D760
    void ehn();  // RVA: 0x42D760
};

// Namespace: <global>
class day
{
public:
    // Static fields
    // static Random* bmnt;
    // static Random* bmnu;


    // Methods
    static int64_t wbu(int64_t a, int64_t b);  // RVA: 0x664190
    static int64_t cnk(int64_t a, int64_t b);  // RVA: 0x662E60
    static void .cctor();  // RVA: 0x662950
    static void wbw(Char[][] a);  // RVA: 0x664690
    static int64_t cia(int64_t a, int64_t b);  // RVA: 0x6629D0
    static int32_t wbt(int32_t a, int32_t b);  // RVA: 0x663F70
    static int64_t wbx(Random* a, int64_t b, int64_t c);  // RVA: 0x6649A0
    static int32_t njx(int32_t a, int32_t b);  // RVA: 0x663CE0
    static void kfl(Random* a, Char[][] b);  // RVA: 0x6635F0
    static void deo(Byte[][] a);  // RVA: 0x6630D0
    static void wby(Random* a, Char[][] b);  // RVA: 0x664A20
    static int64_t nrs(Random* a, int64_t b, int64_t c);  // RVA: 0x663F00
    static int32_t kcj(int32_t a, int32_t b);  // RVA: 0x6633D0
    static void mfs(Random* a, Char[][] b);  // RVA: 0x663C40
    static void lbu(Char[][] a);  // RVA: 0x663710
    static int64_t kzv(Random* a, int64_t b, int64_t c);  // RVA: 0x663690
    static void wbv(Byte[][] a);  // RVA: 0x664400
    static int64_t eiu(Random* a, int64_t b, int64_t c);  // RVA: 0x663360
    static int32_t cnc(int32_t a, int32_t b);  // RVA: 0x662C40
    static int32_t mah(int32_t a, int32_t b);  // RVA: 0x663A20
};

// Namespace: <global>
class daz
{
public:
    // Static fields
    // static int64_t bmnv;


    // Methods
    static int64_t wbz();  // RVA: 0x664C90
    static int64_t mgt();  // RVA: 0x664BB0
    static int64_t ogx();  // RVA: 0x664C30
    static double wca();  // RVA: 0x664CF0
    static int64_t wcc();  // RVA: 0x664D80
    static int64_t nvr();  // RVA: 0x664BD0
    static int64_t wcd();  // RVA: 0x664DA0
    static int64_t jol();  // RVA: 0x664AF0
    static int64_t krx();  // RVA: 0x664B50
    static int64_t bwo();  // RVA: 0x664AB0
    static int64_t wcb();  // RVA: 0x664D60
    static int64_t fpr();  // RVA: 0x664AD0
};

// Namespace: <global>
class dba
{
public:
    // Static fields
    // static uint32_t bmnw;
    // static uint32_t bmnx;
    // static uint32_t bmny;
    // static uint32_t bmnz;
    // static uint32_t bmoa;


    // Methods
    static uint32_t otn(Stream* a, int64_t b, uint32_t c);  // RVA: 0x6656F0
    static uint32_t gnv(Byte[][] a, int32_t b, uint32_t c);  // RVA: 0x664DC0
    static uint32_t lvh(Byte[][] a, int32_t b, uint32_t c);  // RVA: 0x6652A0
    static uint32_t mvs(Byte[][] a, int32_t b, uint32_t c);  // RVA: 0x665500
    static uint32_t wce(Byte[][] a, int32_t b, uint32_t c);  // RVA: 0x6659E0
    static uint32_t htp(Byte[][] a, int32_t b, uint32_t c);  // RVA: 0x665000
    static uint32_t wcf(Stream* a, int64_t b, uint32_t c);  // RVA: 0x665E10
};

// Namespace: <global>
class dbb : public dcx`1
{
public:
    // Static fields
    // static bool bmob;
    // static bool bmoc;
    // static float bmod;
    // static float bmoe;
    // static float bmof;
    // static float bmog;
    // static float bmoh;
    // static float bmoi;
    // static bool bmoj;

    uint8_t pad_0000[0x30]; // 0x0000
    int64_t bmok; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    int64_t bmol; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    int64_t bmom; // 0x0040

    // Methods
    void .ctor();  // RVA: 0x666330
    static float wcm();  // RVA: 0x667870
    void fex();  // RVA: 0x666540
    void imj();  // RVA: 0x666D10
    static void mzk();  // RVA: 0x667120
    static float wck();  // RVA: 0x6676F0
    static float wcn();  // RVA: 0x667930
    static float wci();  // RVA: 0x667570
    void iw();  // RVA: 0x666DE0
    void wcs();  // RVA: 0x667CF0
    static void wcp(float a);  // RVA: 0x667A00
    static void oip();  // RVA: 0x667260
    static void wcg();  // RVA: 0x6672D0
    bool wcq();  // RVA: 0x667A10
    static float wco();  // RVA: 0x6679F0
    void hrb();  // RVA: 0x666A20
    static void fwb();  // RVA: 0x666650
    void Update();  // RVA: 0x666270
    static float wcl();  // RVA: 0x6677B0
    void wcu(Scene a, LoadSceneMode b);  // RVA: 0x667EA0
    void chw();  // RVA: 0x666480
    static void kpi();  // RVA: 0x666EF0
    static float wcj();  // RVA: 0x667630
    void wcr();  // RVA: 0x667C20
    static void iaf();  // RVA: 0x666AE0
    void fwh();  // RVA: 0x666880
    void wct();  // RVA: 0x667E00
    void ngl();  // RVA: 0x667190
    static void wch();  // RVA: 0x667340
    void hjp();  // RVA: 0x666950
    void bvx();  // RVA: 0x666370
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct StorageDataType
    {
    public:
        // Static fields
        // static StorageDataType Unknown;
        // static StorageDataType SByte;
        // static StorageDataType Byte;
        // static StorageDataType Int16;
        // static StorageDataType UInt16;
        // static StorageDataType Int32;
        // static StorageDataType UInt32;
        // static StorageDataType Int64;
        // static StorageDataType UInt64;
        // static StorageDataType Char;
        // static StorageDataType Single;
        // static StorageDataType Double;
        // static StorageDataType Decimal;
        // static StorageDataType BigInteger;
        // static StorageDataType Boolean;
        // static StorageDataType String;
        // static StorageDataType DateTime;
        // static StorageDataType ByteArray;
        // static StorageDataType Vector2;
        // static StorageDataType Vector2Int;
        // static StorageDataType Vector3;
        // static StorageDataType Vector3Int;
        // static StorageDataType Vector4;
        // static StorageDataType Quaternion;
        // static StorageDataType Color;
        // static StorageDataType Color32;
        // static StorageDataType Rect;
        // static StorageDataType RectInt;
        // static StorageDataType RangeInt;
        // static StorageDataType Matrix4x4;
        // static StorageDataType Ray;
        // static StorageDataType Ray2D;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredPrefsData
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        StorageDataType type; // 0x0010
        uint8_t pad_0011[0x7]; // 0x0011
        Byte[][] data; // 0x0018
    
        // Methods
        void .ctor(StorageDataType type, Byte[][] data);  // RVA: 0x65C960
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbc
{
public:

    // Methods
    static Color32 wcv(Byte[][] a);  // RVA: 0x667F90
    static c wcy(Byte[][] a);  // RVA: 0x562180
    static d wcz(StorageDataType a, Byte[][] b);  // RVA: 0x562180
    static f wdb(StorageDataType a, Byte[][] b);  // RVA: 0x562180
    static Color32 hyq(Byte[][] a);  // RVA: 0x667F20
    static b wcx(ObscuredPrefsData a);  // RVA: 0x562180
    static Color32 cxx(Byte[][] a);  // RVA: 0x667F20
    static ObscuredPrefsData wcw(a a);  // RVA: 0x562180
    static T wdd(Byte[][] a);  // RVA: 0x562180
    static Color32 lze(Byte[][] a);  // RVA: 0x667F50
    static Byte[][] wdc(T a);  // RVA: 0x562180
    static Byte[][] wda(StorageDataType a, e b);  // RVA: 0x562180
    static Color32 drq(Byte[][] a);  // RVA: 0x667F20
};

// Namespace: <global>
class dbd
{
public:
    // Static fields
    // static Type* bmon;
    // static Type* bmoo;
    // static Type* bmop;
    // static Type* bmoq;
    // static Type* bmor;
    // static Type* bmos;
    // static Type* bmot;
    // static Type* bmou;
    // static Type* bmov;
    // static Type* bmow;
    // static Type* bmox;
    // static Type* bmoy;
    // static Type* bmoz;
    // static Type* bmpa;
    // static Type* bmpb;
    // static Type* bmpc;
    // static Type* bmpd;
    // static Type* bmpe;
    // static Type* bmpf;
    // static Type* bmpg;
    // static Type* bmph;
    // static Type* bmpi;
    // static Type* bmpj;
    // static Type* bmpk;
    // static Type* bmpl;
    // static Type* bmpm;
    // static Type* bmpn;
    // static Type* bmpo;
    // static Type* bmpp;
    // static Type* bmpq;
    // static Type* bmpr;


    // Methods
    static StorageDataType wde();  // RVA: 0x420240
    static void .cctor();  // RVA: 0x667FD0
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    class UnsupportedDataTypeException : public Exception
    {
    public:
    
        // Methods
        void .ctor(Type* type);  // RVA: 0x65C9E0
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class HashCheckSumModifierDelegate : public MulticastDelegate
{
public:

    // Methods
    void .ctor(Il2CppObject* object, intptr_t method);  // RVA: 0x65BE10
    Byte[][] Invoke(Il2CppString* input);  // RVA: 0x65BCB0
    IAsyncResult* BeginInvoke(Il2CppString* input, AsyncCallback* callback, Il2CppObject* object);  // RVA: 0x65BDE0
    Byte[][] EndInvoke(IAsyncResult* result);  // RVA: 0x65BCA0
};

// Namespace: <global>
class dbe
{
public:
    // Static fields
    // static Il2CppString* bmps;

    uint8_t pad_0000[0x10]; // 0x0000
    uint32_t bmpt; // 0x0010
    uint8_t pad_0011[0x3]; // 0x0011
    uint32_t bmpu; // 0x0014
    uint8_t pad_0015[0x3]; // 0x0015
    HashCheckSumModifierDelegate* bmpv; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bool <bmpw>k__BackingField; // 0x0020

    // Methods
    void kbd();  // RVA: 0x668AB0
    static void wdg(Il2CppString* a);  // RVA: 0x669030
    void .ctor(uint32_t a);  // RVA: 0x668880
    void eud();  // RVA: 0x668AB0
    void wdn(bool a);  // RVA: 0x668D40
    bool wdj();  // RVA: 0x65C5B0
    static void bzz();  // RVA: 0x6688B0
    static void nxq();  // RVA: 0x668D50
    void wdo();  // RVA: 0x668AB0
    void ljn(bool a);  // RVA: 0x668D40
    uint32_t oex(Il2CppString* a);  // RVA: 0x668E50
    static void wdh();  // RVA: 0x669090
    static Il2CppString* jxr();  // RVA: 0x668D00
    uint32_t wdl();  // RVA: 0x6691A0
    void ndb();  // RVA: 0x668AB0
    static void dts();  // RVA: 0x6689B0
    static Il2CppString* wdi();  // RVA: 0x668D00
    void gab(HashCheckSumModifierDelegate* a);  // RVA: 0x668BF0
    static Il2CppString* jea();  // RVA: 0x668D00
    uint32_t fe(Il2CppString* a);  // RVA: 0x668AC0
    void hpa(HashCheckSumModifierDelegate* a);  // RVA: 0x668BF0
    uint32_t wdp(Il2CppString* a);  // RVA: 0x6692F0
    void wdk(bool a);  // RVA: 0x669190
    static void hwd();  // RVA: 0x668C00
    static Il2CppString* wdf();  // RVA: 0x668F80
    static Il2CppString* ink();  // RVA: 0x668D00
    void wdm(HashCheckSumModifierDelegate* a);  // RVA: 0x668BF0
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct DeviceLockLevel
    {
    public:
        // Static fields
        // static DeviceLockLevel None;
        // static DeviceLockLevel Soft;
        // static DeviceLockLevel Strict;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbf
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    DeviceLockLevel <bmpx>k__BackingField; // 0x0010
    DeviceLockTamperingSensitivity <bmpy>k__BackingField; // 0x0011

    // Methods
    DeviceLockLevel wdq();  // RVA: 0x65C890
    void wdr(DeviceLockLevel a);  // RVA: 0x669460
    DeviceLockTamperingSensitivity wds();  // RVA: 0x669470
    void wdt(DeviceLockTamperingSensitivity a);  // RVA: 0x669480
    void .ctor(DeviceLockLevel a, DeviceLockTamperingSensitivity b);  // RVA: 0x669420
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct DeviceLockTamperingSensitivity
    {
    public:
        // Static fields
        // static DeviceLockTamperingSensitivity Disabled;
        // static DeviceLockTamperingSensitivity Low;
        // static DeviceLockTamperingSensitivity Normal;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

    // Namespace: CodeStage.AntiCheat.Storage
    class DeviceUniqueIdentifierException : public BackgroundThreadAccessException
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x65BD70
    };

    // Namespace: CodeStage.AntiCheat.Storage
    class PersistentDataPathException : public BackgroundThreadAccessException
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x65C980
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbg
{
public:
    // Static fields
    // static Il2CppString* bmpz;
    // static Il2CppString* bmqa;
    // static dbe* bmqb;

    uint8_t pad_0000[0x10]; // 0x0000
    Action* bmqc; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Action* bmqd; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    dbq* <bmqe>k__BackingField; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Il2CppString* <bmqf>k__BackingField; // 0x0028

    // Methods
    void wdu(Action* a);  // RVA: 0x66ABE0
    void wdv(Action* a);  // RVA: 0x66AC80
    bool wdz();  // RVA: 0x66AE60
    ObscuredFileReadResult wef();  // RVA: 0x66AF40
    void wec();  // RVA: 0x66AF10
    void .ctor(Il2CppString* a);  // RVA: 0x669610
    ObscuredFileReadResult ckj();  // RVA: 0x669770
    static void web(Il2CppString* a);  // RVA: 0x66AE80
    void doi(Stream* a, DeviceLockLevel b);  // RVA: 0x6697B0
    ObscuredFileHeader weg(Stream* a);  // RVA: 0x66BBB0
    ObscuredFileReadResult kmk();  // RVA: 0x669BF0
    static void .cctor();  // RVA: 0x669490
    void wei(Stream* a);  // RVA: 0x66C180
    ObscuredFileReadResult jhd();  // RVA: 0x669770
    void jpr(Stream* a, DeviceLockLevel b);  // RVA: 0x6698E0
    ObscuredFileWriteResult ohh(Byte[][] a);  // RVA: 0x6698B0
    void .ctor(Il2CppString* a, dbq* b);  // RVA: 0x669510
    Il2CppString* ub(Il2CppString* a);  // RVA: 0x66A960
    void obt(Stream* a, DeviceLockLevel b);  // RVA: 0x66A8D0
    ObscuredFileWriteResult nfw(Byte[][] a);  // RVA: 0x6698B0
    ObscuredFileWriteResult huy(Byte[][] a);  // RVA: 0x6698B0
    ObscuredFileWriteResult kjl(Byte[][] a);  // RVA: 0x6698B0
    Il2CppString* wek(Il2CppString* a);  // RVA: 0x66C280
    void .ctor();  // RVA: 0x6696B0
    Il2CppString* wea();  // RVA: 0x66AE70
    void wdx(Action* a);  // RVA: 0x66ADC0
    void wej(Stream* a, DeviceLockLevel b);  // RVA: 0x66C1F0
    ObscuredFileWriteResult wed(Byte[][] a);  // RVA: 0x6698B0
    void fmx(Stream* a);  // RVA: 0x669840
    ObscuredFileWriteResult weh(Byte[][] a);  // RVA: 0x66BC10
    ObscuredFileReadResult wee();  // RVA: 0x669770
    void nhx(Stream* a);  // RVA: 0x66A860
    void wdw(Action* a);  // RVA: 0x66AD20
    ObscuredFileReadResult mkx();  // RVA: 0x669770
    void .ctor(dbr* a);  // RVA: 0x669570
    Il2CppString* ked(Il2CppString* a);  // RVA: 0x669970
    dbq* wdy();  // RVA: 0x638FA0
};

// Namespace: <global>
class dbh
{
public:
    // Static fields
    // static int32_t bmqg;
    // static int32_t bmqh;
    // static Byte[][] bmqi;


    // Methods
    static void hg(Stream* a, Stream* b, dbp* c);  // RVA: 0x66C790
    static void wem(Stream* a, Stream* b, dbp* c);  // RVA: 0x66CA80
    static void wer(Stream* a, Stream* b, dbp* c);  // RVA: 0x66C6E0
    static uint32_t wes(Byte[][] a);  // RVA: 0x66CD00
    static void icg(Stream* a, Stream* b, dbp* c);  // RVA: 0x66C890
    static void hc(Stream* a, Stream* b, dbp* c);  // RVA: 0x66C6E0
    static void wel(Stream* a, Stream* b, dbp* c);  // RVA: 0x66C6E0
    static uint32_t itt(Stream* a);  // RVA: 0x66CA40
    static void wet(Stream* a, Stream* b, dbp* c);  // RVA: 0x66CD20
    static void haj(Stream* a, Stream* b, dbp* c);  // RVA: 0x66C6E0
    static void kif(Stream* a, Stream* b, dbp* c);  // RVA: 0x66CA80
    static void cqa(Stream* a, uint32_t b);  // RVA: 0x66C580
    static uint32_t cpf(Stream* a);  // RVA: 0x66C540
    static uint32_t nzw(Stream* a);  // RVA: 0x66C6A0
    static uint32_t wen(Stream* a);  // RVA: 0x66C6A0
    static uint32_t weq(Stream* a);  // RVA: 0x66C6A0
    static void kys(Stream* a, Stream* b, dbp* c);  // RVA: 0x66CA90
    static uint32_t cib(Stream* a);  // RVA: 0x66C500
    static uint32_t weo(Stream* a);  // RVA: 0x66CB90
    static void wep(Stream* a, uint32_t b);  // RVA: 0x66CC20
    static void ihd(Stream* a, Stream* b, dbp* c);  // RVA: 0x66C990
    static uint32_t fyx(Stream* a);  // RVA: 0x66C660
    static uint32_t idt(Stream* a);  // RVA: 0x66C6A0
    static uint32_t gqt(Stream* a);  // RVA: 0x66C6A0
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileHeader
    {
    public:
        // Static fields
        // static uint8_t HeaderByte1;
        // static uint8_t HeaderByte2;
        // static uint8_t HeaderByte3;
        // static uint8_t HeaderByte4;
        // static uint8_t HeaderVersion;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t <Byte1>k__BackingField; // 0x0010
        uint8_t <Byte2>k__BackingField; // 0x0011
        uint8_t <Byte3>k__BackingField; // 0x0012
        uint8_t <Byte4>k__BackingField; // 0x0013
        uint8_t <Version>k__BackingField; // 0x0014
        ObscurationMode <ObscurationMode>k__BackingField; // 0x0015
    
        // Methods
        uint8_t get_Byte1();  // RVA: 0x65BFE0
        void set_Byte1(uint8_t value);  // RVA: 0x65C080
        uint8_t get_Byte2();  // RVA: 0x65C030
        void set_Byte2(uint8_t value);  // RVA: 0x65C090
        uint8_t get_Byte3();  // RVA: 0x65C040
        void set_Byte3(uint8_t value);  // RVA: 0x65C0A0
        uint8_t get_Byte4();  // RVA: 0x65C050
        void set_Byte4(uint8_t value);  // RVA: 0x65C0B0
        uint8_t get_Version();  // RVA: 0x65C070
        void set_Version(uint8_t value);  // RVA: 0x65C0D0
        ObscurationMode get_ObscurationMode();  // RVA: 0x65C060
        void set_ObscurationMode(ObscurationMode value);  // RVA: 0x65C0C0
        bool IsValid();  // RVA: 0x65C000
        void weu(Stream* a);  // RVA: 0x65C0E0
        static void wev(Stream* a, ObscurationMode b);  // RVA: 0x65C1A0
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileErrorCode
    {
    public:
        // Static fields
        // static ObscuredFileErrorCode NoError;
        // static ObscuredFileErrorCode FileNotFound;
        // static ObscuredFileErrorCode FileDamaged;
        // static ObscuredFileErrorCode DataIsNotLocked;
        // static ObscuredFileErrorCode NotInitialized;
        // static ObscuredFileErrorCode OtherException;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileError
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        ObscuredFileErrorCode <ErrorCode>k__BackingField; // 0x0010
        uint8_t pad_0011[0x7]; // 0x0011
        Exception* <Exception>k__BackingField; // 0x0018
    
        // Methods
        ObscuredFileErrorCode get_ErrorCode();  // RVA: 0x65BFE0
        Exception* get_Exception();  // RVA: 0x65BFF0
        void .ctor(ObscuredFileErrorCode code);  // RVA: 0x65BFC0
        void .ctor(Exception* exception);  // RVA: 0x65BFB0
        Il2CppString* ToString();  // RVA: 0x65BED0
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileReadResult
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        Byte[][] <Data>k__BackingField; // 0x0010
        uint8_t pad_0011[0x7]; // 0x0011
        bool <DataIsNotGenuine>k__BackingField; // 0x0018
        bool <DataFromAnotherDevice>k__BackingField; // 0x0019
        uint8_t pad_001A[0x6]; // 0x001A
        ObscuredFileError <Error>k__BackingField; // 0x0020
        uint8_t pad_0021[0xF]; // 0x0021
        bool <IsValid>k__BackingField; // 0x0030
    
        // Methods
        bool wew();  // RVA: 0x65C5C0
        Byte[][] get_Data();  // RVA: 0x65C590
        bool wex();  // RVA: 0x65C5F0
        bool get_DataIsNotGenuine();  // RVA: 0x65C580
        bool get_DataFromAnotherDevice();  // RVA: 0x65C570
        ObscuredFileError get_Error();  // RVA: 0x65C5A0
        bool get_IsValid();  // RVA: 0x65C5B0
        void .ctor(Byte[][] data, bool dataIsNotGenuine, bool dataFromAnotherDevice);  // RVA: 0x65C520
        void .ctor(ObscuredFileError error);  // RVA: 0x65C4D0
        static ObscuredFileReadResult wey(Exception* a);  // RVA: 0x65C600
        static ObscuredFileReadResult wez(ObscuredFileErrorCode a);  // RVA: 0x65C680
        Il2CppString* ToString();  // RVA: 0x65C260
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileWriteResult
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        ObscuredFileError <Error>k__BackingField; // 0x0010
        uint8_t pad_0011[0xF]; // 0x0011
        bool <IsValid>k__BackingField; // 0x0020
    
        // Methods
        bool wfa();  // RVA: 0x65C8A0
        ObscuredFileError get_Error();  // RVA: 0x65C880
        bool get_IsValid();  // RVA: 0x65C890
        void .ctor(ObscuredFileErrorCode result);  // RVA: 0x65C830
        void .ctor(ObscuredFileError error);  // RVA: 0x65C800
        static ObscuredFileWriteResult wfb(Exception* a);  // RVA: 0x65C8B0
        static ObscuredFileWriteResult wfc(ObscuredFileErrorCode a);  // RVA: 0x65C900
        Il2CppString* ToString();  // RVA: 0x65C700
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbi
{
public:
    // Static fields
    // static Il2CppString* bmqj;
    // static Il2CppString* bmqk;
    // static Action* bmql;
    // static Action* bmqm;
    // static dbg* bmqn;
    // static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> bmqo;
    // static Il2CppObject* bmqp;
    // static bool <bmqq>k__BackingField;
    // static bool <bmqr>k__BackingField;
    // static bool <bmqs>k__BackingField;
    // static ObscuredFileReadResult <bmqt>k__BackingField;
    // static ObscuredFileWriteResult <bmqu>k__BackingField;
    // static dbl* <bmqv>k__BackingField;


    // Methods
    static ObscuredDouble lym(Il2CppString* a, ObscuredDouble b);  // RVA: 0x672B50
    static void wfe(Il2CppString* a, ObscuredByte b);  // RVA: 0x6751A0
    static ObscuredBool jgn(Il2CppString* a, ObscuredBool b);  // RVA: 0x671C10
    static ObscuredQuaternion jwy(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x6721A0
    static ObscuredLong iht(Il2CppString* a, ObscuredLong b);  // RVA: 0x6713B0
    static void wfz(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x675E10
    static void wfj(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x6754A0
    static void wft(Il2CppString* a, ObscuredUInt b);  // RVA: 0x675A90
    static dbg* wif(Il2CppString* a, dbq* b);  // RVA: 0x678A50
    static void jgt(Il2CppString* a, ObscuredGuid b);  // RVA: 0x671CD0
    static void lty(Il2CppString* a, ObscuredUInt b);  // RVA: 0x6729D0
    static ObscuredByte nyv(Il2CppString* a, ObscuredByte b);  // RVA: 0x6745F0
    static void wfq(Il2CppString* a, ObscuredSByte b);  // RVA: 0x675900
    static void gpd(Il2CppString* a, bool b);  // RVA: 0x670680
    static ObscuredGuid mua(Il2CppString* a, ObscuredGuid b);  // RVA: 0x6730B0
    static ObscuredByte wgb(Il2CppString* a, ObscuredByte b);  // RVA: 0x675F80
    static void lia(Il2CppString* a, ObscuredDouble b);  // RVA: 0x672740
    static void wfu(Il2CppString* a, ObscuredULong b);  // RVA: 0x675B10
    static ObscuredFileReadResult nct();  // RVA: 0x673420
    static void nhk();  // RVA: 0x6736B0
    static void wht(Il2CppString* a, bool b);  // RVA: 0x677CD0
    static ObscuredBool ba(Il2CppString* a, ObscuredBool b);  // RVA: 0x66D400
    static void diw(Il2CppString* a, ObscuredInt b);  // RVA: 0x66EB90
    static void okn(Il2CppString* a, ObscuredBool b);  // RVA: 0x674C10
    static void wfs(Il2CppString* a, ObscuredString* b);  // RVA: 0x675A10
    static ObscuredChar hfi(Il2CppString* a, ObscuredChar b);  // RVA: 0x670B90
    static ObscuredChar bth(Il2CppString* a, ObscuredChar b);  // RVA: 0x66DD00
    static void chr(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x66E3F0
    static ObscuredDouble jpd(Il2CppString* a, ObscuredDouble b);  // RVA: 0x672010
    static ObscuredBigInteger wgg(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x676370
    static void wfd(Il2CppString* a, ObscuredBool b);  // RVA: 0x675110
    static void bhp(Il2CppString* a, ObscuredLong b);  // RVA: 0x66D5F0
    static void ddq();  // RVA: 0x66E9E0
    static void wil(Il2CppString* a, d b);  // RVA: 0x562180
    static void wib(Il2CppString* a);  // RVA: 0x678770
    static void wfh(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x675340
    static ObscuredSByte wgn(Il2CppString* a, ObscuredSByte b);  // RVA: 0x676980
    static b wie(Il2CppString* a, b b);  // RVA: 0x562180
    static void dij(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x66EAE0
    static ObscuredFileReadResult hqm();  // RVA: 0x670FE0
    static ObscuredUShort coq(Il2CppString* a, ObscuredUShort b);  // RVA: 0x66E760
    static void lvf(Il2CppString* a, ObscuredString* b);  // RVA: 0x672A50
    static ObscuredQuaternion ok(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x674B10
    static void gbh(Il2CppString* a, ObscuredByte b);  // RVA: 0x670370
    static ObscuredBigInteger bna(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x66D820
    static ObscuredDouble wgh(Il2CppString* a, ObscuredDouble b);  // RVA: 0x676470
    static void wfl(Il2CppString* a, ObscuredFloat b);  // RVA: 0x6755F0
    static ObscuredFileWriteResult whn();  // RVA: 0x677950
    static ObscuredVector3 fja(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x66F970
    static void wha(Action* a);  // RVA: 0x6773E0
    static dbq* whb();  // RVA: 0x6774E0
    static void kio(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x6723E0
    static void mtp(Il2CppString* a, ObscuredGuid b);  // RVA: 0x673000
    static ObscuredVector2Int hbs(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x670A00
    static bool whf();  // RVA: 0x677640
    static ObscuredVector3Int esy(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x66F4C0
    static void whh(bool a);  // RVA: 0x6776F0
    static ObscuredUShort fxj(Il2CppString* a, ObscuredUShort b);  // RVA: 0x6701B0
    static void wfg(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x6752B0
    static void obl(Il2CppString* a, ObscuredFloat b);  // RVA: 0x674860
    static ObscuredShort cpa(Il2CppString* a, ObscuredShort b);  // RVA: 0x66E820
    static void mxu(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x6731B0
    static void efy(Il2CppString* a, ObscuredGuid b);  // RVA: 0x66F350
    static void who(ObscuredFileWriteResult a);  // RVA: 0x6779C0
    static dbl* whp();  // RVA: 0x677A40
    static void whq(dbl* a);  // RVA: 0x677A90
    static void byn(bool a);  // RVA: 0x66DF20
    static void wff(Il2CppString* a, ObscuredChar b);  // RVA: 0x675220
    static void whx();  // RVA: 0x678260
    static void oit(Il2CppString* a, ObscuredShort b);  // RVA: 0x674980
    static ObscuredDateTimeOffset wge(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x676180
    static ObscuredInt ibc(Il2CppString* a, ObscuredInt b);  // RVA: 0x671300
    static Il2CppString* whk();  // RVA: 0x677800
    static void ntv(bool a);  // RVA: 0x674380
    static bool whz(Il2CppString* a);  // RVA: 0x678670
    static void ffu(Il2CppString* a, ObscuredLong b);  // RVA: 0x66F840
    static ObscuredShort wgo(Il2CppString* a, ObscuredShort b);  // RVA: 0x676A00
    static void wic();  // RVA: 0x678860
    static bool whg();  // RVA: 0x6776A0
    static void wid(Il2CppString* a, a b);  // RVA: 0x562180
    static ObscuredFloat iy(Il2CppString* a, ObscuredFloat b);  // RVA: 0x671A60
    static ObscuredInt hjg(Il2CppString* a, ObscuredInt b);  // RVA: 0x670DE0
    static ObscuredChar ipn(Il2CppString* a, ObscuredChar b);  // RVA: 0x671820
    static void bts(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x66DDC0
    static void jdf(Il2CppString* a, ObscuredByte b);  // RVA: 0x671B90
    static bool lvo(Il2CppString* a);  // RVA: 0x672AD0
    static void cgq(Il2CppString* a, ObscuredDouble b);  // RVA: 0x66E350
    static void hjq(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x670E90
    static ObscuredDouble cb(Il2CppString* a, ObscuredDouble b);  // RVA: 0x66E000
    static void nhu(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x6739E0
    static bool blu(Il2CppString* a);  // RVA: 0x66D700
    static void fqr(Il2CppString* a, ObscuredUShort b);  // RVA: 0x66FEA0
    static ObscuredULong org(Il2CppString* a, ObscuredULong b);  // RVA: 0x674DD0
    static void fwn(Il2CppString* a, ObscuredByte b);  // RVA: 0x670130
    static c wik(Il2CppString* a, c b);  // RVA: 0x562180
    static void whu(dbq* a, bool b);  // RVA: 0x677D60
    static void mqc(Il2CppString* a, ObscuredBool b);  // RVA: 0x672E90
    static void nbk(Il2CppString* a, ObscuredChar b);  // RVA: 0x673260
    static bool whe();  // RVA: 0x6775E0
    static void whw();  // RVA: 0x6780A0
    static void baw(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x66D4C0
    static void gjq(Il2CppString* a, ObscuredUShort b);  // RVA: 0x6704B0
    static ObscuredDateTimeOffset nxm(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x674500
    static ObscuredGuid cnl(Il2CppString* a, ObscuredGuid b);  // RVA: 0x66E5E0
    static void btd(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x66DC50
    static ObscuredBool fvg(Il2CppString* a, ObscuredBool b);  // RVA: 0x670070
    static void whs(bool a);  // RVA: 0x677C10
    static void wfr(Il2CppString* a, ObscuredShort b);  // RVA: 0x675980
    static ObscuredUInt wgq(Il2CppString* a, ObscuredUInt b);  // RVA: 0x676B40
    static void cfh();  // RVA: 0x66E160
    static void fdh();  // RVA: 0x66F650
    static ObscuredVector2Int dwc(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x66F0B0
    static ObscuredQuaternion wgm(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x676880
    static void whv(Il2CppString* a, dbq* b, bool c);  // RVA: 0x677E00
    static ObscuredDecimal ixi(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x671960
    static void bmb(Il2CppString* a, ObscuredFloat b);  // RVA: 0x66D780
    static ObscuredVector3Int fmm(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x66FDA0
    static ObscuredFileWriteResult jnq();  // RVA: 0x671E20
    static ObscuredFloat nk(Il2CppString* a, ObscuredFloat b);  // RVA: 0x673C70
    static void dew(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x66EA50
    static ObscuredChar gsp(Il2CppString* a, ObscuredChar b);  // RVA: 0x670790
    static ObscuredVector2Int wgu(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x676E40
    static void mrw(bool a);  // RVA: 0x672F20
    static ObscuredFileReadResult nji();  // RVA: 0x673A90
    static ObscuredInt wgk(Il2CppString* a, ObscuredInt b);  // RVA: 0x676710
    static ObscuredFileWriteResult nzr();  // RVA: 0x674670
    static void qg(Il2CppString* a, ObscuredLong b);  // RVA: 0x674E90
    static ObscuredByte nca(Il2CppString* a, ObscuredByte b);  // RVA: 0x6733A0
    static ObscuredFileWriteResult wij();  // RVA: 0x6792C0
    static void wig();  // RVA: 0x678C50
    static void rx(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x674FD0
    static ObscuredUInt mao(Il2CppString* a, ObscuredUInt b);  // RVA: 0x672D30
    static void buf(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x66DE70
    static ObscuredFileReadResult whl();  // RVA: 0x677850
    static void coe(Il2CppString* a, ObscuredString* b);  // RVA: 0x66E6E0
    static void nkk();  // RVA: 0x673D30
    static void ndb(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x673600
    static bool whi();  // RVA: 0x677750
    static dbg* whr();  // RVA: 0x677B00
    static ObscuredSByte cri(Il2CppString* a, ObscuredSByte b);  // RVA: 0x66E960
    static void nsg(Il2CppString* a, ObscuredInt b);  // RVA: 0x674300
    static void wfy(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x675D60
    static void dur(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x66F000
    static ObscuredDateTime kja(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x672490
    static void .cctor();  // RVA: 0x66D380
    static void kbr(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x6722A0
    static ObscuredULong ggp(Il2CppString* a, ObscuredULong b);  // RVA: 0x6703F0
    static ObscuredDateTimeOffset dyy(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x66F170
    static void whm(ObscuredFileReadResult a);  // RVA: 0x6778C0
    static void gnp(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x6705D0
    static void wfn(Il2CppString* a, ObscuredInt b);  // RVA: 0x675740
    static bool iqi(Il2CppString* a);  // RVA: 0x6718E0
    static ObscuredBigInteger bot(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x66DAC0
    static void bip(Il2CppString* a, ObscuredByte b);  // RVA: 0x66D680
    static ObscuredByte imj(Il2CppString* a, ObscuredByte b);  // RVA: 0x6717A0
    static void hpa(Il2CppString* a, ObscuredDouble b);  // RVA: 0x670F40
    static ObscuredString* wgp(Il2CppString* a, ObscuredString* b);  // RVA: 0x676AC0
    static ObscuredVector2Int fu(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x66FFB0
    static void hfz(Il2CppString* a);  // RVA: 0x670C50
    static ObscuredChar wgc(Il2CppString* a, ObscuredChar b);  // RVA: 0x676000
    static ObscuredVector2 hci(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x670AC0
    static ObscuredByte htp(Il2CppString* a, ObscuredByte b);  // RVA: 0x6711C0
    static ObscuredShort cmc(Il2CppString* a, ObscuredShort b);  // RVA: 0x66E520
    static void dqp();  // RVA: 0x66EC90
    static ObscuredULong wgr(Il2CppString* a, ObscuredULong b);  // RVA: 0x676BF0
    static void gnm(Il2CppString* a, ObscuredUShort b);  // RVA: 0x670540
    static void wfi(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x6753F0
    static ObscuredBigInteger gaw(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x670270
    static void eed(Il2CppString* a, ObscuredString* b);  // RVA: 0x66F2D0
    static void wfk(Il2CppString* a, ObscuredDouble b);  // RVA: 0x675550
    static System.Collections.Generic.ICollection<System.String> knx();  // RVA: 0x672550
    static void wgz(Action* a);  // RVA: 0x6772E0
    static ObscuredLong hya(Il2CppString* a, ObscuredLong b);  // RVA: 0x671240
    static void wfw(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x675C30
    static void oqn(bool a);  // RVA: 0x674CA0
    static void odr(Il2CppString* a, ObscuredInt b);  // RVA: 0x674900
    static void miv(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x672DE0
    static void wfp(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x675850
    static void wgx(Action* a);  // RVA: 0x677100
    static void whd(bool a);  // RVA: 0x677580
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wii();  // RVA: 0x678D30
    static void whj(bool a);  // RVA: 0x6777A0
    static ObscuredVector3 wgv(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x676F00
    static void kwk(Il2CppString* a, ObscuredString* b);  // RVA: 0x6725D0
    static ObscuredSByte cqs(Il2CppString* a, ObscuredSByte b);  // RVA: 0x66E8E0
    static ObscuredDecimal ojh(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x674A10
    static void kds(Il2CppString* a, ObscuredShort b);  // RVA: 0x672350
    static void bsw(Il2CppString* a, ObscuredUShort b);  // RVA: 0x66DBC0
    static void fgu(Il2CppString* a, ObscuredDouble b);  // RVA: 0x66F8D0
    static void oqu();  // RVA: 0x674D60
    static ObscuredLong wgl(Il2CppString* a, ObscuredLong b);  // RVA: 0x6767C0
    static void bco(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x66D550
    static void wfx(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x675CD0
    static void wfo(Il2CppString* a, ObscuredLong b);  // RVA: 0x6757C0
    static void why(bool a);  // RVA: 0x678590
    static bool whc();  // RVA: 0x677530
    static void rj(Il2CppString* a, ObscuredGuid b);  // RVA: 0x674F20
    static ObscuredUShort wgs(Il2CppString* a, ObscuredUShort b);  // RVA: 0x676CB0
    static void wih();  // RVA: 0x678CC0
    static void wfm(Il2CppString* a, ObscuredGuid b);  // RVA: 0x675690
    static ObscuredVector3 bod(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x66D9C0
    static System.Collections.Generic.ICollection<System.String> gpo();  // RVA: 0x670710
    static ObscuredVector2Int noa(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x674240
    static void jdc();  // RVA: 0x671B20
    static ObscuredFloat wgi(Il2CppString* a, ObscuredFloat b);  // RVA: 0x676550
    static ObscuredFileWriteResult win(Byte[][] a);  // RVA: 0x679690
    static void jhy(Il2CppString* a, ObscuredFloat b);  // RVA: 0x671D80
    static void fmg();  // RVA: 0x66FA70
    static void exn(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x66F5C0
    static void ti(Il2CppString* a, bool b);  // RVA: 0x675080
    static ObscuredFileReadResult wim();  // RVA: 0x6794B0
    static void ckn(Il2CppString* a, bool b);  // RVA: 0x66E490
    static void bo(dbq* a, bool b);  // RVA: 0x66D920
    static bool Save();  // RVA: 0x66CE20
    static System.Collections.Generic.ICollection<System.String> wia();  // RVA: 0x6786F0
    static void ecn();  // RVA: 0x66F260
    static void imf();  // RVA: 0x671470
    static ObscuredBool wga(Il2CppString* a, ObscuredBool b);  // RVA: 0x675EC0
    static ObscuredDecimal wgf(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x676270
    static bool cf(Il2CppString* a);  // RVA: 0x66E0E0
    static ObscuredSByte dks(Il2CppString* a, ObscuredSByte b);  // RVA: 0x66EC10
    static ObscuredVector2 gwl(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x670850
    static ObscuredSByte dsf(Il2CppString* a, ObscuredSByte b);  // RVA: 0x66EE80
    static ObscuredDateTime wgd(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x6760C0
    static void jwn(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x6720F0
    static ObscuredUShort nwu(Il2CppString* a, ObscuredUShort b);  // RVA: 0x674440
    static ObscuredVector2 wgt(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x676D70
    static ObscuredUShort epj(Il2CppString* a, ObscuredUShort b);  // RVA: 0x66F400
    static ObscuredDouble gze(Il2CppString* a, ObscuredDouble b);  // RVA: 0x670920
    static ObscuredBigInteger man(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x672C30
    static void loo();  // RVA: 0x6727E0
    static ObscuredGuid wgj(Il2CppString* a, ObscuredGuid b);  // RVA: 0x676610
    static void lee(Il2CppString* a);  // RVA: 0x672650
    static void nby(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x6732F0
    static void wgy(Action* a);  // RVA: 0x6771F0
    static ObscuredGuid dtf(Il2CppString* a, ObscuredGuid b);  // RVA: 0x66EF00
    static ObscuredVector3Int wgw(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x677000
    static void hgz(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x670D40
    static void wfv(Il2CppString* a, ObscuredUShort b);  // RVA: 0x675BA0
    static ObscuredFileReadResult nnj();  // RVA: 0x674060
    static void fsj(Il2CppString* a, ObscuredInt b);  // RVA: 0x66FF30
};

// Namespace: <global>
class dbj
{
public:
    // Static fields
    // static bool bmqw;


    // Methods
    static bool wip();  // RVA: 0x679AA0
    static void wis(bool a);  // RVA: 0x67A0F0
    static void wio();  // RVA: 0x679CB0
    static void wiq(bool a);  // RVA: 0x679AC0
    static void euy(bool a);  // RVA: 0x6799B0
    static bool lwm();  // RVA: 0x679AA0
    static void wit();  // RVA: 0x67A1E0
    static bool lys();  // RVA: 0x679AA0
    static void hs(bool a);  // RVA: 0x679AD0
    static bool qj();  // RVA: 0x679AA0
    static void jyf(bool a);  // RVA: 0x679AC0
    static void wir(bool a);  // RVA: 0x6799A0
    static void gss(bool a);  // RVA: 0x679AC0
    static void omy(bool a);  // RVA: 0x6799A0
    static void dtj(bool a);  // RVA: 0x6799A0
    static void dad(bool a);  // RVA: 0x6798B0
    static void osb(bool a);  // RVA: 0x679AC0
    static void lyl(bool a);  // RVA: 0x679BC0
    static bool fud();  // RVA: 0x679AA0
};

// Namespace: <global>
class dbk
{
public:

    // Methods
    static dbn* heq(dbl* a);  // RVA: 0x67A3B0
    static ObscuredPrefsData wiu(a a, dbl* b);  // RVA: 0x562180
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> jbc(Byte[][] a, dbl* b);  // RVA: 0x67A450
    static b wiv(ObscuredPrefsData a, dbl* b);  // RVA: 0x562180
    static Byte[][] cfk(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a, dbl* b);  // RVA: 0x67A340
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> ogw(Byte[][] a, dbl* b);  // RVA: 0x67A680
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> kdx(Byte[][] a, dbl* b);  // RVA: 0x67A4C0
    static Byte[][] nta(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a, dbl* b);  // RVA: 0x67A5A0
    static dbn* jju(dbl* a);  // RVA: 0x67A3B0
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wix(Byte[][] a, dbl* b);  // RVA: 0x67A760
    static Byte[][] gac(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a, dbl* b);  // RVA: 0x67A3E0
    static dbn* wiy(dbl* a);  // RVA: 0x67A3B0
    static Byte[][] wiw(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a, dbl* b);  // RVA: 0x67A6F0
    static Byte[][] ngj(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a, dbl* b);  // RVA: 0x67A530
    static dbn* enf(dbl* a);  // RVA: 0x67A3B0
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> nuf(Byte[][] a, dbl* b);  // RVA: 0x67A610
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct ACTkSerializationKind
    {
    public:
        // Static fields
        // static ACTkSerializationKind Binary;
    
        uint8_t pad_0000[0x10]; // 0x0000
        int32_t value__; // 0x0010
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbl
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    ACTkSerializationKind <bmqx>k__BackingField; // 0x0010

    // Methods
    ACTkSerializationKind wiz();  // RVA: 0x65BB20
    void .ctor(ACTkSerializationKind a);  // RVA: 0x668880
};

// Namespace: <global>
class dbm
{
public:
    // Static fields
    // static uint8_t bmqy;
    // static dbm* bmqz;


    // Methods
    void .ctor();  // RVA: 0x626570
    ObscuredPrefsData wjb(a a);  // RVA: 0x562180
    static dbn* wja();  // RVA: 0x67AD40
    void bmp(BinaryWriter* a, Il2CppString* b, ObscuredPrefsData c);  // RVA: 0x67A7D0
    b wjc(ObscuredPrefsData a);  // RVA: 0x562180
    void wjf(BinaryWriter* a, Il2CppString* b, ObscuredPrefsData c);  // RVA: 0x67A7D0
