// ============================================================
// Image: ACTk.Runtime.dll
// ============================================================

namespace Microsoft.CodeAnalysis
{

    // Namespace: Microsoft.CodeAnalysis
    class EmbeddedAttribute : public Attribute
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x668030
    };

} // namespace Microsoft.CodeAnalysis

namespace System.Runtime.CompilerServices
{

    // Namespace: System.Runtime.CompilerServices
    class IsUnmanagedAttribute : public Attribute
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x668030
    };

} // namespace System.Runtime.CompilerServices

// Namespace: <global>
struct MonoScriptData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Byte[][] FilePathsData; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Byte[][] TypesData; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    int32_t TotalTypes; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    int32_t TotalFiles; // 0x0024
    uint8_t pad_0025[0x3]; // 0x0025
    bool IsEditorOnly; // 0x0028
};

// Namespace: <global>
class dam
{
public:

    // Methods
    static MonoScriptData vyf();  // RVA: 0x668DC0
    void .ctor();  // RVA: 0x629570
    static MonoScriptData jgh();  // RVA: 0x668CE0
};

// Namespace: <global>
class dan
{
public:

    // Methods
    static void ksw();  // RVA: 0x634510
    static void lck();  // RVA: 0x634510
    static void vyg();  // RVA: 0x634510
    static void nrp();  // RVA: 0x634510
    static void eav();  // RVA: 0x634510
    static void vyh();  // RVA: 0x634510
};

// Namespace: <global>
class ApplicationFocusEventHandler : public MulticastDelegate
{
public:

    // Methods
    void .ctor(Il2CppObject* object, intptr_t method);  // RVA: 0x667F20
    void Invoke(bool hasFocus);  // RVA: 0x667F10
    IAsyncResult* BeginInvoke(bool hasFocus, AsyncCallback* callback, Il2CppObject* object);  // RVA: 0x667EA0
    void EndInvoke(IAsyncResult* result);  // RVA: 0x667F00
};

// Namespace: <global>
class ApplicationPauseEventHandler : public MulticastDelegate
{
public:

    // Methods
    void .ctor(Il2CppObject* object, intptr_t method);  // RVA: 0x667F20
    void Invoke(bool pauseStatus);  // RVA: 0x667F10
    IAsyncResult* BeginInvoke(bool pauseStatus, AsyncCallback* callback, Il2CppObject* object);  // RVA: 0x667EA0
    void EndInvoke(IAsyncResult* result);  // RVA: 0x667F00
};

// Namespace: <global>
class dao : public MonoBehaviour
{
public:
    // Static fields
    // static dao* bmmf;

    uint8_t pad_0000[0x20]; // 0x0000
    ApplicationFocusEventHandler* bmmd; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    ApplicationPauseEventHandler* bmme; // 0x0028

    // Methods
    void mbf(bool pauseStatus);  // RVA: 0x668F60
    void Awake();  // RVA: 0x668EA0
    void OnApplicationFocus(bool hasFocus);  // RVA: 0x668F40
    void lsi();  // RVA: 0x668F80
    static dao* vym();  // RVA: 0x669340
    void vyj(ApplicationFocusEventHandler* a);  // RVA: 0x669160
    void vyi(ApplicationFocusEventHandler* a);  // RVA: 0x6690C0
    void OnApplicationPause(bool pauseStatus);  // RVA: 0x668F60
    void .ctor();  // RVA: 0x629A00
    void bst(bool pauseStatus);  // RVA: 0x668F60
    void nx();  // RVA: 0x669020
    void vyl(ApplicationPauseEventHandler* a);  // RVA: 0x6692A0
    void gzj(bool pauseStatus);  // RVA: 0x668F60
    void vyk(ApplicationPauseEventHandler* a);  // RVA: 0x669200
};

// Namespace: <global>
class dap
{
public:

    // Methods
    static Il2CppString* onn(Char[][] a);  // RVA: 0x6698F0
    static Char[][] kwn(Il2CppString* a);  // RVA: 0x669730
    static Il2CppString* ewv(Il2CppString* a);  // RVA: 0x669580
    static Il2CppString* ix(Char[][] a);  // RVA: 0x669620
    static Char[][] vyo(Il2CppString* a);  // RVA: 0x669AA0
    static Il2CppString* vyp(Il2CppString* a);  // RVA: 0x669B40
    static Il2CppString* nka(Il2CppString* a);  // RVA: 0x6697D0
    static Il2CppString* erg(Char[][] a);  // RVA: 0x669470
    static Il2CppString* vyq(Char[][] a);  // RVA: 0x669C60
    static Il2CppString* vyn(Il2CppString* a);  // RVA: 0x669A00
};

// Namespace: <global>
class daq
{
public:
    // Static fields
    // static int32_t bmmg;
    // static uint8_t bmmh;
    // static uint8_t bmmi;
    // static uint8_t bmmj;
    // static uint8_t bmmk;
    // static uint8_t bmml;


    // Methods
    static void gzp(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x669FA0
    static void vys(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x66A240
    static void fts(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x669DE0
    static void vyu(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x66A320
    static void gix(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x669EC0
    static void vyr(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x66A1D0
    static void vyt(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x66A2B0
    static void jyy(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x66A0F0
    static void vyv(Stream* a, Stream* b, Byte[][] c, uint8_t d);  // RVA: 0x564EA0
    static void ner(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x66A160
    static void fuq(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x669E50
    static void gxi(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x669F30
    static void bau(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x669D70
    static void vyw(Stream* a, Stream* b, Byte[][] c, uint8_t d, uint8_t e);  // RVA: 0x41A480
    static void jdm(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x66A080
    static void itm(Stream* a, Stream* b, Byte[][] c);  // RVA: 0x66A010
};

// Namespace: <global>
class dar
{
public:
    // Static fields
    // static int32_t bmmm;


    // Methods
    static int32_t cx(bool a);  // RVA: 0x66A810
    static bool tt(Guid a, int32_t b);  // RVA: 0x66A430
    static bool vzb(int64_t a, int32_t b);  // RVA: 0x66B6A0
    static int32_t brk(float a);  // RVA: 0x66A4D0
    static bool bzf(uint32_t a, int32_t b);  // RVA: 0x66A580
    static bool fko(bool a, int32_t b);  // RVA: 0x66A4B0
    static bool vyz(Decimal a, int32_t b);  // RVA: 0x66A850
    static bool vzm(DateTimeOffset a, int32_t b);  // RVA: 0x66B5B0
    static bool vzf(Vector2 a, int32_t b);  // RVA: 0x66B500
    static int32_t dfo(Vector2Int a);  // RVA: 0x66A390
    static bool hjd(Guid a, int32_t b);  // RVA: 0x66A430
    static bool ese(Vector2Int a, int32_t b);  // RVA: 0x66ABB0
    static bool lpm(float a, int32_t b);  // RVA: 0x66A520
    static int32_t wad(Vector2Int a);  // RVA: 0x66A390
    static int32_t cnb(Vector3Int a);  // RVA: 0x66A710
    static bool vzi(Vector3Int a, int32_t b);  // RVA: 0x66A820
    static bool vzn(Guid a, int32_t b);  // RVA: 0x66A430
    static int32_t ebq(int32_t a);  // RVA: 0x66AA50
    static bool efp(float a, int32_t b);  // RVA: 0x66A520
    static int32_t dn(uint32_t a);  // RVA: 0x66A8C0
    static bool vzj(float a, int32_t b);  // RVA: 0x66A520
    static int32_t vzs(int32_t a);  // RVA: 0x66A8C0
    static int32_t obz(BigInteger a);  // RVA: 0x66BFB0
    static int32_t xk(uint32_t a);  // RVA: 0x66A8C0
    static int32_t vzv(Guid a);  // RVA: 0x66CC50
    static bool gav(Vector2Int a, int32_t b);  // RVA: 0x66ABB0
    static bool nky(uint32_t a, int32_t b);  // RVA: 0x66A580
    static int32_t vzq(bool a);  // RVA: 0x66C8A0
    static int32_t vzz(float a);  // RVA: 0x66A4D0
    static bool vzg(Vector2Int a, int32_t b);  // RVA: 0x66ABB0
    static bool er(BigInteger a, int32_t b);  // RVA: 0x66AB80
    static bool lhm(Vector2 a, int32_t b);  // RVA: 0x66B500
    static int32_t lgh(Char[][] a);  // RVA: 0x66BC30
    static bool hda(Vector3Int a, int32_t b);  // RVA: 0x66A820
    static bool kbr(BigInteger a, int32_t b);  // RVA: 0x66AB80
    static int32_t nlq(uint32_t a);  // RVA: 0x66A8C0
    static int32_t jjl(uint32_t a);  // RVA: 0x66A8C0
    static int32_t bqg(Char[][] a);  // RVA: 0x66A460
    static bool vza(int32_t a, int32_t b);  // RVA: 0x66A580
    static int32_t foe(int64_t a);  // RVA: 0x66B060
    static int32_t wae(Vector3 a);  // RVA: 0x66AA90
    static bool jag(bool a, int32_t b);  // RVA: 0x66A4B0
    static int32_t fkx(DateTime a);  // RVA: 0x66AF70
    static bool dpe(Vector3Int a, int32_t b);  // RVA: 0x66A820
    static bool cyv(Decimal a, int32_t b);  // RVA: 0x66A850
    static int32_t msy(int64_t a);  // RVA: 0x66BEE0
    static int32_t fst(Quaternion a);  // RVA: 0x66A910
    static bool duu(int32_t a, int32_t b);  // RVA: 0x66A580
    static int32_t waa(double a);  // RVA: 0x66CFF0
    static bool vzl(Char[][] a, int32_t b);  // RVA: 0x66B750
    static bool oed(uint32_t a, int32_t b);  // RVA: 0x66A580
    static int32_t vzu(DateTimeOffset a);  // RVA: 0x66CB70
    static bool mzf(uint64_t a, int32_t b);  // RVA: 0x66B5E0
    static bool gub(DateTimeOffset a, int32_t b);  // RVA: 0x66B5B0
    static int32_t vzt(DateTime a);  // RVA: 0x66CA80
    static bool mxx(Quaternion a, int32_t b);  // RVA: 0x66BF80
    static int32_t vzp(BigInteger a);  // RVA: 0x66C5B0
    static bool nrm(Vector2 a, int32_t b);  // RVA: 0x66B500
    static int32_t vzo(a a);  // RVA: 0x564EA0
    static int32_t cbu(int32_t a);  // RVA: 0x66A5D0
    static int32_t bbc(Vector2Int a);  // RVA: 0x66A390
    static bool idj(Vector2Int a, int32_t b);  // RVA: 0x66ABB0
    static int32_t rw(Decimal a);  // RVA: 0x66C2A0
    static bool fid(BigInteger a, int32_t b);  // RVA: 0x66AB80
    static bool jkp(Vector2 a, int32_t b);  // RVA: 0x66B500
    static int32_t wah(Il2CppString* a);  // RVA: 0x66D160
    static bool kaz(Char[][] a, int32_t b);  // RVA: 0x66B750
    static bool csq(int32_t a, int32_t b);  // RVA: 0x66A580
    static int32_t vzr(Decimal a);  // RVA: 0x66C8B0
    static int32_t kcb(DateTime a);  // RVA: 0x66B7B0
    static int32_t ntl(Vector2Int a);  // RVA: 0x66A390
    static int32_t waf(Vector3Int a);  // RVA: 0x66D010
    static bool lug(DateTimeOffset a, int32_t b);  // RVA: 0x66B5B0
    static int32_t exe(Guid a);  // RVA: 0x66AC60
    static int32_t gis(int32_t a);  // RVA: 0x66B4C0
    static bool vzc(uint32_t a, int32_t b);  // RVA: 0x66A580
    static bool cys(Vector3Int a, int32_t b);  // RVA: 0x66A820
    static int32_t vzy(uint64_t a);  // RVA: 0x66CF50
    static int32_t kpm(BigInteger a);  // RVA: 0x66B8A0
    static int32_t fex(int64_t a);  // RVA: 0x66AED0
    static int32_t gfl(BigInteger a);  // RVA: 0x66B1D0
    static int32_t fpw(bool a);  // RVA: 0x66B0E0
    static bool vyx(BigInteger a, int32_t b);  // RVA: 0x66AB80
    static bool vzd(uint64_t a, int32_t b);  // RVA: 0x66B5E0
    static bool vyy(bool a, int32_t b);  // RVA: 0x66A4B0
    static int32_t vzw(int64_t a);  // RVA: 0x66CEB0
    static bool ncs(DateTimeOffset a, int32_t b);  // RVA: 0x66B5B0
    static bool mfg(Decimal a, int32_t b);  // RVA: 0x66A850
    static bool jxd(int64_t a, int32_t b);  // RVA: 0x66B6A0
    static int32_t jkg(bool a);  // RVA: 0x66B690
    static bool vze(Quaternion a, int32_t b);  // RVA: 0x66BF80
    static int32_t kwx(Vector2Int a);  // RVA: 0x66A390
    static bool izq(float a, int32_t b);  // RVA: 0x66A520
    static int32_t ltm(DateTimeOffset a);  // RVA: 0x66BC80
    static int32_t cdo(Vector3Int a);  // RVA: 0x66A610
    static int32_t fxc(DateTimeOffset a);  // RVA: 0x66B0F0
    static bool fnt(BigInteger a, int32_t b);  // RVA: 0x66AB80
    static int32_t vzx(uint32_t a);  // RVA: 0x66A8C0
    static int32_t wab(Quaternion a);  // RVA: 0x66A910
    static bool gsx(Vector2Int a, int32_t b);  // RVA: 0x66ABB0
    static bool glc(Vector2 a, int32_t b);  // RVA: 0x66B500
    static bool vzk(double a, int32_t b);  // RVA: 0x66C580
    static int32_t kpu(uint64_t a);  // RVA: 0x66BB90
    static int32_t dbt(int32_t a);  // RVA: 0x66A880
    static int32_t dx(Quaternion a);  // RVA: 0x66A910
    static int32_t wac(Vector2 a);  // RVA: 0x66C3D0
    static bool bqn(bool a, int32_t b);  // RVA: 0x66A4B0
    static int32_t oe(Quaternion a);  // RVA: 0x66A910
    static bool izu(uint64_t a, int32_t b);  // RVA: 0x66B5E0
    static int32_t ti(Vector2 a);  // RVA: 0x66C3D0
    static bool jlc(uint64_t a, int32_t b);  // RVA: 0x66B5E0
    static bool bvi(float a, int32_t b);  // RVA: 0x66A520
    static int32_t ehl(Vector3 a);  // RVA: 0x66AA90
    static bool vzh(Vector3 a, int32_t b);  // RVA: 0x66C470
    static int32_t mam(Decimal a);  // RVA: 0x66BD60
    static int32_t wag(Char[][] a);  // RVA: 0x66D110
    static bool bby(Guid a, int32_t b);  // RVA: 0x66A430
};

// Namespace: <global>
class das : public CertificateHandler
{
public:

    // Methods
    bool ValidateCertificate(Byte[][] certificateData);  // RVA: 0x66D1E0
    void .ctor();  // RVA: 0x66D1F0
};

// Namespace: <global>
class dat
{
public:

    // Methods
    static bool id(float a, float b, float c);  // RVA: 0x66D2B0
    static bool lzj(float a, float b, float c);  // RVA: 0x66D360
    static bool wai(float a, float b, float c);  // RVA: 0x66D4C0
    static bool waj(double a, double b, double c);  // RVA: 0x66D570
    static bool ojl(float a, float b, float c);  // RVA: 0x66D410
    static bool eiy(float a, float b, float c);  // RVA: 0x66D200
};

// Namespace: <global>
class dau
{
public:

    // Methods
    static void wak(System.IProgress<CodeStage.AntiCheat.Genuine.CodeHash.FilesProgress> a, int32_t b, int32_t c, int64_t d, Il2CppString* e);  // RVA: 0x66D6A0
};

// Namespace: <global>
class dav
{
public:

    // Methods
    static uint16_t mri();  // RVA: 0x66DDF0
    static void ezp(Char[][] a);  // RVA: 0x66D970
    static Il2CppString* wal(int32_t a);  // RVA: 0x66DE90
    static uint8_t bqo();  // RVA: 0x66D7D0
    static int8_t jdy();  // RVA: 0x66DC70
    static int16_t wap();  // RVA: 0x66E060
    static uint8_t hnu();  // RVA: 0x66DC20
    static wchar_t wao();  // RVA: 0x66E010
    static int32_t lju();  // RVA: 0x66DD10
    static int64_t hio();  // RVA: 0x66DB80
    static int16_t cof();  // RVA: 0x66D870
    static uint8_t bse();  // RVA: 0x66D820
    static uint8_t fl();  // RVA: 0x66DA00
    static uint16_t waq();  // RVA: 0x66E0B0
    static uint64_t wau();  // RVA: 0x66D8C0
    static int64_t wat();  // RVA: 0x66D8C0
    static wchar_t etn();  // RVA: 0x66D920
    static void wav(Char[][] a);  // RVA: 0x66E150
    static int16_t hlr();  // RVA: 0x66DBD0
    static void mbm(Char[][] a);  // RVA: 0x66DD60
    static int32_t war();  // RVA: 0x66E100
    static uint16_t hil();  // RVA: 0x66DB30
    static uint16_t gvs();  // RVA: 0x66DA50
    static uint32_t was();  // RVA: 0x66E100
    static int8_t wan();  // RVA: 0x66DFC0
    static uint8_t wam();  // RVA: 0x66DF70
    static uint16_t kye();  // RVA: 0x66DCC0
    static uint64_t eaj();  // RVA: 0x66D8C0
    static int32_t nay();  // RVA: 0x66DE40
    static uint64_t lhm();  // RVA: 0x66D8C0
    static void hgw(Char[][] a);  // RVA: 0x66DAA0
    static wchar_t yt();  // RVA: 0x66E1E0
};

// Namespace: <global>
class daw
{
public:
    // Static fields
    // static Char[][] bmmn;


    // Methods
    static Char[][] way(Byte[][] a);  // RVA: 0x66E350
    static Il2CppString* ekr(Byte[][] a);  // RVA: 0x66E310
    static Il2CppString* kzg(Byte[][] a);  // RVA: 0x66E310
    static Il2CppString* lgw(Byte[][] a);  // RVA: 0x66E310
    static Byte[][] dkk(Il2CppString* a);  // RVA: 0x66E2C0
    static Byte[][] waw(Char[][] a);  // RVA: 0x66E390
    static void .cctor();  // RVA: 0x66E230
    static Byte[][] vp(Char[][] a);  // RVA: 0x66E390
    static Il2CppString* egy(Byte[][] a);  // RVA: 0x66E310
    static Byte[][] wax(Il2CppString* a);  // RVA: 0x66E2C0
    static Char[][] jkr(Byte[][] a);  // RVA: 0x66E350
    static Byte[][] hal(Il2CppString* a);  // RVA: 0x66E2C0
    static Il2CppString* waz(Byte[][] a);  // RVA: 0x66E310
    static Il2CppString* wbb(Byte[][] a);  // RVA: 0x66E430
    static Il2CppString* wba(Byte[][] a, int32_t b, int32_t c);  // RVA: 0x66E3D0
};

// Namespace: <global>
class dax`1
{
public:
    System.Collections.Concurrent.ConcurrentBag<a> bmmo; // 0x0000
    System.Func<a> bmmp; // 0x0000

    // Methods
    void wbd(a a);  // RVA: 0x564EA0
    void .ctor(System.Func<a> a);  // RVA: 0x41A660
    void wbe();  // RVA: 0x430730
    a wbc();  // RVA: 0x564EA0
};

// Namespace: <global>
class day
{
public:
    // Static fields
    // static Random* bmmq;
    // static Random* bmmr;


    // Methods
    static int64_t iwk(int64_t a, int64_t b);  // RVA: 0x66EC50
    static void wbh(Byte[][] a);  // RVA: 0x670210
    static int64_t hmj(Random* a, int64_t b, int64_t c);  // RVA: 0x66EBE0
    static int64_t hbi(Random* a, int64_t b, int64_t c);  // RVA: 0x66EB70
    static int32_t wbf(int32_t a, int32_t b);  // RVA: 0x66FD80
    static void .cctor();  // RVA: 0x66E5B0
    static int32_t mdl(int32_t a, int32_t b);  // RVA: 0x66F370
    static int64_t mxk(int64_t a, int64_t b);  // RVA: 0x66F610
    static int32_t jsl(int32_t a, int32_t b);  // RVA: 0x66EEC0
    static void wbk(Random* a, Char[][] b);  // RVA: 0x670830
    static void lux(Byte[][] a);  // RVA: 0x66F0E0
    static int64_t mmw(Random* a, int64_t b, int64_t c);  // RVA: 0x66F590
    static int32_t dtv(int32_t a, int32_t b);  // RVA: 0x66E6C0
    static int64_t vv(Random* a, int64_t b, int64_t c);  // RVA: 0x66FD10
    static void ehv(Byte[][] a);  // RVA: 0x66E8E0
    static void djm(Random* a, Char[][] b);  // RVA: 0x66E630
    static int32_t nww(int32_t a, int32_t b);  // RVA: 0x66F880
    static int64_t wbj(Random* a, int64_t b, int64_t c);  // RVA: 0x6707B0
    static int64_t opx(int64_t a, int64_t b);  // RVA: 0x66FAA0
    static int64_t wbg(int64_t a, int64_t b);  // RVA: 0x66FFA0
    static void wbi(Char[][] a);  // RVA: 0x6704A0
};

// Namespace: <global>
class daz
{
public:
    // Static fields
    // static int64_t bmms;


    // Methods
    static int64_t lz();  // RVA: 0x670B90
    static int64_t hoa();  // RVA: 0x6709D0
    static double wbm();  // RVA: 0x670D00
    static int64_t ere();  // RVA: 0x670940
    static int64_t wbp();  // RVA: 0x670DB0
    static int64_t wbo();  // RVA: 0x670D90
    static double lok();  // RVA: 0x670B20
    static int64_t osr();  // RVA: 0x670C60
    static int64_t lll();  // RVA: 0x670AC0
    static int64_t wbl();  // RVA: 0x670CA0
    static double iat();  // RVA: 0x670A30
    static double gml();  // RVA: 0x670960
    static int64_t cai();  // RVA: 0x6708C0
    static int64_t wbn();  // RVA: 0x670D70
    static int64_t lgs();  // RVA: 0x670AA0
    static int64_t osv();  // RVA: 0x670C80
    static int64_t ekq();  // RVA: 0x670920
    static double ogc();  // RVA: 0x670BF0
};

// Namespace: <global>
class dba
{
public:
    // Static fields
    // static uint32_t bmmt;
    // static uint32_t bmmu;
    // static uint32_t bmmv;
    // static uint32_t bmmw;
    // static uint32_t bmmx;


    // Methods
    static uint32_t iti(Byte[][] a, int32_t b, uint32_t c);  // RVA: 0x671400
    static uint32_t wbr(Stream* a, int64_t b, uint32_t c);  // RVA: 0x671F70
    static uint32_t mdy(Byte[][] a, int32_t b, uint32_t c);  // RVA: 0x671960
    static uint32_t fee(Byte[][] a, int32_t b, uint32_t c);  // RVA: 0x670FB0
    static uint32_t fiz(Stream* a, int64_t b, uint32_t c);  // RVA: 0x671120
    static uint32_t wbq(Byte[][] a, int32_t b, uint32_t c);  // RVA: 0x671B40
    static uint32_t jyr(Stream* a, int64_t b, uint32_t c);  // RVA: 0x671620
    static uint32_t bis(Byte[][] a, int32_t b, uint32_t c);  // RVA: 0x670DD0
};

// Namespace: <global>
class dbb : public dcx`1
{
public:
    // Static fields
    // static bool bmmy;
    // static bool bmmz;
    // static float bmna;
    // static float bmnb;
    // static float bmnc;
    // static float bmnd;
    // static float bmne;
    // static float bmnf;
    // static bool bmng;

    uint8_t pad_0000[0x30]; // 0x0000
    int64_t bmnh; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    int64_t bmni; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    int64_t bmnj; // 0x0040

    // Methods
    static void nkd();  // RVA: 0x673460
    void wcd();  // RVA: 0x6740F0
    void isq();  // RVA: 0x6730C0
    void fwp();  // RVA: 0x672D30
    static float wbu();  // RVA: 0x673A40
    bool cgz();  // RVA: 0x672770
    static void wbt();  // RVA: 0x673810
    void nng();  // RVA: 0x6734D0
    static float wbz();  // RVA: 0x673E00
    bool lhf();  // RVA: 0x673190
    static float wby();  // RVA: 0x673D40
    bool wcc();  // RVA: 0x673EE0
    void wcg(Scene a, LoadSceneMode b);  // RVA: 0x674370
    void wce();  // RVA: 0x6741C0
    static void wbs();  // RVA: 0x6737A0
    static void gtm();  // RVA: 0x672E90
    void .ctor();  // RVA: 0x672490
    void bjx();  // RVA: 0x6724D0
    static void wcb(float a);  // RVA: 0x673ED0
    void mxz();  // RVA: 0x6733A0
    void day();  // RVA: 0x672980
    static float wbw();  // RVA: 0x673BC0
    bool nuc();  // RVA: 0x673590
    void fum();  // RVA: 0x672C60
    bool ejy();  // RVA: 0x672A50
    static float wbv();  // RVA: 0x673B00
    void btw();  // RVA: 0x6725A0
    void ccy();  // RVA: 0x672660
    static float wbx();  // RVA: 0x673C80
    void Update();  // RVA: 0x6723D0
    void wcf();  // RVA: 0x6742D0
    static float wca();  // RVA: 0x673EC0
    void gma();  // RVA: 0x672DF0
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct StorageDataType
    {
    public:
        // Static fields
        // static StorageDataType Unknown;
        // static StorageDataType SByte;
        // static StorageDataType Byte;
        // static StorageDataType Int16;
        // static StorageDataType UInt16;
        // static StorageDataType Int32;
        // static StorageDataType UInt32;
        // static StorageDataType Int64;
        // static StorageDataType UInt64;
        // static StorageDataType Char;
        // static StorageDataType Single;
        // static StorageDataType Double;
        // static StorageDataType Decimal;
        // static StorageDataType BigInteger;
        // static StorageDataType Boolean;
        // static StorageDataType String;
        // static StorageDataType DateTime;
        // static StorageDataType ByteArray;
        // static StorageDataType Vector2;
        // static StorageDataType Vector2Int;
        // static StorageDataType Vector3;
        // static StorageDataType Vector3Int;
        // static StorageDataType Vector4;
        // static StorageDataType Quaternion;
        // static StorageDataType Color;
        // static StorageDataType Color32;
        // static StorageDataType Rect;
        // static StorageDataType RectInt;
        // static StorageDataType RangeInt;
        // static StorageDataType Matrix4x4;
        // static StorageDataType Ray;
        // static StorageDataType Ray2D;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredPrefsData
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        StorageDataType type; // 0x0010
        uint8_t pad_0011[0x7]; // 0x0011
        Byte[][] data; // 0x0018
    
        // Methods
        void .ctor(StorageDataType type, Byte[][] data);  // RVA: 0x668BC0
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbc
{
public:

    // Methods
    static Color32 wch(Byte[][] a);  // RVA: 0x674470
    static Byte[][] wco(T a);  // RVA: 0x564EA0
    static b wcj(ObscuredPrefsData a);  // RVA: 0x564EA0
    static c wck(Byte[][] a);  // RVA: 0x564EA0
    static Color32 lof(Byte[][] a);  // RVA: 0x674430
    static Byte[][] wcm(StorageDataType a, e b);  // RVA: 0x564EA0
    static Color32 kyj(Byte[][] a);  // RVA: 0x6743F0
    static ObscuredPrefsData wci(a a);  // RVA: 0x564EA0
    static d wcl(StorageDataType a, Byte[][] b);  // RVA: 0x564EA0
    static T wcp(Byte[][] a);  // RVA: 0x564EA0
    static f wcn(StorageDataType a, Byte[][] b);  // RVA: 0x564EA0
};

// Namespace: <global>
class dbd
{
public:
    // Static fields
    // static Type* bmnk;
    // static Type* bmnl;
    // static Type* bmnm;
    // static Type* bmnn;
    // static Type* bmno;
    // static Type* bmnp;
    // static Type* bmnq;
    // static Type* bmnr;
    // static Type* bmns;
    // static Type* bmnt;
    // static Type* bmnu;
    // static Type* bmnv;
    // static Type* bmnw;
    // static Type* bmnx;
    // static Type* bmny;
    // static Type* bmnz;
    // static Type* bmoa;
    // static Type* bmob;
    // static Type* bmoc;
    // static Type* bmod;
    // static Type* bmoe;
    // static Type* bmof;
    // static Type* bmog;
    // static Type* bmoh;
    // static Type* bmoi;
    // static Type* bmoj;
    // static Type* bmok;
    // static Type* bmol;
    // static Type* bmom;
    // static Type* bmon;
    // static Type* bmoo;


    // Methods
    static StorageDataType wcq();  // RVA: 0x4238C0
    static void .cctor();  // RVA: 0x6744B0
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    class UnsupportedDataTypeException : public Exception
    {
    public:
    
        // Methods
        void .ctor(Type* type);  // RVA: 0x668C40
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class HashCheckSumModifierDelegate : public MulticastDelegate
{
public:

    // Methods
    void .ctor(Il2CppObject* object, intptr_t method);  // RVA: 0x668070
    Byte[][] Invoke(Il2CppString* input);  // RVA: 0x667F10
    IAsyncResult* BeginInvoke(Il2CppString* input, AsyncCallback* callback, Il2CppObject* object);  // RVA: 0x668040
    Byte[][] EndInvoke(IAsyncResult* result);  // RVA: 0x667F00
};

// Namespace: <global>
class dbe
{
public:
    // Static fields
    // static Il2CppString* bmop;

    uint8_t pad_0000[0x10]; // 0x0000
    uint32_t bmoq; // 0x0010
    uint8_t pad_0011[0x3]; // 0x0011
    uint32_t bmor; // 0x0014
    uint8_t pad_0015[0x3]; // 0x0015
    HashCheckSumModifierDelegate* bmos; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bool <bmot>k__BackingField; // 0x0020

    // Methods
    static Il2CppString* wcr();  // RVA: 0x675060
    void myy();  // RVA: 0x674DB0
    void wcy(HashCheckSumModifierDelegate* a);  // RVA: 0x674D90
    static void wct();  // RVA: 0x675170
    void .ctor(uint32_t a);  // RVA: 0x674D60
    static Il2CppString* wcu();  // RVA: 0x674EF0
    void lun(HashCheckSumModifierDelegate* a);  // RVA: 0x674D90
    void fhk();  // RVA: 0x674DB0
    void epj(bool a);  // RVA: 0x674DA0
    void wcz(bool a);  // RVA: 0x674DA0
    void bkn(HashCheckSumModifierDelegate* a);  // RVA: 0x674D90
    uint32_t wdb(Il2CppString* a);  // RVA: 0x675460
    static Il2CppString* isn();  // RVA: 0x674EF0
    uint32_t wcx();  // RVA: 0x675280
    static Il2CppString* ize();  // RVA: 0x674EF0
    static void wcs(Il2CppString* a);  // RVA: 0x675110
    void joo();  // RVA: 0x674DB0
    void csa(bool a);  // RVA: 0x674DA0
    static Il2CppString* mki();  // RVA: 0x674EF0
    void wcw(bool a);  // RVA: 0x675270
    bool wcv();  // RVA: 0x668810
    void wda();  // RVA: 0x674DB0
    uint32_t lxe(Il2CppString* a);  // RVA: 0x674F30
    uint32_t fvv(Il2CppString* a);  // RVA: 0x674DC0
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct DeviceLockLevel
    {
    public:
        // Static fields
        // static DeviceLockLevel None;
        // static DeviceLockLevel Soft;
        // static DeviceLockLevel Strict;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbf
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    DeviceLockLevel <bmou>k__BackingField; // 0x0010
    DeviceLockTamperingSensitivity <bmov>k__BackingField; // 0x0011

    // Methods
    DeviceLockLevel wdc();  // RVA: 0x668AF0
    void wdd(DeviceLockLevel a);  // RVA: 0x6755D0
    DeviceLockTamperingSensitivity wde();  // RVA: 0x6755E0
    void wdf(DeviceLockTamperingSensitivity a);  // RVA: 0x6755F0
    void .ctor(DeviceLockLevel a, DeviceLockTamperingSensitivity b);  // RVA: 0x675590
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct DeviceLockTamperingSensitivity
    {
    public:
        // Static fields
        // static DeviceLockTamperingSensitivity Disabled;
        // static DeviceLockTamperingSensitivity Low;
        // static DeviceLockTamperingSensitivity Normal;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

    // Namespace: CodeStage.AntiCheat.Storage
    class DeviceUniqueIdentifierException : public BackgroundThreadAccessException
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x667FD0
    };

    // Namespace: CodeStage.AntiCheat.Storage
    class PersistentDataPathException : public BackgroundThreadAccessException
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x668BE0
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbg
{
public:
    // Static fields
    // static Il2CppString* bmow;
    // static Il2CppString* bmox;
    // static dbe* bmoy;

    uint8_t pad_0000[0x10]; // 0x0000
    Action* bmoz; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Action* bmpa; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    dbq* <bmpb>k__BackingField; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Il2CppString* <bmpc>k__BackingField; // 0x0028

    // Methods
    ObscuredFileWriteResult hy(Byte[][] a);  // RVA: 0x676DE0
    void wdh(Action* a);  // RVA: 0x67A0B0
    ObscuredFileReadResult ogv();  // RVA: 0x6793A0
    bool wdl();  // RVA: 0x67A290
    dbq* wdk();  // RVA: 0x63DB10
    ObscuredFileWriteResult fzu(Byte[][] a);  // RVA: 0x676590
    Il2CppString* wdm();  // RVA: 0x67A2A0
    static void wdn(Il2CppString* a);  // RVA: 0x67A2B0
    ObscuredFileReadResult ckm();  // RVA: 0x6758E0
    ObscuredFileReadResult wdq();  // RVA: 0x6758E0
    void .ctor(dbr* a);  // RVA: 0x6756E0
    Il2CppString* iqh(Il2CppString* a);  // RVA: 0x677F50
    void wdj(Action* a);  // RVA: 0x67A1F0
    ObscuredFileWriteResult wdp(Byte[][] a);  // RVA: 0x676590
    ObscuredFileReadResult mmx();  // RVA: 0x6758E0
    void .ctor(Il2CppString* a);  // RVA: 0x675780
    ObscuredFileWriteResult ewp(Byte[][] a);  // RVA: 0x676630
    void .ctor(Il2CppString* a, dbq* b);  // RVA: 0x675680
    void fyg();  // RVA: 0x676B30
    void .ctor();  // RVA: 0x675820
    Il2CppString* wdw(Il2CppString* a);  // RVA: 0x67B5B0
    void wdg(Action* a);  // RVA: 0x67A010
    void wdv(Stream* a, DeviceLockLevel b);  // RVA: 0x67B520
    ObscuredFileWriteResult cvn(Byte[][] a);  // RVA: 0x676590
    ObscuredFileReadResult ijk();  // RVA: 0x6772E0
    static void .cctor();  // RVA: 0x675600
    ObscuredFileHeader wds(Stream* a);  // RVA: 0x6781D0
    ObscuredFileWriteResult ndu(Byte[][] a);  // RVA: 0x678230
    Il2CppString* gyv(Il2CppString* a);  // RVA: 0x676B60
    ObscuredFileReadResult cuw();  // RVA: 0x675920
    ObscuredFileReadResult ntz();  // RVA: 0x678730
    ObscuredFileHeader iva(Stream* a);  // RVA: 0x6781D0
    void wdo();  // RVA: 0x676B30
    ObscuredFileHeader lao(Stream* a);  // RVA: 0x6781D0
    ObscuredFileReadResult wdr();  // RVA: 0x67A340
    void wdi(Action* a);  // RVA: 0x67A150
    void eop(Stream* a);  // RVA: 0x6765C0
    void wdu(Stream* a);  // RVA: 0x67B4B0
    ObscuredFileWriteResult wdt(Byte[][] a);  // RVA: 0x67AFB0
};

// Namespace: <global>
class dbh
{
public:
    // Static fields
    // static int32_t bmpd;
    // static int32_t bmpe;
    // static Byte[][] bmpf;


    // Methods
    static uint32_t ivj(Byte[][] a);  // RVA: 0x67C1C0
    static uint32_t haz(Stream* a);  // RVA: 0x67C040
    static uint32_t otp(Stream* a);  // RVA: 0x67C450
    static uint32_t sg(Stream* a);  // RVA: 0x67C080
    static uint32_t wdz(Stream* a);  // RVA: 0x67C080
    static uint32_t wec(Stream* a);  // RVA: 0x67C080
    static void nvo(Stream* a, Stream* b, dbp* c);  // RVA: 0x67C3A0
    static uint32_t wee(Byte[][] a);  // RVA: 0x67C600
    static void wed(Stream* a, Stream* b, dbp* c);  // RVA: 0x67BBD0
    static void vz(Stream* a, Stream* b, dbp* c);  // RVA: 0x67BBD0
    static void fin(Stream* a, Stream* b, dbp* c);  // RVA: 0x67BD80
    static void emy(Stream* a, Stream* b, dbp* c);  // RVA: 0x67BBD0
    static void fuq(Stream* a, Stream* b, dbp* c);  // RVA: 0x67BF40
    static void ehi(Stream* a, Stream* b, dbp* c);  // RVA: 0x67BAD0
    static uint32_t fqv(Stream* a);  // RVA: 0x67BE70
    static uint32_t wea(Stream* a);  // RVA: 0x67C490
    static void bjj(Stream* a, Stream* b, dbp* c);  // RVA: 0x67B8E0
    static uint32_t day(Byte[][] a);  // RVA: 0x67BAB0
    static uint32_t ia(Stream* a);  // RVA: 0x67C080
    static uint32_t mqx(Stream* a);  // RVA: 0x67C080
    static uint32_t ilm(Byte[][] a);  // RVA: 0x67C1A0
    static void hys(Stream* a, uint32_t b);  // RVA: 0x67C0C0
    static void bdr(Stream* a, Stream* b, dbp* c);  // RVA: 0x67B830
    static void fee(Stream* a, Stream* b, dbp* c);  // RVA: 0x67BC80
    static void ltd(Stream* a, uint32_t b);  // RVA: 0x67C1E0
    static void wdy(Stream* a, Stream* b, dbp* c);  // RVA: 0x67BD80
    static void bjl(Stream* a, Stream* b, dbp* c);  // RVA: 0x67B990
    static uint32_t fsc(Stream* a);  // RVA: 0x67BF00
    static uint32_t hsl(Stream* a);  // RVA: 0x67C080
    static uint32_t bpx(Byte[][] a);  // RVA: 0x67BA90
    static void web(Stream* a, uint32_t b);  // RVA: 0x67C520
    static void wdx(Stream* a, Stream* b, dbp* c);  // RVA: 0x67BBD0
    static void fkw(Stream* a, uint32_t b);  // RVA: 0x67BD90
    static void nxn(Stream* a, Stream* b, dbp* c);  // RVA: 0x67BBD0
    static void nqw(Stream* a, uint32_t b);  // RVA: 0x67C2C0
    static void wef(Stream* a, Stream* b, dbp* c);  // RVA: 0x67C620
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileHeader
    {
    public:
        // Static fields
        // static uint8_t HeaderByte1;
        // static uint8_t HeaderByte2;
        // static uint8_t HeaderByte3;
        // static uint8_t HeaderByte4;
        // static uint8_t HeaderVersion;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t <Byte1>k__BackingField; // 0x0010
        uint8_t <Byte2>k__BackingField; // 0x0011
        uint8_t <Byte3>k__BackingField; // 0x0012
        uint8_t <Byte4>k__BackingField; // 0x0013
        uint8_t <Version>k__BackingField; // 0x0014
        ObscurationMode <ObscurationMode>k__BackingField; // 0x0015
    
        // Methods
        uint8_t get_Byte1();  // RVA: 0x668240
        void set_Byte1(uint8_t value);  // RVA: 0x6682E0
        uint8_t get_Byte2();  // RVA: 0x668290
        void set_Byte2(uint8_t value);  // RVA: 0x6682F0
        uint8_t get_Byte3();  // RVA: 0x6682A0
        void set_Byte3(uint8_t value);  // RVA: 0x668300
        uint8_t get_Byte4();  // RVA: 0x6682B0
        void set_Byte4(uint8_t value);  // RVA: 0x668310
        uint8_t get_Version();  // RVA: 0x6682D0
        void set_Version(uint8_t value);  // RVA: 0x668330
        ObscurationMode get_ObscurationMode();  // RVA: 0x6682C0
        void set_ObscurationMode(ObscurationMode value);  // RVA: 0x668320
        bool IsValid();  // RVA: 0x668260
        void weg(Stream* a);  // RVA: 0x668340
        static void weh(Stream* a, ObscurationMode b);  // RVA: 0x668400
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileErrorCode
    {
    public:
        // Static fields
        // static ObscuredFileErrorCode NoError;
        // static ObscuredFileErrorCode FileNotFound;
        // static ObscuredFileErrorCode FileDamaged;
        // static ObscuredFileErrorCode DataIsNotLocked;
        // static ObscuredFileErrorCode NotInitialized;
        // static ObscuredFileErrorCode OtherException;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileError
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        ObscuredFileErrorCode <ErrorCode>k__BackingField; // 0x0010
        uint8_t pad_0011[0x7]; // 0x0011
        Exception* <Exception>k__BackingField; // 0x0018
    
        // Methods
        ObscuredFileErrorCode get_ErrorCode();  // RVA: 0x668240
        Exception* get_Exception();  // RVA: 0x668250
        void .ctor(ObscuredFileErrorCode code);  // RVA: 0x668220
        void .ctor(Exception* exception);  // RVA: 0x668210
        Il2CppString* ToString();  // RVA: 0x668130
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileReadResult
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        Byte[][] <Data>k__BackingField; // 0x0010
        uint8_t pad_0011[0x7]; // 0x0011
        bool <DataIsNotGenuine>k__BackingField; // 0x0018
        bool <DataFromAnotherDevice>k__BackingField; // 0x0019
        uint8_t pad_001A[0x6]; // 0x001A
        ObscuredFileError <Error>k__BackingField; // 0x0020
        uint8_t pad_0021[0xF]; // 0x0021
        bool <IsValid>k__BackingField; // 0x0030
    
        // Methods
        bool wei();  // RVA: 0x668820
        Byte[][] get_Data();  // RVA: 0x6687F0
        bool wej();  // RVA: 0x668850
        bool get_DataIsNotGenuine();  // RVA: 0x6687E0
        bool get_DataFromAnotherDevice();  // RVA: 0x6687D0
        ObscuredFileError get_Error();  // RVA: 0x668800
        bool get_IsValid();  // RVA: 0x668810
        void .ctor(Byte[][] data, bool dataIsNotGenuine, bool dataFromAnotherDevice);  // RVA: 0x668780
        void .ctor(ObscuredFileError error);  // RVA: 0x668730
        static ObscuredFileReadResult wek(Exception* a);  // RVA: 0x668860
        static ObscuredFileReadResult wel(ObscuredFileErrorCode a);  // RVA: 0x6688E0
        Il2CppString* ToString();  // RVA: 0x6684C0
    };

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscuredFileWriteResult
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        ObscuredFileError <Error>k__BackingField; // 0x0010
        uint8_t pad_0011[0xF]; // 0x0011
        bool <IsValid>k__BackingField; // 0x0020
    
        // Methods
        bool wem();  // RVA: 0x668B00
        ObscuredFileError get_Error();  // RVA: 0x668AE0
        bool get_IsValid();  // RVA: 0x668AF0
        void .ctor(ObscuredFileErrorCode result);  // RVA: 0x668A90
        void .ctor(ObscuredFileError error);  // RVA: 0x668A60
        static ObscuredFileWriteResult wen(Exception* a);  // RVA: 0x668B10
        static ObscuredFileWriteResult weo(ObscuredFileErrorCode a);  // RVA: 0x668B60
        Il2CppString* ToString();  // RVA: 0x668960
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbi
{
public:
    // Static fields
    // static Il2CppString* bmpg;
    // static Il2CppString* bmph;
    // static Action* bmpi;
    // static Action* bmpj;
    // static dbg* bmpk;
    // static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> bmpl;
    // static Il2CppObject* bmpm;
    // static bool <bmpn>k__BackingField;
    // static bool <bmpo>k__BackingField;
    // static bool <bmpp>k__BackingField;
    // static ObscuredFileReadResult <bmpq>k__BackingField;
    // static ObscuredFileWriteResult <bmpr>k__BackingField;
    // static dbl* <bmps>k__BackingField;


    // Methods
    static void dmk();  // RVA: 0x67D8E0
    static void bza(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x67D070
    static void hqg(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x67F940
    static void wgj(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x686E60
    static dbq* wet();  // RVA: 0x684B70
    static bool wew();  // RVA: 0x684C70
    static void hbg();  // RVA: 0x67F160
    static b wfw(Il2CppString* a, b b);  // RVA: 0x564EA0
    static void wfz();  // RVA: 0x686270
    static void jzf(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x6810B0
    static void wez(bool a);  // RVA: 0x684D80
    static ObscuredUShort har(Il2CppString* a, ObscuredUShort b);  // RVA: 0x67F0A0
    static void mul(Il2CppString* a, ObscuredUInt b);  // RVA: 0x683130
    static bool wey();  // RVA: 0x684D30
    static bool lhu(Il2CppString* a);  // RVA: 0x681E50
    static bool wfa();  // RVA: 0x684DE0
    static ObscuredLong mgm(Il2CppString* a, ObscuredLong b);  // RVA: 0x682CD0
    static ObscuredVector2 kqf(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x681430
    static dbl* wfh();  // RVA: 0x6850D0
    static void fkf(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x67E400
    static void jqc(Il2CppString* a, ObscuredInt b);  // RVA: 0x680F10
    static ObscuredDateTime bvm(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x67CFB0
    static dbg* wfj();  // RVA: 0x685190
    static ObscuredGuid eju(Il2CppString* a, ObscuredGuid b);  // RVA: 0x67DC40
    static ObscuredVector3 why(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x688AB0
    static void evd(dbq* a, bool b);  // RVA: 0x67DF60
    static void eyu(Il2CppString* a, dbq* b, bool c);  // RVA: 0x67E000
    static void kca(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x681220
    static bool wfr(Il2CppString* a);  // RVA: 0x685D00
    static void mvm(Il2CppString* a, ObscuredBool b);  // RVA: 0x683240
    static void wfl(Il2CppString* a, bool b);  // RVA: 0x685360
    static ObscuredDecimal whi(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x687E20
    static ObscuredQuaternion nsc(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x683D70
    static System.Collections.Generic.ICollection<System.String> wfs();  // RVA: 0x685D80
    static void .cctor();  // RVA: 0x67CAC0
    static void opd(Il2CppString* a, ObscuredLong b);  // RVA: 0x6842A0
    static ObscuredVector2Int hhd(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x67F7E0
    static void hqe(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x67F8A0
    static void wgx(Il2CppString* a, ObscuredULong b);  // RVA: 0x6876C0
    static void ieu(Il2CppString* a, ObscuredByte b);  // RVA: 0x6802B0
    static ObscuredBigInteger whj(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x687F20
    static void eud(Il2CppString* a, ObscuredByte b);  // RVA: 0x67DEE0
    static ObscuredChar iku(Il2CppString* a, ObscuredChar b);  // RVA: 0x680510
    static void wgt(Il2CppString* a, ObscuredSByte b);  // RVA: 0x6874B0
    static ObscuredShort whr(Il2CppString* a, ObscuredShort b);  // RVA: 0x6885B0
    static void wgq(Il2CppString* a, ObscuredInt b);  // RVA: 0x6872F0
    static void ihg(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x6803E0
    static void gfk(Il2CppString* a);  // RVA: 0x67EA40
    static ObscuredVector3 ola(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x6840F0
    static void wer(Action* a);  // RVA: 0x684970
    static ObscuredUInt cmg(Il2CppString* a, ObscuredUInt b);  // RVA: 0x67D5B0
    static void npl(Il2CppString* a, ObscuredULong b);  // RVA: 0x683CE0
    static ObscuredVector2Int lrb(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x6823D0
    static ObscuredByte lz(Il2CppString* a, ObscuredByte b);  // RVA: 0x682A20
    static void wha(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x687880
    static void lhv(Il2CppString* a, ObscuredChar b);  // RVA: 0x681ED0
    static void wfg(ObscuredFileWriteResult a);  // RVA: 0x685050
    static void wgo(Il2CppString* a, ObscuredFloat b);  // RVA: 0x6871A0
    static ObscuredChar lab(Il2CppString* a, ObscuredChar b);  // RVA: 0x681D90
    static void gfc(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x67E990
    static void wgw(Il2CppString* a, ObscuredUInt b);  // RVA: 0x687640
    static void hfw(Il2CppString* a, dbq* b, bool c);  // RVA: 0x67F540
    static void wev(bool a);  // RVA: 0x684C10
    static void wfb(bool a);  // RVA: 0x684E30
    static ObscuredFileWriteResult kuh(Byte[][] a);  // RVA: 0x6815C0
    static void whb(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x687910
    static void whc(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x6879C0
    static void ngd(Il2CppString* a, ObscuredUShort b);  // RVA: 0x683920
    static ObscuredByte whe(Il2CppString* a, ObscuredByte b);  // RVA: 0x687B30
    static void ouh(Il2CppString* a, ObscuredString* b);  // RVA: 0x684330
    static void lnu(Il2CppString* a, dbq* b, bool c);  // RVA: 0x682130
    static ObscuredDateTimeOffset whh(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x687D30
    static void wfm(dbq* a, bool b);  // RVA: 0x6853F0
    static void wgv(Il2CppString* a, ObscuredString* b);  // RVA: 0x6875C0
    static void hzd();  // RVA: 0x67FBE0
    static ObscuredFileReadResult rg();  // RVA: 0x6843B0
    static ObscuredFileWriteResult wff();  // RVA: 0x684FE0
    static System.Collections.Generic.ICollection<System.String> dku();  // RVA: 0x67D860
    static ObscuredFileWriteResult wgb();  // RVA: 0x686720
    static ObscuredFileReadResult gjz();  // RVA: 0x67EB30
    static void bqt(Il2CppString* a, ObscuredBool b);  // RVA: 0x67CDF0
    static void hen(Il2CppString* a, ObscuredGuid b);  // RVA: 0x67F490
    static ObscuredString* whs(Il2CppString* a, ObscuredString* b);  // RVA: 0x688670
    static ObscuredUInt wht(Il2CppString* a, ObscuredUInt b);  // RVA: 0x6886F0
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wga();  // RVA: 0x6862E0
    static void wgd(Il2CppString* a, d b);  // RVA: 0x564EA0
    static void flb(Il2CppString* a, ObscuredInt b);  // RVA: 0x67E4B0
    static void wgp(Il2CppString* a, ObscuredGuid b);  // RVA: 0x687240
    static bool Save();  // RVA: 0x67C720
    static void wgu(Il2CppString* a, ObscuredShort b);  // RVA: 0x687530
    static ObscuredVector2Int whx(Il2CppString* a, ObscuredVector2Int b);  // RVA: 0x6889F0
    static void wgm(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x687050
    static void wgz(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x6877E0
    static void ftd(Il2CppString* a, ObscuredShort b);  // RVA: 0x67E530
    static void kbh(bool a);  // RVA: 0x681160
    static void wgn(Il2CppString* a, ObscuredDouble b);  // RVA: 0x687100
    static void lry(dbq* a, bool b);  // RVA: 0x682490
    static ObscuredBigInteger ceb(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x67D1C0
    static void kyf(Il2CppString* a, ObscuredChar b);  // RVA: 0x681C40
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> lxr();  // RVA: 0x682530
    static void wft(Il2CppString* a);  // RVA: 0x685E00
    static ObscuredFileReadResult wge();  // RVA: 0x6868C0
    static ObscuredUInt b(Il2CppString* a, ObscuredUInt b);  // RVA: 0x67CB40
    static void mvy();  // RVA: 0x6832D0
    static void vm(Il2CppString* a, ObscuredUShort b);  // RVA: 0x684700
    static void wgy(Il2CppString* a, ObscuredUShort b);  // RVA: 0x687750
    static void wfe(ObscuredFileReadResult a);  // RVA: 0x684F50
    static ObscuredSByte dk(Il2CppString* a, ObscuredSByte b);  // RVA: 0x67D7E0
    static void wgg(Il2CppString* a, ObscuredBool b);  // RVA: 0x686CC0
    static ObscuredUShort bht(Il2CppString* a, ObscuredUShort b);  // RVA: 0x67CD30
    static void wfo();  // RVA: 0x685730
    static ObscuredFloat whl(Il2CppString* a, ObscuredFloat b);  // RVA: 0x688100
    static void lkg(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x681F60
    static void hxb(Il2CppString* a);  // RVA: 0x67F9F0
    static ObscuredDouble whk(Il2CppString* a, ObscuredDouble b);  // RVA: 0x688020
    static bool ibh();  // RVA: 0x67FF10
    static bool kyb();  // RVA: 0x6818A0
    static ObscuredSByte bvf(Il2CppString* a, ObscuredSByte b);  // RVA: 0x67CF30
    static dbg* gds(Il2CppString* a, dbq* b);  // RVA: 0x67E7F0
    static ObscuredQuaternion oeb(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x683FF0
    static void wfq(bool a);  // RVA: 0x685C20
    static ObscuredVector2 whw(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x688920
    static ObscuredGuid mpd(Il2CppString* a, ObscuredGuid b);  // RVA: 0x682E90
    static ObscuredFileWriteResult elm();  // RVA: 0x67DD40
    static ObscuredBool whd(Il2CppString* a, ObscuredBool b);  // RVA: 0x687A70
    static ObscuredString* iql(Il2CppString* a, ObscuredString* b);  // RVA: 0x6805D0
    static void cab(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x67D120
    static ObscuredQuaternion whp(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x688430
    static void wfv(Il2CppString* a, a b);  // RVA: 0x564EA0
    static void brk(Il2CppString* a, ObscuredVector3 b);  // RVA: 0x67CE80
    static ObscuredSByte whq(Il2CppString* a, ObscuredSByte b);  // RVA: 0x688530
    static ObscuredLong cfb(Il2CppString* a, ObscuredLong b);  // RVA: 0x67D2C0
    static void bgv(Il2CppString* a, bool b);  // RVA: 0x67CCA0
    static ObscuredInt kgk(Il2CppString* a, ObscuredInt b);  // RVA: 0x6812D0
    static ObscuredQuaternion mim(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x682D90
    static void wgr(Il2CppString* a, ObscuredLong b);  // RVA: 0x687370
    static ObscuredDateTime csz(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x67D720
    static void jqg(Il2CppString* a, ObscuredByte b);  // RVA: 0x680F90
    static bool cgl(Il2CppString* a);  // RVA: 0x67D530
    static void ifi(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x680330
    static void ngh();  // RVA: 0x6839B0
    static ObscuredInt whn(Il2CppString* a, ObscuredInt b);  // RVA: 0x6882C0
    static ObscuredULong cri(Il2CppString* a, ObscuredULong b);  // RVA: 0x67D660
    static void izg(Il2CppString* a, ObscuredFloat b);  // RVA: 0x6807D0
    static void mus(Il2CppString* a, ObscuredUShort b);  // RVA: 0x6831B0
    static ObscuredString* gem(Il2CppString* a, ObscuredString* b);  // RVA: 0x67E910
    static void kul(bool a);  // RVA: 0x6817E0
    static void gta(Il2CppString* a, ObscuredUShort b);  // RVA: 0x67EF80
    static void hyk(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x67FAE0
    static ObscuredVector3Int jpk(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x680E10
    static ObscuredFloat isz(Il2CppString* a, ObscuredFloat b);  // RVA: 0x680650
    static ObscuredSByte fes(Il2CppString* a, ObscuredSByte b);  // RVA: 0x67E380
    static Il2CppString* wfc();  // RVA: 0x684E90
    static void kru(bool a);  // RVA: 0x681500
    static ObscuredGuid dom(Il2CppString* a, ObscuredGuid b);  // RVA: 0x67DAA0
    static ObscuredDateTime whg(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x687C70
    static void lxt(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x682970
    static void wgl(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x686FA0
    static ObscuredFileWriteResult mtn();  // RVA: 0x682F90
    static ObscuredVector3Int whz(Il2CppString* a, ObscuredVector3Int b);  // RVA: 0x688BB0
    static void ta(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x684650
    static void weq(Action* a);  // RVA: 0x684880
    static bool wex();  // RVA: 0x684CD0
    static ObscuredGuid nyu(Il2CppString* a, ObscuredGuid b);  // RVA: 0x683E70
    static void dx(Il2CppString* a, ObscuredDouble b);  // RVA: 0x67DBA0
    static void wfk(bool a);  // RVA: 0x6852A0
    static void jpe(Il2CppString* a, ObscuredDouble b);  // RVA: 0x680D70
    static ObscuredString* iik(Il2CppString* a, ObscuredString* b);  // RVA: 0x680490
    static ObscuredFloat kyp(Il2CppString* a, ObscuredFloat b);  // RVA: 0x681CD0
    static void wfu();  // RVA: 0x685EF0
    static void yl(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x688CB0
    static bool weu();  // RVA: 0x684BC0
    static void ncb(Il2CppString* a, ObscuredFloat b);  // RVA: 0x6837C0
    static void cfv(Il2CppString* a);  // RVA: 0x67D440
    static ObscuredULong whu(Il2CppString* a, ObscuredULong b);  // RVA: 0x6887A0
    static ObscuredULong fuz(Il2CppString* a, ObscuredULong b);  // RVA: 0x67E5C0
    static void wgs(Il2CppString* a, ObscuredQuaternion b);  // RVA: 0x687400
    static ObscuredDateTime nff(Il2CppString* a, ObscuredDateTime b);  // RVA: 0x683860
    static c wgc(Il2CppString* a, c b);  // RVA: 0x564EA0
    static ObscuredFileReadResult wfd();  // RVA: 0x684EE0
    static ObscuredGuid whm(Il2CppString* a, ObscuredGuid b);  // RVA: 0x6881C0
    static void mxf();  // RVA: 0x683490
    static ObscuredFileWriteResult wgf(Byte[][] a);  // RVA: 0x686AA0
    static void gqk(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x67EEE0
    static void wgi(Il2CppString* a, ObscuredChar b);  // RVA: 0x686DD0
    static dbg* lnt(Il2CppString* a, dbq* b);  // RVA: 0x682010
    static void wfi(dbl* a);  // RVA: 0x685120
    static ObscuredFileWriteResult mbp();  // RVA: 0x682B30
    static ObscuredFloat cfe(Il2CppString* a, ObscuredFloat b);  // RVA: 0x67D380
    static ObscuredInt onk(Il2CppString* a, ObscuredInt b);  // RVA: 0x6841F0
    static ObscuredLong who(Il2CppString* a, ObscuredLong b);  // RVA: 0x688370
    static void wes(Action* a);  // RVA: 0x684A70
    static void wgh(Il2CppString* a, ObscuredByte b);  // RVA: 0x686D50
    static void gye(Il2CppString* a, ObscuredLong b);  // RVA: 0x67F010
    static ObscuredULong gcd(Il2CppString* a, ObscuredULong b);  // RVA: 0x67E730
    static void wfn(Il2CppString* a, dbq* b, bool c);  // RVA: 0x685490
    static void wfy();  // RVA: 0x686200
    static ObscuredChar sc(Il2CppString* a, ObscuredChar b);  // RVA: 0x684590
    static ObscuredVector2 gqi(Il2CppString* a, ObscuredVector2 b);  // RVA: 0x67EE10
    static ObscuredDecimal gnw(Il2CppString* a, ObscuredDecimal b);  // RVA: 0x67ED10
    static void wfp();  // RVA: 0x6858F0
    static ObscuredUInt bcj(Il2CppString* a, ObscuredUInt b);  // RVA: 0x67CBF0
    static void jgu(bool a);  // RVA: 0x680CB0
    static ObscuredUInt kiq(Il2CppString* a, ObscuredUInt b);  // RVA: 0x681380
    static void lzx(Il2CppString* a, ObscuredLong b);  // RVA: 0x682AA0
    static void wep(Action* a);  // RVA: 0x684790
    static ObscuredFloat iwc(Il2CppString* a, ObscuredFloat b);  // RVA: 0x680710
    static ObscuredUShort whv(Il2CppString* a, ObscuredUShort b);  // RVA: 0x688860
    static void odr(Il2CppString* a, ObscuredByte b);  // RVA: 0x683F70
    static void wgk(Il2CppString* a, ObscuredDateTimeOffset b);  // RVA: 0x686EF0
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> jem();  // RVA: 0x680870
    static dbg* wfx(Il2CppString* a, dbq* b);  // RVA: 0x6860E0
    static ObscuredChar whf(Il2CppString* a, ObscuredChar b);  // RVA: 0x687BB0
    static void jye(dbq* a, bool b);  // RVA: 0x681010
    static void hyq();  // RVA: 0x67FB70
    static void fzl(Il2CppString* a, ObscuredBigInteger b);  // RVA: 0x67E680
    static void fcu(bool a);  // RVA: 0x67E2A0
};

// Namespace: <global>
class dbj
{
public:
    // Static fields
    // static bool bmpt;


    // Methods
    static void wid(bool a);  // RVA: 0x6893B0
    static void bml(bool a);  // RVA: 0x688D80
    static void ohx(bool a);  // RVA: 0x688E80
    static bool wib();  // RVA: 0x688D60
    static void wia();  // RVA: 0x688F70
    static void wif();  // RVA: 0x6894B0
    static bool bbu();  // RVA: 0x688D60
    static void wic(bool a);  // RVA: 0x688E70
    static void byy(bool a);  // RVA: 0x688E70
    static void wie(bool a);  // RVA: 0x6893C0
};

// Namespace: <global>
class dbk
{
public:

    // Methods
    static b wih(ObscuredPrefsData a, dbl* b);  // RVA: 0x564EA0
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> nbo(Byte[][] a, dbl* b);  // RVA: 0x689610
    static Byte[][] wii(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a, dbl* b);  // RVA: 0x689680
    static System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wij(Byte[][] a, dbl* b);  // RVA: 0x689760
    static dbn* wik(dbl* a);  // RVA: 0x6897D0
    static ObscuredPrefsData wig(a a, dbl* b);  // RVA: 0x564EA0
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct ACTkSerializationKind
    {
    public:
        // Static fields
        // static ACTkSerializationKind Binary;
    
        uint8_t pad_0000[0x10]; // 0x0000
        int32_t value__; // 0x0010
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbl
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    ACTkSerializationKind <bmpu>k__BackingField; // 0x0010

    // Methods
    ACTkSerializationKind wil();  // RVA: 0x667D80
    void .ctor(ACTkSerializationKind a);  // RVA: 0x674D60
};

// Namespace: <global>
class dbm
{
public:
    // Static fields
    // static uint8_t bmpv;
    // static dbm* bmpw;


    // Methods
    void wir(BinaryWriter* a, Il2CppString* b, ObscuredPrefsData c);  // RVA: 0x69E270
    Byte[][] wip(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a);  // RVA: 0x69DA70
    static dbn* mrb();  // RVA: 0x69D950
    static dbn* kme();  // RVA: 0x69D8C0
    void .ctor();  // RVA: 0x629570
    b wio(ObscuredPrefsData a);  // RVA: 0x564EA0
    static dbn* dlm();  // RVA: 0x69D610
    System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wiq(Byte[][] a);  // RVA: 0x69DE60
    static dbn* wim();  // RVA: 0x69D9E0
    System.ValueTuple<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wis(BinaryReader* a);  // RVA: 0x69E310
    ObscuredPrefsData win(a a);  // RVA: 0x564EA0
    System.ValueTuple<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> ffc(BinaryReader* a);  // RVA: 0x69D6A0
    System.ValueTuple<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> jph(BinaryReader* a);  // RVA: 0x69D7B0
};

// Namespace: <global>
class dbn
{
public:

    // Methods
    ObscuredPrefsData win(a a);  // RVA: 0x564EA0
    b wio(ObscuredPrefsData a);  // RVA: 0x564EA0
    Byte[][] wip(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a);  // RVA: 0x41BD30
    System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wiq(Byte[][] a);  // RVA: 0x41BD30
};

// Namespace: <global>
class dbo
{
public:
    // Static fields
    // static dbo* bmpx;


    // Methods
    void .ctor();  // RVA: 0x629570
    static dbn* jnm();  // RVA: 0x69E540
    b wio(ObscuredPrefsData a);  // RVA: 0x564EA0
    static dbn* ewl();  // RVA: 0x69E420
    Byte[][] wip(System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> a);  // RVA: 0x69E660
    static dbn* wit();  // RVA: 0x69E6E0
    ObscuredPrefsData win(a a);  // RVA: 0x564EA0
    static dbn* mpv();  // RVA: 0x69E5D0
    System.Collections.Generic.Dictionary<System.String,CodeStage.AntiCheat.Storage.ObscuredPrefsData> wiq(Byte[][] a);  // RVA: 0x69E6A0
    static dbn* hts();  // RVA: 0x69E4B0
};

namespace CodeStage.AntiCheat.Storage
{

    // Namespace: CodeStage.AntiCheat.Storage
    struct ObscurationMode
    {
    public:
        // Static fields
        // static ObscurationMode Plain;
        // static ObscurationMode Encrypted;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

} // namespace CodeStage.AntiCheat.Storage

// Namespace: <global>
class dbp
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    ObscurationMode <bmpy>k__BackingField; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Byte[][] <bmpz>k__BackingField; // 0x0018

    // Methods
    ObscurationMode wiu();  // RVA: 0x668AF0
    Byte[][] wiv();  // RVA: 0x69E850
    void .ctor(Il2CppString* a);  // RVA: 0x69E770
    void .ctor(Byte[][] a);  // RVA: 0x69E800
};

// Namespace: <global>
class dbq
{
public:

    // Methods
    ObscuredFileLocation wiw();  // RVA: 0x423890
    dbp* wix();  // RVA: 0x41ED50
    dbf* wiy();  // RVA: 0x41ED50
    bool wiz();  // RVA: 0x423890
    bool wja();  // RVA: 0x423890
};

