// ============================================================
// Image: Assembly-CSharp.dll
// ============================================================

// Namespace: <global>
class b : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Unit* OwnerUnit; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Animator* Animatior; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    EUNITSTATE bavp; // 0x0030

    // Methods
    void nmc(Il2CppString* a);  // RVA: 0x80E9E0
    void ofa(float a);  // RVA: 0x80E9C0
    void dtm(float a);  // RVA: 0x80E9C0
    void hxa(Il2CppString* a);  // RVA: 0x80E9E0
    void Awake();  // RVA: 0x80E900
    void eeu(float a);  // RVA: 0x80E9C0
    void dtl(EUNITSTATE a);  // RVA: 0x41AAF0
    void hsw(float a);  // RVA: 0x80E9C0
    void kll(Il2CppString* a);  // RVA: 0x80E9E0
    void hoy(float a);  // RVA: 0x80E9C0
    void Update();  // RVA: 0x634510
    void .ctor();  // RVA: 0x629A00
    void dtn(Il2CppString* a);  // RVA: 0x80E9E0
};

// Namespace: <global>
class c : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Action* OnACTIVE; // 0x0020

    // Methods
    void dto(Action* a);  // RVA: 0x816070
    void dtp();  // RVA: 0x816110
    void .ctor();  // RVA: 0x629A00
    void ili();  // RVA: 0x816110
    void fcx(Action* a);  // RVA: 0x816130
    void grc(Action* a);  // RVA: 0x8161D0
    void lqk(Action* a);  // RVA: 0x816270
};

// Namespace: <global>
class g
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bavq; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* bavr; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    FlickerController* bavs; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float bavt; // 0x0028

    // Methods
    void .ctor(int32_t a);  // RVA: 0x674D60
    void dtq();  // RVA: 0x634510
    bool MoveNext();  // RVA: 0x816310
    Il2CppObject* dtr();  // RVA: 0x69E850
    void dts();  // RVA: 0x816450
    Il2CppObject* dtt();  // RVA: 0x69E850
};

// Namespace: <global>
class FlickerController : public MonoBehaviour
{
public:
    // Static fields
    // static MaterialPropertyBlock* bavu;
    // static int32_t bavv;

    uint8_t pad_0000[0x20]; // 0x0000
    SpriteRenderer* m_spriteRenderer; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float m_targetValue; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    float m_flickTime; // 0x002C
    uint8_t pad_002D[0x3]; // 0x002D
    Coroutine* bavw; // 0x0030

    // Methods
    void Awake();  // RVA: 0x803E70
    void dtu();  // RVA: 0x803FB0
    void dtv();  // RVA: 0x804050
    IEnumerator* dtw();  // RVA: 0x8040A0
    void dtx(float a);  // RVA: 0x804110
    void .ctor();  // RVA: 0x629A00
    static void .cctor();  // RVA: 0x803F40
};

// Namespace: <global>
class h : public MonoBehaviour
{
public:

    // Methods
    void Start();  // RVA: 0x634510
    void cmz();  // RVA: 0x634510
    void .ctor();  // RVA: 0x629A00
    void Update();  // RVA: 0x634510
    void fve();  // RVA: 0x634510
};

// Namespace: <global>
class k : public b
{
public:

    // Methods
    void Update();  // RVA: 0x816490
    void dtl(EUNITSTATE a);  // RVA: 0x816560
    void .ctor();  // RVA: 0x629A00
};

// Namespace: <global>
class m : public MonoBehaviour
{
public:

    // Methods
    void hoo();  // RVA: 0x634510
    void .ctor();  // RVA: 0x629A00
    void Update();  // RVA: 0x634510
    void lti();  // RVA: 0x634510
    void obo();  // RVA: 0x634510
    void fgs();  // RVA: 0x634510
    void Start();  // RVA: 0x634510
};

// Namespace: <global>
class HpBar : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    RectTransform* rect_m; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Slider* slider; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Image* image_Fillarea; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Unit* unit_Attach; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Vector3 monsterOffset; // 0x0040
    uint8_t pad_0041[0xB]; // 0x0041
    Vector3 heroOffset; // 0x004C
    uint8_t pad_004D[0xB]; // 0x004D
    Color color_Monster; // 0x0058
    uint8_t pad_0059[0xF]; // 0x0059
    Color color_Hero; // 0x0068

    // Methods
    void dty(Unit* a);  // RVA: 0x8056B0
    void Update();  // RVA: 0x8055B0
    void dtz();  // RVA: 0x8057E0
    void dua(float a);  // RVA: 0x805910
    void dub();  // RVA: 0x805960
    void .ctor();  // RVA: 0x805600
};

// Namespace: <global>
class n : public b
{
public:

    // Methods
    void dtl(EUNITSTATE a);  // RVA: 0x816720
    void .ctor();  // RVA: 0x629A00
};

// Namespace: <global>
struct EUNITSTATE
{
public:
    // Static fields
    // static EUNITSTATE NONE;
    // static EUNITSTATE IDLE;
    // static EUNITSTATE MOVE;
    // static EUNITSTATE RETURN_TO_POSITION;
    // static EUNITSTATE ATTACK;
    // static EUNITSTATE REVIVE;
    // static EUNITSTATE DIE;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
struct EATTACKSTATE
{
public:
    // Static fields
    // static EATTACKSTATE PREDELAY;
    // static EATTACKSTATE ACTIONTIME;
    // static EATTACKSTATE POSTDELAY;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
struct TextDisplayPosition
{
public:
    // Static fields
    // static TextDisplayPosition Center;
    // static TextDisplayPosition Top;
    // static TextDisplayPosition Bottom;
    // static TextDisplayPosition TopOffset;
    // static TextDisplayPosition CenterUp;
    // static TextDisplayPosition CenterDown;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
class o
{
public:
    // Static fields
    // static intptr_t bavx;
    // static int32_t bavy;
    // static int32_t bavz;


    // Methods
    static void nq(Il2CppString* a, bool b);  // RVA: 0x8177B0
    static int32_t RegOpenKeyEx(intptr_t hKey, Il2CppString* lpSubKey, int32_t ulOptions, int32_t samDesired, intptr_t phkResult);  // RVA: 0x816A50
    static void .cctor();  // RVA: 0x816C10
    void .ctor();  // RVA: 0x629570
    static void duc(Il2CppString* a, bool b);  // RVA: 0x816C70
    static uint32_t GetModuleFileName(intptr_t hModule, StringBuilder* lpFilename, int32_t nSize);  // RVA: 0x816860
    static int32_t RegCloseKey(intptr_t hKey);  // RVA: 0x816930
    static int32_t RegDeleteValue(intptr_t hKey, Il2CppString* lpValueName);  // RVA: 0x8169B0
    static void gfi(Il2CppString* a, bool b);  // RVA: 0x8173F0
    static int32_t RegSetValueEx(intptr_t hKey, Il2CppString* lpValueName, int32_t Reserved, int32_t dwType, Il2CppString* lpData, int32_t cbData);  // RVA: 0x816B20
    static void ry(Il2CppString* a, bool b);  // RVA: 0x817B70
    static void ejk(Il2CppString* a, bool b);  // RVA: 0x817030
};

// Namespace: <global>
class MonitorEnumDelegate : public MulticastDelegate
{
public:

    // Methods
    void .ctor(Il2CppObject* object, intptr_t method);  // RVA: 0x806390
    bool Invoke(intptr_t hMonitor, intptr_t hdcMonitor, intptr_t lprcMonitor, intptr_t dwData);  // RVA: 0x806370
    IAsyncResult* BeginInvoke(intptr_t hMonitor, intptr_t hdcMonitor, intptr_t lprcMonitor, intptr_t dwData, AsyncCallback* callback, Il2CppObject* object);  // RVA: 0x806290
    bool EndInvoke(IAsyncResult* result);  // RVA: 0x806340
};

// Namespace: <global>
class p : public MonoBehaviour
{
public:
    // Static fields
    // static uint32_t bawa;
    // static int32_t bawb;
    // static int32_t bawc;
    // static RECT bawd;


    // Methods
    void ncl();  // RVA: 0x818A20
    void OnApplicationFocus(bool hasFocus);  // RVA: 0x8181A0
    void ihb();  // RVA: 0x818950
    void eut();  // RVA: 0x818880
    void px();  // RVA: 0x818AF0
    static intptr_t MonitorFromWindow(intptr_t hwnd, uint32_t dwFlags);  // RVA: 0x818110
    void .ctor();  // RVA: 0x629A00
    void dfs(bool hasFocus);  // RVA: 0x8181A0
    static bool GetMonitorInfo(intptr_t hMonitor, MONITORINFO lpmi);  // RVA: 0x817FF0
    static bool EnumDisplayMonitors(intptr_t hdc, intptr_t lprcClip, MonitorEnumDelegate* lpfnEnum, intptr_t dwData);  // RVA: 0x817F30
    void hmi(bool hasFocus);  // RVA: 0x8181A0
    void dud();  // RVA: 0x8181B0
    void ikg(bool hasFocus);  // RVA: 0x8181A0
    void dos(bool hasFocus);  // RVA: 0x8181A0
    static bool GetWindowRect(intptr_t hwnd, RECT rect);  // RVA: 0x818080
    static bool due(intptr_t a, intptr_t b, intptr_t c, intptr_t d);  // RVA: 0x8185A0
    void duf();  // RVA: 0x8187B0
};

// Namespace: <global>
class BoxEffectController : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    System.Collections.Generic.List<SpriteAnimation_Image> animationLists; // 0x0020

    // Methods
    void dug(int32_t a);  // RVA: 0x803870
    bool duh();  // RVA: 0x803A70
    void OnDisable();  // RVA: 0x803780
    void .ctor();  // RVA: 0x629A00
};

// Namespace: <global>
class q : public MonoBehaviour
{
public:

    // Methods
    void OnPointerDown(PointerEventData* eventData);  // RVA: 0x634510
    void OnPointerUp(PointerEventData* eventData);  // RVA: 0x634510
    void .ctor();  // RVA: 0x629A00
};

// Namespace: <global>
class ItemSlotDirectMovePreview : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    RectTransform* RectTransform; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Image* m_hoverTargetImage; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Sprite* m_moveToTradingStashIcon; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Sprite* m_moveToCubeIcon; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Sprite* m_moveToInventoryIcon; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    Sprite* m_moveToStashIcon; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Sprite* m_moveToGearIcon; // 0x0050

    // Methods
    void dui(ESlotType a, ESlotType b);  // RVA: 0x805980
    void .ctor();  // RVA: 0x629A00
};

// Namespace: <global>
struct <DelayedAnimation>d__7
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    SelectHeroEffectController* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x80B080
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x80B070
};

// Namespace: <global>
class SelectHeroEffectController : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    SpriteAnimation_Image* spriteAnimationImage; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    SpriteAnimation_Image[][] effectObjects; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    int32_t targetFrame; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float delay; // 0x0034

    // Methods
    void Awake();  // RVA: 0x806520
    void OnDestroy();  // RVA: 0x806620
    void duj(int32_t a);  // RVA: 0x806760
    UniTaskVoid duk();  // RVA: 0x806820
    void dul();  // RVA: 0x8068B0
    void .ctor();  // RVA: 0x629A00
};

// Namespace: <global>
struct <DelayedAnimation>d__9
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    SelectHeroShakeFlashController* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x80B2E0
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x80B070
};

// Namespace: <global>
class SelectHeroShakeFlashController : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    SpriteAnimation_Image* spriteAnimationImage; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    int32_t targetFrame; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    SelectHeroOption* selectHeroOption; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    bool hasFlash; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Il2CppString* otherAnimKey; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    bool hasShake; // 0x0048
    uint8_t pad_0049[0x3]; // 0x0049
    float delay; // 0x004C

    // Methods
    void Awake();  // RVA: 0x806AF0
    void OnDestroy();  // RVA: 0x806BF0
    UniTaskVoid dum();  // RVA: 0x806E90
    void Play(int32_t frame);  // RVA: 0x806D30
    void Play();  // RVA: 0x806DF0
    void .ctor();  // RVA: 0x629A00
};

// Namespace: <global>
class r
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    SkillPointAnimationController* bawe; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    RectTransform* bawf; // 0x0018

    // Methods
    void ckc();  // RVA: 0x818BC0
    void .ctor();  // RVA: 0x629570
    void mrw();  // RVA: 0x818BC0
    void dun();  // RVA: 0x818BC0
};

// Namespace: <global>
class SkillPointAnimationController : public MonoBehaviour
{
public:
    // Static fields
    // static Color bawg;
    // static Color bawh;

    uint8_t pad_0000[0x20]; // 0x0000
    Image* m_sliderBarCover; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    GameObject* prefab; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Transform* poolHolder; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Transform[][] m_iconTargetPos; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    float m_animDurationTime; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    System.Collections.Generic.Queue<UnityEngine.RectTransform> bawi; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    System.Collections.Generic.List<UnityEngine.RectTransform> bawj; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    Tweener* bawk; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    ActiveSkillSlotDetail* bawl; // 0x0060

    // Methods
    void Awake();  // RVA: 0x806F20
    void duo();  // RVA: 0x8072D0
    void dup();  // RVA: 0x8073C0
    void duq(bool a);  // RVA: 0x8075E0
    void dur();  // RVA: 0x807840
    void dus();  // RVA: 0x807980
    void dut(Color a);  // RVA: 0x807AC0
    void duu(int32_t a, int32_t b);  // RVA: 0x807BA0
    RectTransform* duv();  // RVA: 0x8080D0
    void duw(RectTransform* a);  // RVA: 0x808210
    void OnDisable();  // RVA: 0x807050
    void .ctor();  // RVA: 0x807200
    static void .cctor();  // RVA: 0x8071A0
};

// Namespace: <global>
class ActSlot : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    int32_t act; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* text_ActName; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Button* btn; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    ToggleButton* button_toggle; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    float m_selectedCorrectionY; // 0x0040
    uint8_t pad_0041[0x3]; // 0x0041
    float m_unSelectedCorrectionY; // 0x0044
    uint8_t pad_0045[0x3]; // 0x0045
    Color m_selectedColor; // 0x0048
    uint8_t pad_0049[0xF]; // 0x0049
    Color m_unSelectedColor; // 0x0058
    uint8_t pad_0059[0xF]; // 0x0059
    System.Action<System.Int32> bawm; // 0x0068

    // Methods
    void dux(int32_t a, System.Action<System.Int32> b);  // RVA: 0x800BA0
    void duy();  // RVA: 0x800D00
    void duz(bool a);  // RVA: 0x800DE0
    void dva();  // RVA: 0x800EC0
    void .ctor();  // RVA: 0x629A00
};

// Namespace: <global>
class u : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    System.Collections.Generic.List<TaskbarHero.UI.AttributeSlot> attributeSlots; // 0x0020

    // Methods
    void .ctor();  // RVA: 0x818C70
};

// Namespace: <global>
class LogSlot : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    RectTransform* rt; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* Text_LogText; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Animator* animator; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    cba* feedback1; // 0x0038

    // Methods
    void dvb(Il2CppString* a, Vector2 b, GradeSO* c);  // RVA: 0x8060C0
    void offObject();  // RVA: 0x634510
    void dvc();  // RVA: 0x806230
    void .ctor();  // RVA: 0x629A00
};

// Namespace: <global>
class ba : public MonoBehaviour
{
public:

    // Methods
    void dhk();  // RVA: 0x634510
    void .ctor();  // RVA: 0x629A00
    void eku();  // RVA: 0x634510
    void hhk();  // RVA: 0x634510
    void Update();  // RVA: 0x634510
    void Start();  // RVA: 0x634510
    void nws();  // RVA: 0x634510
    void nxg();  // RVA: 0x634510
    void idd();  // RVA: 0x634510
};

// Namespace: <global>
class bb
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bawn; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* bawo; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BlinkAnimation* bawp; // 0x0020

    // Methods
    void .ctor(int32_t a);  // RVA: 0x674D60
    void dvd();  // RVA: 0x634510
    bool MoveNext();  // RVA: 0x80EA00
    Il2CppObject* dve();  // RVA: 0x69E850
    void dvf();  // RVA: 0x80EC20
    Il2CppObject* dvg();  // RVA: 0x69E850
};

// Namespace: <global>
class bc
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bawq; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* bawr; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BlinkAnimation* baws; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float bawt; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    float bawu; // 0x002C
    uint8_t pad_002D[0x3]; // 0x002D
    float bawv; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float baww; // 0x0034

    // Methods
    void .ctor(int32_t a);  // RVA: 0x674D60
    void dvh();  // RVA: 0x634510
    bool MoveNext();  // RVA: 0x80EC60
    Il2CppObject* dvi();  // RVA: 0x69E850
    void dvj();  // RVA: 0x80EDA0
    Il2CppObject* dvk();  // RVA: 0x69E850
};

// Namespace: <global>
class bd
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bawx; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* bawy; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BlinkAnimation* bawz; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float baxa; // 0x0028

    // Methods
    void .ctor(int32_t a);  // RVA: 0x674D60
    void dvl();  // RVA: 0x634510
    bool MoveNext();  // RVA: 0x80EDE0
    Il2CppObject* dvm();  // RVA: 0x69E850
    void dvn();  // RVA: 0x80EEF0
    Il2CppObject* dvo();  // RVA: 0x69E850
};

// Namespace: <global>
class BlinkAnimation : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    float blinkSpeed; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    float minAlpha; // 0x0024
    uint8_t pad_0025[0x3]; // 0x0025
    float maxAlpha; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    bool smoothBlink; // 0x002C
    bool playOnStart; // 0x002D
    bool loop; // 0x002E
    bool unscaledTime; // 0x002F
    SpriteRenderer* baxb; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Image* baxc; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    CanvasGroup* baxd; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    TextMesh* baxe; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    MeshRenderer* baxf; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    TextMeshProUGUI* baxg; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    TextMeshPro* baxh; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    bool baxi; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    Coroutine* baxj; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    float baxk; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    Action* OnBlinkStart; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    Action* OnBlinkEnd; // 0x0088
    uint8_t pad_0089[0x7]; // 0x0089
    Action* OnBlinkCycle; // 0x0090

    // Methods
    bool dvp();  // RVA: 0x800FA0
    float dvq();  // RVA: 0x800FB0
    void dvr(float a);  // RVA: 0x800FC0
    float dvs();  // RVA: 0x800FE0
    float dvt();  // RVA: 0x800FF0
    void Awake();  // RVA: 0x800EE0
    void Start();  // RVA: 0x800F70
    void OnValidate();  // RVA: 0x800F00
    void dvu();  // RVA: 0x801000
    void dvv();  // RVA: 0x8012D0
    void dvw();  // RVA: 0x801540
    void dvx();  // RVA: 0x8015F0
    void dvy();  // RVA: 0x801640
    void dvz();  // RVA: 0x801730
    void dwa(float a);  // RVA: 0x801740
    float dwb();  // RVA: 0x801B50
    void dwc(float a, float b, float c, bool d);  // RVA: 0x801DC0
    IEnumerator* dwd();  // RVA: 0x801F30
    IEnumerator* dwe(float a);  // RVA: 0x801FA0
    IEnumerator* dwf(float a);  // RVA: 0x802020
    void dwg();  // RVA: 0x8020A0
    void .ctor();  // RVA: 0x800F80
};

// Namespace: <global>
struct SpriteAnimClip
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Il2CppString* ClipName; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Sprite[][] Sprites; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bool Loop; // 0x0020
};

// Namespace: <global>
class be
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t baxl; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* baxm; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    SpriteAnimation_Image* baxn; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float baxo; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    int32_t baxp; // 0x002C

    // Methods
    void .ctor(int32_t a);  // RVA: 0x674D60
    void dwh();  // RVA: 0x634510
    bool MoveNext();  // RVA: 0x80EF30
    Il2CppObject* dwi();  // RVA: 0x69E850
    void dwj();  // RVA: 0x80F170
    Il2CppObject* dwk();  // RVA: 0x69E850
};

// Namespace: <global>
class SpriteAnimation_Image : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Image* image; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    System.Collections.Generic.List<UnityEngine.Sprite> sprites; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float duration; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float speed; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    bool playOnStart; // 0x0038
    bool PlayOnEnable; // 0x0039
    bool loop; // 0x003A
    bool unscaledTime; // 0x003B
    bool m_deactivateOnComplete; // 0x003C
    uint8_t pad_003D[0x3]; // 0x003D
    Coroutine* baxq; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    bool baxr; // 0x0048
    uint8_t pad_0049[0x3]; // 0x0049
    int32_t baxs; // 0x004C
    uint8_t pad_004D[0x3]; // 0x004D
    Action* OnAnimationStart; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    Action* OnAnimationComplete; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    System.Action<System.Int32> OnFrameChanged; // 0x0060

    // Methods
    Image* dwl();  // RVA: 0x63DB10
    System.Collections.Generic.List<UnityEngine.Sprite> dwm();  // RVA: 0x67A2A0
    float dwn();  // RVA: 0x808530
    float dwo();  // RVA: 0x808540
    bool dwp();  // RVA: 0x808550
    bool dwq();  // RVA: 0x808560
    int32_t dwr();  // RVA: 0x808570
    int32_t dws();  // RVA: 0x808580
    float dwt();  // RVA: 0x8085C0
    void Start();  // RVA: 0x808440
    void OnEnable();  // RVA: 0x808330
    void OnValidate();  // RVA: 0x808390
    void dwu();  // RVA: 0x808610
    void dwv();  // RVA: 0x8087F0
    void dww();  // RVA: 0x808840
    void dwx(int32_t a);  // RVA: 0x8088D0
    void dwy();  // RVA: 0x8089D0
    void dwz();  // RVA: 0x808A20
    IEnumerator* dxa();  // RVA: 0x808A80
    void dxb(float a, float b, bool c);  // RVA: 0x808AF0
    void dxc(System.Collections.Generic.List<UnityEngine.Sprite> a);  // RVA: 0x808B90
    void dxd(Sprite* a);  // RVA: 0x808D10
    void dxe(int32_t a);  // RVA: 0x808DA0
    void dxf();  // RVA: 0x808E30
    void dxg();  // RVA: 0x634510
    void .ctor();  // RVA: 0x8084A0
};

// Namespace: <global>
class bf
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t baxt; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* baxu; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    SpriteAnimation_SpriteRenderer* baxv; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float baxw; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    int32_t baxx; // 0x002C

    // Methods
    void .ctor(int32_t a);  // RVA: 0x674D60
    void dxh();  // RVA: 0x634510
    bool MoveNext();  // RVA: 0x80F1B0
    Il2CppObject* dxi();  // RVA: 0x69E850
    void dxj();  // RVA: 0x80F690
    Il2CppObject* dxk();  // RVA: 0x69E850
};

// Namespace: <global>
class SpriteAnimation_SpriteRenderer : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    SpriteRenderer* spriteRenderer; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    System.Collections.Generic.List<UnityEngine.Sprite> sprites; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float duration; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float delay; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    bool playOnStart; // 0x0038
    bool PlayOnEnable; // 0x0039
    bool DisableObjectWhenPlayEnd; // 0x003A
    bool m_disableRendererWhenPlayEnd; // 0x003B
    bool loop; // 0x003C
    bool unscaledTime; // 0x003D
    bool randomZRotation; // 0x003E
    uint8_t pad_003F[0x1]; // 0x003F
    Coroutine* baxy; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    bool baxz; // 0x0048
    uint8_t pad_0049[0x3]; // 0x0049
    int32_t baya; // 0x004C
    uint8_t pad_004D[0x3]; // 0x004D
    Color bayb; // 0x0050
    uint8_t pad_0051[0xF]; // 0x0051
    bool bayc; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    WaitForSeconds* bayd; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    WaitForSecondsRealtime* baye; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    float bayf; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    Action* OnAnimationStart; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    Action* OnAnimationComplete; // 0x0088
    uint8_t pad_0089[0x7]; // 0x0089
    System.Action<System.Int32> OnFrameChanged; // 0x0090
    uint8_t pad_0091[0x7]; // 0x0091
    Action* OnDelayStart; // 0x0098
    uint8_t pad_0099[0x7]; // 0x0099
    Action* OnDelayComplete; // 0x00A0

    // Methods
    SpriteRenderer* dxl();  // RVA: 0x63DB10
    System.Collections.Generic.List<UnityEngine.Sprite> dxm();  // RVA: 0x67A2A0
    float dxn();  // RVA: 0x808530
    float dxo();  // RVA: 0x808540
    bool dxp();  // RVA: 0x8091A0
    bool dxq();  // RVA: 0x808560
    int32_t dxr();  // RVA: 0x808570
    int32_t dxs();  // RVA: 0x8091B0
    float dxt();  // RVA: 0x8091F0
    void Start();  // RVA: 0x809080
    void OnEnable();  // RVA: 0x808F60
    void OnDisable();  // RVA: 0x808EC0
    void dxu();  // RVA: 0x809240
    void dxv();  // RVA: 0x8092D0
    void OnValidate();  // RVA: 0x808FD0
    void dxw();  // RVA: 0x8093D0
    void dxx();  // RVA: 0x8094D0
    void dxy();  // RVA: 0x809580
    void dxz(int32_t a);  // RVA: 0x8095F0
    void dya();  // RVA: 0x8096F0
    void dyb();  // RVA: 0x809740
    WaitForSeconds* dyc(float a);  // RVA: 0x8097A0
    WaitForSecondsRealtime* dyd(float a);  // RVA: 0x809870
    IEnumerator* dye();  // RVA: 0x809940
    void dyf(float a, float b, bool c);  // RVA: 0x8099B0
    void dyg(System.Collections.Generic.List<UnityEngine.Sprite> a);  // RVA: 0x809A30
    void dyh(Sprite* a);  // RVA: 0x809B80
    void dyi(int32_t a);  // RVA: 0x809C10
    void dyj();  // RVA: 0x809CA0
    void dyk();  // RVA: 0x634510
    void .ctor();  // RVA: 0x809110
};

// Namespace: <global>
class <>c
{
public:
    // Static fields
    // static <>c* <>9;
    // static UnityAction* <>9__15_0;


    // Methods
    static void .cctor();  // RVA: 0x80B8F0
    void .ctor();  // RVA: 0x629570
    void dyl();  // RVA: 0x80B960
};

// Namespace: <global>
class BottomStageQuickMenu : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    bool bayg; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    RectTransform* m_quickMenu; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    ScreenBoundsCorrector* m_screenBoundsCorrector; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    float m_bottomOnTopPos; // 0x0038
    uint8_t pad_0039[0x3]; // 0x0039
    float m_bottomOnBottomPos; // 0x003C
    uint8_t pad_003D[0x3]; // 0x003D
    oi* m_quickMenuHoverCheck; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    Button* m_nonPresetButton; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Button* m_pinBattleScreenButton; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    TextMeshProUGUI* m_pinBattleScreenText; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    Button* m_muteButton; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    TextMeshProUGUI* m_muteText; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    Button* m_alwaysOnTopButton; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    TextMeshProUGUI* m_alwaysOnTopText; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    System.Collections.Generic.List<TaskbarHero.UI.LayoutPresetButton> m_layoutPresetButtons; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    bool bayh; // 0x0088

    // Methods
    void dym();  // RVA: 0x802760
    void dyn(bool a);  // RVA: 0x8033E0
    void dyo(bool a);  // RVA: 0x803460
    void dyp(bool a);  // RVA: 0x803540
    void dyq(ESoundType a, float b);  // RVA: 0x803620
    void Update();  // RVA: 0x802700
    void OnDisable();  // RVA: 0x6299F0
    void OnPointerClick(PointerEventData* eventData);  // RVA: 0x802530
    void OnPointerEnter(PointerEventData* eventData);  // RVA: 0x8026F0
    void OnPointerExit(PointerEventData* eventData);  // RVA: 0x6299F0
    void .ctor();  // RVA: 0x629A00
    void dyr();  // RVA: 0x803750
};

// Namespace: <global>
class StageTooltip : public MonoBehaviour
{
public:
    // Static fields
    // static int32_t bayi;
    // static int32_t bayj;

    uint8_t pad_0000[0x20]; // 0x0000
    TextMeshProUGUI* m_titleText; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* m_stageTypeText; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    TextMeshProUGUI* m_stageLevelText; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Image* m_BG; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Sprite[][] m_bgSprites; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    GameObject* m_soulStoneBG; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Image* m_soulStoneIcon; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    TextMeshProUGUI* m_soulStoneAmountText; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    SpriteAnimation_Image* m_bluePortalAnim; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    SpriteAnimation_Image* m_redPortalAnim; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    GameObject* m_lockIcon; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    GameObject* m_bottomText; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    TextMeshProUGUI* m_bottomTextLabel; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    GameObject* m_mouseIcon; // 0x0088
    uint8_t pad_0089[0x7]; // 0x0089
    TextMeshProUGUI* m_enterText; // 0x0090
    uint8_t pad_0091[0x7]; // 0x0091
    Color m_normalColor; // 0x0098
    uint8_t pad_0099[0xF]; // 0x0099
    Color m_actBossColor; // 0x00A8

    // Methods
    void Show(StageCache* cache);  // RVA: 0x809D10
    void Hide();  // RVA: 0x742C10
    void dys();  // RVA: 0x80A1D0
    void dyt(StageCache* a, int32_t b);  // RVA: 0x80A330
    void dyu(bool a, bool b);  // RVA: 0x80A5E0
    void dyv(SpriteAnimation_Image* a, SpriteAnimation_Image* b, bool c);  // RVA: 0x80A610
    void dyw(StageCache* a, bool b, bool c, bool d, int32_t e);  // RVA: 0x80A730
    void dyx(bool a, Il2CppString* b, Color c);  // RVA: 0x80AA70
    void .ctor();  // RVA: 0x629A00
};

// Namespace: <global>
struct EWorldUILocation
{
public:
    // Static fields
    // static EWorldUILocation Left;
    // static EWorldUILocation Center;
    // static EWorldUILocation Right;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
class UI_Main : public MonoBehaviour
{
public:
    // Static fields
    // static float bayl;
    // static float baym;
    // static float bayn;
    // static float bayo;

    uint8_t pad_0000[0x20]; // 0x0000
    UIManager* bayk; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    UiStateMachineBehaviour* _usm; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    RectTransform* panel_left; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    RectTransform* panel_right; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    RectTransform* panel_center; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    xr* button_Stash; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    xr* button_Stat; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    xr* button_Cube; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    xr* button_Rune; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    xr* button_Portal; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    System.Collections.Generic.List<xr> ContentButtons; // 0x0070

    // Methods
    void Awake();  // RVA: 0x80C230
    void dyy();  // RVA: 0x80C600
    void Start();  // RVA: 0x80C4D0
    void OnEnable();  // RVA: 0x80C4D0
    void dyz();  // RVA: 0x80C710
    EWorldUILocation dza(float a);  // RVA: 0x80C980
    bool dzb();  // RVA: 0x80C9A0
    bool dzc();  // RVA: 0x80CA20
    void dzd();  // RVA: 0x80CAA0
    void dze(float a);  // RVA: 0x80CAE0
    void dzf(float a);  // RVA: 0x80CB90
    void dzg(float a);  // RVA: 0x80CC40
    void dzh();  // RVA: 0x80CCF0
    void dzi();  // RVA: 0x80CCF0
    void dzj();  // RVA: 0x80CE50
    void dzk();  // RVA: 0x80CF30
    void dzl();  // RVA: 0x80CF40
    void dzm();  // RVA: 0x80D190
    void dzn();  // RVA: 0x80D310
    void dzo();  // RVA: 0x80D310
    void .ctor();  // RVA: 0x80C580
};

// Namespace: <global>
class OfflineHeroSlot
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    GameObject* slotObject; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    TextMeshProUGUI* nameText; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    TextMeshProUGUI* levelText; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* expText; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Image* baseExp; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Image* addedExp; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    GameObject* levelUpFX; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    System.Collections.Generic.List<UnityEngine.GameObject> heroList; // 0x0048

    // Methods
    void .ctor();  // RVA: 0x806440
};

// Namespace: <global>
struct <ShowLevelUpFX>d__21
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    UI_OfflineReward* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    System.Collections.Generic.List<UI_OfflineReward.OfflineHeroSlot> list; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Awaiter <>u__1; // 0x0030

    // Methods
    void MoveNext();  // RVA: 0x80B540
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x80B070
};

// Namespace: <global>
class UI_OfflineReward : public MonoBehaviour
{
public:
    // Static fields
    // static float bayp;
    // static float bayq;
    // static EEquipClassType[][] bayr;

    uint8_t pad_0000[0x20]; // 0x0000
    TextMeshProUGUI* m_lastLoginText; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TextMeshProUGUI* m_offlineTimeText; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Slider* m_timeSlider; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    TextMeshProUGUI* m_goldText; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    GameObject* m_blockBG; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    OfflineHeroSlot[][] heroSlots; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    CanvasGroup* m_parentCanvasGroup; // 0x0050

    // Methods
    void dzp(OfflineRewardResult a);  // RVA: 0x80D580
    void dzq(bool a);  // RVA: 0x80D860
    void dzr(OfflineRewardResult a);  // RVA: 0x80D880
    void dzs(OfflineRewardResult a);  // RVA: 0x80DB00
    void dzt(OfflineRewardResult a);  // RVA: 0x80DBC0
    void dzu(OfflineHeroSlot* a, OfflineRewardHeroResult b);  // RVA: 0x80DF40
    void dzv(OfflineHeroSlot* a, HeroInfoData* b);  // RVA: 0x80E460
    int32_t dzw(HeroInfoData* a);  // RVA: 0x80E620
    HeroInfoData* dzx(int32_t a);  // RVA: 0x80E700
    float dzy(float a, float b);  // RVA: 0x80E7F0
    UniTaskVoid dzz(System.Collections.Generic.List<UI_OfflineReward.OfflineHeroSlot> a);  // RVA: 0x80E820
    void OnDisable();  // RVA: 0x80D340
    void .ctor();  // RVA: 0x629A00
    static void .cctor();  // RVA: 0x80D4F0
    bool eaa();  // RVA: 0x80E8D0
};

// Namespace: <global>
struct EStatusUIState
{
public:
    // Static fields
    // static EStatusUIState Default;
    // static EStatusUIState StatDetail;
    // static EStatusUIState AttributeDetail;
    // static EStatusUIState SkillEquip;
    // static EStatusUIState SkillSlot;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
class bg : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Vector2 bays; // 0x0020

    // Methods
    void cby(Vector2 a);  // RVA: 0x80F6D0
    void baj(Vector2 a);  // RVA: 0x80F6D0
    void ead(float a);  // RVA: 0x80F6E0
    void gou(Vector2 a);  // RVA: 0x80F6E0
    void cdr(Vector2 a);  // RVA: 0x80F6D0
    void fcr(float a);  // RVA: 0x80F6E0
    void eab(Vector2 a);  // RVA: 0x80F6D0
    void hrg(Vector2 a);  // RVA: 0x80F6D0
    void .ctor();  // RVA: 0x629A00
    void hh(float a);  // RVA: 0x80F6E0
    void mls(float a);  // RVA: 0x80F6E0
    void eac(Vector2 a);  // RVA: 0x80F6E0
    void irs(float a);  // RVA: 0x80F6E0
    void jhh(Vector2 a);  // RVA: 0x80F6E0
};

// Namespace: <global>
struct <UpdateCoolTimeAsync>d__11
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bh* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x80BDF0
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x80B070
};

// Namespace: <global>
class bh
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    float bayt; // 0x0010
    uint8_t pad_0011[0x3]; // 0x0011
    int32_t bayu; // 0x0014
    uint8_t pad_0015[0x3]; // 0x0015
    System.Action<System.Int32> bayv; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    CancellationTokenSource* bayw; // 0x0020

    // Methods
    float eae();  // RVA: 0x80F770
    void ktg();  // RVA: 0x80F720
    void .ctor(int32_t a);  // RVA: 0x80F6F0
    void eah();  // RVA: 0x80F720
    void ikl();  // RVA: 0x80FA20
    UniTaskVoid eai();  // RVA: 0x80F890
    bool eaf();  // RVA: 0x80F780
    void dxe();  // RVA: 0x80F720
    void bra();  // RVA: 0x80F720
    void eag();  // RVA: 0x80F790
    void guh();  // RVA: 0x80F920
};

// Namespace: <global>
class bi
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bayx; // 0x0010

    // Methods
    void .ctor();  // RVA: 0x629570
};

// Namespace: <global>
class bj
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t bayy; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* bayz; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    DeadUnitData* baza; // 0x0020

    // Methods
    void .ctor(int32_t a);  // RVA: 0x674D60
    void eaj();  // RVA: 0x634510
    bool MoveNext();  // RVA: 0x80FB20
    Il2CppObject* eak();  // RVA: 0x69E850
    void eal();  // RVA: 0x80FCB0
    Il2CppObject* eam();  // RVA: 0x69E850
};

// Namespace: <global>
class DeadUnitData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    uf* cache; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    float currentResurrectionTime; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    System.Action<System.Single> OnProcessChange; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Coroutine* resurrectionCoroutine; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    int32_t bazb; // 0x0030

    // Methods
    int32_t ean();  // RVA: 0x803CA0
    void .ctor(uf* cache, int32_t dieOrder);  // RVA: 0x803B50
    void eao();  // RVA: 0x803CB0
    void eap();  // RVA: 0x803D80
    IEnumerator* eaq();  // RVA: 0x803E00
};

// Namespace: <global>
class ObstacleScriptableObject : public ScriptableObject
{
public:
    uint8_t pad_0000[0x18]; // 0x0000
    System.Collections.Generic.List<System.Single> ObstacleMoveSpeeds; // 0x0018

    // Methods
    void .ctor();  // RVA: 0x6ADFB0
};

// Namespace: <global>
class SkillSO : public ScriptableObject
{
public:
    uint8_t pad_0000[0x18]; // 0x0000
    SKILLTYPE skillTYPE; // 0x0018
    uint8_t pad_0019[0x3]; // 0x0019
    float preTime; // 0x001C
    uint8_t pad_001D[0x3]; // 0x001D
    float actionTime; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    float postTime; // 0x0024
    uint8_t pad_0025[0x3]; // 0x0025
    bool KeepActivateOnRecast; // 0x0028
    bool CanMultiCastSkill; // 0x0029
    uint8_t pad_002A[0x6]; // 0x002A
    PrefabAndOffSetEffect* SkillEf_StartEf_Me; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    PrefabAndOffSetEffect* SkillEf_Direct_Other; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    PrefabAndOffSetEffect* AreaOfEffect_Other_Hitted; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    PrefabAndOffSetProjecTile* SkillProjecTile; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    AreaOfEffectData AreaOfEffectObject; // 0x0050
    uint8_t pad_0051[0x17]; // 0x0051
    bco* WillSpawnTurret; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    bl* WillSpawnTrap; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    float WillSpawnTrapFixedY; // 0x0078
    uint8_t pad_0079[0x3]; // 0x0079
    float WillSpawnTrapSpeed; // 0x007C
    uint8_t pad_007D[0x3]; // 0x007D
    float WillSpawnTrapRandPosOffsetDividedRange; // 0x0080
    uint8_t pad_0081[0x3]; // 0x0081
    float WillSpawnTrapRandPosOffsetIncrementDividedRange; // 0x0084
    uint8_t pad_0085[0x3]; // 0x0085
    float WillSpawnTrapRandPosMaxOffsetDividedRange; // 0x0088
    uint8_t pad_0089[0x3]; // 0x0089
    float WillFinalOffsetXDividedRange_Move; // 0x008C
    uint8_t pad_008D[0x3]; // 0x008D
    float WillFinalOffsetXDividedRange_NotMove; // 0x0090
    uint8_t pad_0091[0x7]; // 0x0091
    SpawnSomethingData SpawnSomethingData; // 0x0098
    uint8_t pad_0099[0x17]; // 0x0099
    MonsterRandomSpawnData RandomMonsterSpawnData; // 0x00B0
    uint8_t pad_00B1[0x17]; // 0x00B1
    Sprite* SkillSprite; // 0x00C8
    uint8_t pad_00C9[0x7]; // 0x00C9
    AnimationClip* SkillClip1; // 0x00D0
    uint8_t pad_00D1[0x7]; // 0x00D1
    AnimationClip* SkillClip2; // 0x00D8
    uint8_t pad_00D9[0x7]; // 0x00D9
    AnimationClip* SkillClip3; // 0x00E0

    // Methods
    bool ear();  // RVA: 0x8082C0
    bool eas();  // RVA: 0x8082D0
    bool eat();  // RVA: 0x8082E0
    bool eau();  // RVA: 0x8082F0
    bool eav();  // RVA: 0x808300
    bool eaw();  // RVA: 0x808310
    bool eax();  // RVA: 0x808320
    void .ctor();  // RVA: 0x8082B0
};

// Namespace: <global>
struct SpawnSomethingData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    GameObject* SpawnPrefab; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector3 Offset; // 0x0018
};

// Namespace: <global>
struct MonsterRandomSpawnData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    System.Collections.Generic.List<System.Int32> RandomSpawnMonsterKey; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    int32_t SpawnCount; // 0x0018
    uint8_t pad_0019[0x3]; // 0x0019
    float RandomSpawnPosOffsetMin; // 0x001C
    uint8_t pad_001D[0x3]; // 0x001D
    float RandomSpawnPosOffsetMax; // 0x0020
};

// Namespace: <global>
struct AreaOfEffectData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    GameObject* Prefab; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector3 OffSet; // 0x0018
};

// Namespace: <global>
class PrefabAndOffSetEffect
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    GameObject* Go_Prefab; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector3 OffSet; // 0x0018

    // Methods
    void .ctor();  // RVA: 0x8064C0
};

// Namespace: <global>
class PrefabAndOffSetProjecTile
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    bdb* Go_Prefab; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector3 OffSet; // 0x0018

    // Methods
    void .ctor();  // RVA: 0x8064C0
};

// Namespace: <global>
class TrapExplosionData : public ScriptableObject
{
public:
    uint8_t pad_0000[0x18]; // 0x0000
    EDamageAttribute ReactDamageType; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bbs* AreaOfEffect; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Il2CppString* ExplosionTriggerName; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float DividedExplosionDelayTime; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    int32_t DamageIncreaseValue; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    StatusEffectType StatusEffectType; // 0x0038
    uint8_t pad_0039[0x3]; // 0x0039
    float StatusEffectChance; // 0x003C

    // Methods
    void .ctor();  // RVA: 0x6ADFB0
};

// Namespace: <global>
struct <ActivatingExplosion>d__31
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bk* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    TrapExplosionData* data; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Awaiter <>u__1; // 0x0030

    // Methods
    void MoveNext();  // RVA: 0x80ABA0
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x80B070
};

// Namespace: <global>
class bk : public bl
{
public:
    uint8_t pad_0000[0x48]; // 0x0000
    TrapExplosionData[][] ExplosionData; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Unit* bazc; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    System.Collections.Generic.Dictionary<TaskbarHero.Data.EDamageAttribute,TrapExplosionData> bazd; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    float baze; // 0x0060
    uint8_t pad_0061[0x3]; // 0x0061
    EDamageAttribute bazf; // 0x0064
    uint8_t pad_0065[0x3]; // 0x0065
    EDamageType bazg; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    TrapExplosionData* bazh; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    bool bazi; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    CancellationTokenSource* bazj; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    Action* bazk; // 0x0088
    uint8_t pad_0089[0x7]; // 0x0089
    int32_t bazl; // 0x0090
    uint8_t pad_0091[0x3]; // 0x0091
    int32_t bazm; // 0x0094
    uint8_t pad_0095[0x3]; // 0x0095
    int32_t bazn; // 0x0098

    // Methods
    void izo(float a, Unit* b, EDamageType c, Action* d);  // RVA: 0x80FE70
    Vector3 eay();  // RVA: 0x80FDF0
    DamageableType eba();  // RVA: 0x80FE40
    void kyf(float a, Unit* b, EDamageType c, Action* d);  // RVA: 0x80FE70
    Transform* ebc();  // RVA: 0x80FE60
    void npm();  // RVA: 0x80FD90
    void ebe(int32_t a, int32_t b, int32_t c);  // RVA: 0x80FD70
    void ebf(EDamageAttribute a);  // RVA: 0x80FEC0
    void dzy();  // RVA: 0x80FD90
    DamageInfo hwm();  // RVA: 0x8106F0
    void .ctor();  // RVA: 0x80FCF0
    DamageInfo imd();  // RVA: 0x8108B0
    void ebk();  // RVA: 0x80FD90
    void eeo(float a, Unit* b, EDamageType c, Action* d);  // RVA: 0x80FE70
    void ebd(float a, Unit* b, EDamageType c, Action* d);  // RVA: 0x80FE70
    bool eaz();  // RVA: 0x66D1E0
    UniTaskVoid ebl(TrapExplosionData* a);  // RVA: 0x810380
    void ebj();  // RVA: 0x8102F0
    DamageInfo lcm();  // RVA: 0x810A70
    void dky(int32_t a, int32_t b, int32_t c);  // RVA: 0x80FD70
    Unit* ebb();  // RVA: 0x80FE50
    Bounds ebo();  // RVA: 0x810620
    void ebh(Vector3 a, Vector3 b, float c, float d);  // RVA: 0x80FFC0
    Vector3 ebp();  // RVA: 0x62EF60
    void omc(int32_t a, int32_t b, int32_t c);  // RVA: 0x80FD70
    float ebn();  // RVA: 0x8105F0
    DamageInfo lzs();  // RVA: 0x810C30
    void kkn(float a, Unit* b, EDamageType c, Action* d);  // RVA: 0x80FE70
    void duc();  // RVA: 0x80FD90
    DamageInfo ebm();  // RVA: 0x810430
    void ebg(float a);  // RVA: 0x80FF70
    void ebi(DamageInfo a, bool b);  // RVA: 0x810140
    void mlq(int32_t a, int32_t b, int32_t c);  // RVA: 0x80FD70
    int32_t ebq();  // RVA: 0x8106E0
};

// Namespace: <global>
struct <UpdateTrapLifeTime>d__11
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bl* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x80BFF0
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x80B070
};

// Namespace: <global>
class bl : public bch
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Animator* TrapAnimator; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    bdg* TrapMover; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float LifeTime; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float TrapMoveSpeed; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    float TrapMoveHeight; // 0x0038
    uint8_t pad_0039[0x3]; // 0x0039
    bool bazo; // 0x003C
    uint8_t pad_003D[0x3]; // 0x003D
    CancellationTokenSource* bazp; // 0x0040

    // Methods
    void mog();  // RVA: 0x811520
    void ebu();  // RVA: 0x8113E0
    void fdn();  // RVA: 0x811420
    void ebj();  // RVA: 0x811200
    void .ctor();  // RVA: 0x810E10
    void ebt();  // RVA: 0x811360
    void bko();  // RVA: 0x810E20
    void z();  // RVA: 0x8115A0
    void OnDisable();  // RVA: 0x810DF0
    void gur();  // RVA: 0x8114A0
    void ebh(Vector3 a, Vector3 b, float c, float d);  // RVA: 0x810EA0
    UniTaskVoid ebs();  // RVA: 0x8112D0
    void gcr();  // RVA: 0x810DF0
    void ebr();  // RVA: 0x811250
};

// Namespace: <global>
struct <UpdateAsync>d__15
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AsyncUniTaskVoidMethodBuilder <>t__builder; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    LineController* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Awaiter <>u__1; // 0x0028

    // Methods
    void MoveNext();  // RVA: 0x80B990
    void SetStateMachine(IAsyncStateMachine* stateMachine);  // RVA: 0x80B070
};

// Namespace: <global>
class LineController : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    bool OnlyOneLoop; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    LineRenderer* LineRenderer; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Texture[][] lineTextures; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    float Fps; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    SpriteRenderer* m_headCap; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    SpriteRenderer* m_tailCap; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    float bazq; // 0x0050
    uint8_t pad_0051[0x3]; // 0x0051
    int32_t bazr; // 0x0054
    uint8_t pad_0055[0x3]; // 0x0055
    bool bazs; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    Transform* bazt; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    Transform* bazu; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    Vector3 bazv; // 0x0070
    uint8_t pad_0071[0xB]; // 0x0071
    Vector3 bazw; // 0x007C

    // Methods
    void ebv();  // RVA: 0x805AD0
    void ebw(Transform* a, Transform* b, Vector3 c, Vector3 d);  // RVA: 0x805B30
    UniTaskVoid ebx();  // RVA: 0x805DE0
    void eby(Vector3 a, Vector3 b);  // RVA: 0x805E60
    void .ctor();  // RVA: 0x629A00
};

// Namespace: <global>
class bm : public bz
{
public:
    uint8_t pad_0000[0x38]; // 0x0000
    float FloorHalfSize; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    System.Collections.Generic.List<UnityEngine.GameObject> Presets; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    FollowCamera* FollowCamera; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    float ObstacleMoveSpeed; // 0x0050
    uint8_t pad_0051[0x3]; // 0x0051
    float TimeCorrectionValue; // 0x0054
    uint8_t pad_0055[0x3]; // 0x0055
    float bazx; // 0x0058
    uint8_t pad_0059[0x3]; // 0x0059
    int32_t bazy; // 0x005C
    uint8_t pad_005D[0x3]; // 0x005D
    System.Collections.Generic.List<bo> ChildLayers; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    int32_t bazz; // 0x0068
    uint8_t pad_0069[0x3]; // 0x0069
    float bbaa; // 0x006C
    uint8_t pad_006D[0x3]; // 0x006D
    Transform* bbab; // 0x0070

    // Methods
    void nbs();  // RVA: 0x813AC0
    void ecc(Transform* a);  // RVA: 0x812600
    void Update();  // RVA: 0x811870
    void End();  // RVA: 0x811620
    void izc(Vector3 a, float b, int32_t c);  // RVA: 0x812D80
    void myn();  // RVA: 0x811810
    void lkl(Vector3 a, float b, int32_t c);  // RVA: 0x813440
    void eca();  // RVA: 0x8121F0
    void Hide();  // RVA: 0x811810
    void gyb(Transform* a);  // RVA: 0x812B00
    void ktl(Vector3 a, float b, int32_t c);  // RVA: 0x8130E0
    void mfd();  // RVA: 0x8137A0
    void edd();  // RVA: 0x811840
    void .ctor();  // RVA: 0x811B90
    void nzg();  // RVA: 0x813DE0
    void Show();  // RVA: 0x811840
    void yo(Transform* a);  // RVA: 0x814420
    void ecb(Transform* a);  // RVA: 0x812380
    void cyk(Transform* a);  // RVA: 0x811C10
    void ebz(Vector3 a, float b, int32_t c);  // RVA: 0x811E90
    void tx();  // RVA: 0x814100
    void gie(Transform* a);  // RVA: 0x812880
};

// Namespace: <global>
class bn : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Camera* bbac; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    UI_Stage* bbad; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    bool OnHover; // 0x0030

    // Methods
    void ecg();  // RVA: 0x814760
    void mgm();  // RVA: 0x814730
    void Start();  // RVA: 0x8146A0
    void opq();  // RVA: 0x8147F0
    void .ctor();  // RVA: 0x629A00
    void Update();  // RVA: 0x814730
};

// Namespace: <global>
class bo : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    System.Collections.Generic.List<SpriteAnimation_SpriteRenderer> SpriteAnimationList; // 0x0020

    // Methods
    void ecd();  // RVA: 0x814880
    void .ctor();  // RVA: 0x629A00
    void ece();  // RVA: 0x8149C0
    void eqk();  // RVA: 0x814AD0
    void jkm();  // RVA: 0x814BE0
};

// Namespace: <global>
class bp : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    System.Collections.Generic.List<UnityEngine.GameObject> BackGroundPresets; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    FollowCamera* FollowCamera; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float ObstacleMoveSpeed; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    System.Collections.Generic.List<SpriteAnimation_SpriteRenderer> SpriteAnimationList; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Vector3 bbae; // 0x0040

    // Methods
    void ecf(Vector3 a);  // RVA: 0x8150B0
    void igf();  // RVA: 0x814CF0
    void Awake();  // RVA: 0x814CF0
    void End();  // RVA: 0x814D30
    void ccc();  // RVA: 0x814CF0
    void mra();  // RVA: 0x814CF0
    void njr(Vector3 a);  // RVA: 0x815AF0
    void Update();  // RVA: 0x814E80
    void ltn(Vector3 a);  // RVA: 0x815720
    void .ctor();  // RVA: 0x629A00
    void hbq();  // RVA: 0x8155D0
    void moo();  // RVA: 0x814CF0
    void hbc();  // RVA: 0x815480
};

// Namespace: <global>
class bq
{
public:
    // Static fields
    // static Il2CppString* bbaf;
    // static Il2CppString* bbag;
    // static Il2CppString* bbah;
    // static Il2CppString* bbai;
    // static Il2CppString* bbaj;
    // static Il2CppString* bbak;
    // static Il2CppString* bbal;


    // Methods
    static void .cctor();  // RVA: 0x815EC0
};

// Namespace: <global>
class FollowCamera : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    StageManager* _stageController; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Unit[][] _targets; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Vector3 _battleModeOffset; // 0x0030
    uint8_t pad_0031[0xF]; // 0x0031
    RectTransform* m_stageUIRect; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    BoxCollider2D* m_collider2D; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Vector3 windowFrameOffset; // 0x0050
    uint8_t pad_0051[0xB]; // 0x0051
    Vector3 bbam; // 0x005C
    uint8_t pad_005D[0xB]; // 0x005D
    float bban; // 0x0068
    uint8_t pad_0069[0x3]; // 0x0069
    float bbao; // 0x006C
    uint8_t pad_006D[0x3]; // 0x006D
    float m_monsterTargetOffsetValue; // 0x0070
    uint8_t pad_0071[0x3]; // 0x0071
    float m_monsterFollowCameraCenterOffset; // 0x0074
    uint8_t pad_0075[0x3]; // 0x0075
    Vector3 m_windowFrameMonsterBattleFollowOffset; // 0x0078
    uint8_t pad_0079[0xB]; // 0x0079
    Vector3 m_windowFrameCorrectionOffset; // 0x0084
    uint8_t pad_0085[0xB]; // 0x0085
    float m_heroSpreadMaxDistance; // 0x0090
    uint8_t pad_0091[0x3]; // 0x0091
    float m_heroSpreadTargetOffsetX; // 0x0094
    uint8_t pad_0095[0x3]; // 0x0095
    float m_maxFollowDistance; // 0x0098
    uint8_t pad_0099[0x3]; // 0x0099
    float m_catchUpSpeedMultiplier; // 0x009C
    uint8_t pad_009D[0x3]; // 0x009D
    float bbap; // 0x00A0
    uint8_t pad_00A1[0x7]; // 0x00A1
    TMP_InputField* m_debugCorrectionOffsetXInput; // 0x00A8
    uint8_t pad_00A9[0x7]; // 0x00A9
    TMP_InputField* m_debugCorrectionOffsetYInput; // 0x00B0
    uint8_t pad_00B1[0x7]; // 0x00B1
    TMP_InputField* m_debugCorrectionOffsetZInput; // 0x00B8

    // Methods
    Transform* ecg();  // RVA: 0x8042A0
    Vector3 ech();  // RVA: 0x8042D0
    float eci();  // RVA: 0x804310
    void Start();  // RVA: 0x8041E0
    void ecj();  // RVA: 0x804320
    void eck(Il2CppString* a);  // RVA: 0x804620
    void ecl(Il2CppString* a);  // RVA: 0x804660
    void ecm(Il2CppString* a);  // RVA: 0x8046A0
    void Update();  // RVA: 0x8041F0
    void ecn();  // RVA: 0x8046E0
    void eco(float a);  // RVA: 0x8049B0
    void ecp(Unit[][] a);  // RVA: 0x8049C0
    Vector3 ecq();  // RVA: 0x804C80
    Vector3 ecr();  // RVA: 0x804D90
    Vector3 ecs();  // RVA: 0x804EA0
    void ect(Vector3 a);  // RVA: 0x8053A0
    void .ctor();  // RVA: 0x804200
};

// Namespace: <global>
class TestFollowScript : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Transform* m_stageUIRect; // 0x0020

    // Methods
    void Update();  // RVA: 0x81E350
    void .ctor();  // RVA: 0x629A00
};

// Namespace: <global>
class br
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Il2CppString* bbaq; // 0x0010

    // Methods
    bool ldj(Il2CppString* a);  // RVA: 0x81F670
    void .ctor();  // RVA: 0x629570
    bool ecu(Il2CppString* a);  // RVA: 0x81F670
};

// Namespace: <global>
class CsvManager : public MonoBehaviour
{
public:
    // Static fields
    // static CsvManager* bbar;

    uint8_t pad_0000[0x20]; // 0x0000
    Il2CppString* m_csvFolderPath; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    System.Collections.Generic.List<UnityEngine.TextAsset> m_csvTextAssets; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    System.Collections.Generic.Dictionary<System.String,UnityEngine.TextAsset> bbas; // 0x0030

    // Methods
    static CsvManager* ecv();  // RVA: 0x81A240
    void Awake();  // RVA: 0x81A0E0
    void ecw();  // RVA: 0x81A280
    System.Collections.Generic.List<a> ecx(Il2CppString* a);  // RVA: 0x41BD30
    TextAsset* ecy(Il2CppString* a);  // RVA: 0x81A410
    String[][] ecz(Il2CppString* a);  // RVA: 0x81A470
    void .ctor();  // RVA: 0x81A140
};

// Namespace: <global>
class AnimationEf : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    SpriteRenderer* spr; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    SpriteAnimation_SpriteRenderer* sprite_Animation; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
